[
  {
    "_id": 1234,
    "recipe_id": 39,
    "user_id": 1530,
    "user": "Carole Reu",
    "Rating": 5,
    "Review": "better than any you can get at a restaurant!"
  },
  {
    "_id": 1235,
    "recipe_id": 41,
    "user_id": 1531,
    "user": "Mimi Hiller",
    "Rating": 4,
    "Review": "I cut back on the mayoand made up the difference with sour cream to adjust the stiffness of the dip."
  },
  {
    "_id": 1236,
    "recipe_id": 42,
    "user_id": 1533,
    "user": "Dancer",
    "Rating": 5,
    "Review": "easily the best i have ever had.  juicy flavorfulnot dry.  the vegetables retain crispness as wellnot bland at all!"
  },
  {
    "_id": 1237,
    "recipe_id": 43,
    "user_id": 1534,
    "user": "Tonkcats",
    "Rating": 0,
    "Review": "Would someone please check the Nutrition Facts of this recipe."
  },
  {
    "_id": 1238,
    "recipe_id": 44,
    "user_id": 1535,
    "user": "Marg CaymanDesigns",
    "Rating": 4,
    "Review": "a little greasybut a huge hit with the guests."
  },
  {
    "_id": 1239,
    "recipe_id": 45,
    "user_id": 1537,
    "user": "Barbara5",
    "Rating": 5,
    "Review": "leeks on a pizza?!  it was really delicious.  i used a boboli and added some chicken sausage slices and mushrooms too."
  },
  {
    "_id": 1240,
    "recipe_id": 46,
    "user_id": 1538,
    "user": "Duckie067",
    "Rating": 5,
    "Review": "I deleted the bean sprouts and replaced them with salted cashew nuts...a nice complement to the sweet/sour dressing. Our guests loved itin my opinion,it deserves a \"5-pan\" rating."
  },
  {
    "_id": 1241,
    "recipe_id": 47,
    "user_id": 1539,
    "user": "opal Fitzgerald",
    "Rating": 1,
    "Review": "Where does the bbq come in"
  },
  {
    "_id": 1242,
    "recipe_id": 48,
    "user_id": 1542,
    "user": "ann joy",
    "Rating": 3,
    "Review": "It is a good recipe...but I believe that it would be better if it had raisins included  :)"
  },
  {
    "_id": 1243,
    "recipe_id": 49,
    "user_id": 1543,
    "user": "Doreen Randal",
    "Rating": 2,
    "Review": "This recipe is called pumpkin squareswheres the squares? ITS A PIE !"
  },
  {
    "_id": 1244,
    "recipe_id": 50,
    "user_id": 1544,
    "user": "tranch",
    "Rating": 3,
    "Review": "Careful not to cook it too long... you want the tuna to be closer to raw on the inside and crusty on the outside. Maybe use canola oil instead of butter to help sear the outside."
  },
  {
    "_id": 1245,
    "recipe_id": 51,
    "user_id": 1545,
    "user": "Nancy Van Ess",
    "Rating": 4,
    "Review": "Took about 70 minutes to bake."
  },
  {
    "_id": 1246,
    "recipe_id": 53,
    "user_id": 1546,
    "user": "Jane McCLure",
    "Rating": 5,
    "Review": "These have been an absolute hit with everyone every time I have made them.  They are incredibly easy to make and just heavenly!"
  },
  {
    "_id": 1247,
    "recipe_id": 54,
    "user_id": 1547,
    "user": "Morton Design Graph",
    "Rating": 5,
    "Review": "Working 12 hour days 7 days a weekI was delighted to return home to a delious meal from my Crockpot.  Easy tastyand delious are understatements for this recipe!"
  },
  {
    "_id": 1248,
    "recipe_id": 55,
    "user_id": 1548,
    "user": "Peggy Benisch",
    "Rating": 5,
    "Review": "I think this recipie is awesome. It tastes delicious and my whole family loved it."
  },
  {
    "_id": 1249,
    "recipe_id": 56,
    "user_id": 1549,
    "user": "Dave5003",
    "Rating": 5,
    "Review": "if you like oystersthis is a great alternative to regularboring stuffing."
  },
  {
    "_id": 1250,
    "recipe_id": 57,
    "user_id": 1550,
    "user": "Linda Sundbye",
    "Rating": 5,
    "Review": "quite easy to make make the taste is not bad either. i'd love to make it again and again with different toppings."
  },
  {
    "_id": 1251,
    "recipe_id": 58,
    "user_id": 1551,
    "user": "Sean Coate",
    "Rating": 0,
    "Review": "I thought Chicken Cacciatore had peppers. If i were to make thisit would contain about 5-6 cut up peppers1 can tomato paste and a large can of crushed tomatoes and of course the chicken."
  },
  {
    "_id": 1252,
    "recipe_id": 59,
    "user_id": 1552,
    "user": "Ron  Joyce Ripple S",
    "Rating": 5,
    "Review": "These make a wonderful healthy snack."
  },
  {
    "_id": 1253,
    "recipe_id": 60,
    "user_id": 1554,
    "user": "Jacques Lorrain",
    "Rating": 5,
    "Review": "This is a wonderful recipebut last I knew it was from the famous Chef David Ruggerio actually from his grandmother....so I think he deserves the credit."
  },
  {
    "_id": 1254,
    "recipe_id": 62,
    "user_id": 1555,
    "user": "Cindy Hartlin",
    "Rating": 3,
    "Review": "It's a tasty dish."
  },
  {
    "_id": 1255,
    "recipe_id": 63,
    "user_id": 1556,
    "user": "Strawberry Girl",
    "Rating": 3,
    "Review": "tasty. you can substitute granulated sugar for the palm sugar."
  },
  {
    "_id": 1256,
    "recipe_id": 64,
    "user_id": 1557,
    "user": "Angel Villanueva",
    "Rating": 4,
    "Review": "This is a lovely little repice. Quite delicious. However I recommend you cook the chicken breasts slowly and don't add the honey glaze until the last 4 to 5 minutes of cooking as it burns very quickly. Keping that in mindPlease try this quick and easy recipe. :)"
  },
  {
    "_id": 1257,
    "recipe_id": 66,
    "user_id": 1558,
    "user": "S. Malcolm",
    "Rating": 0,
    "Review": "Terrible directions. Doesn't say how to make the dough or the filling."
  },
  {
    "_id": 1258,
    "recipe_id": 67,
    "user_id": 1559,
    "user": "Will Parkinson",
    "Rating": 5,
    "Review": "It looks fabulousand will go great with my fresh cranberries from Eagle River WI."
  },
  {
    "_id": 1259,
    "recipe_id": 70,
    "user_id": 1562,
    "user": "Libby1",
    "Rating": 4,
    "Review": "needs more spice."
  },
  {
    "_id": 1260,
    "recipe_id": 71,
    "user_id": 1564,
    "user": "Ginny Holmy-Willcox",
    "Rating": 5,
    "Review": "I know that this recipe sounds strangebut I've tried it and it is the best fudge that I've ever had.  It's not too sweet like most areit stays soft (even after a few days). You must try ityou won't believe it!"
  },
  {
    "_id": 1261,
    "recipe_id": 72,
    "user_id": 1567,
    "user": "elly9812",
    "Rating": 4,
    "Review": "My husband LOVES this stuff.  It was the only thing he requested I make for Thanksgiving. The recipe is easy and if it makes him happy I'll keep making it."
  },
  {
    "_id": 1262,
    "recipe_id": 73,
    "user_id": 1569,
    "user": "Linda7",
    "Rating": 1,
    "Review": "Not much Effort."
  },
  {
    "_id": 1263,
    "recipe_id": 75,
    "user_id": 1570,
    "user": "Dave Miner",
    "Rating": 5,
    "Review": "This is the best pie crust I have ever made.  It is simple and easy.  I have tried to make it fail but can not.  The taste and texture is wonderful."
  },
  {
    "_id": 1264,
    "recipe_id": 78,
    "user_id": 1571,
    "user": "Linda Johansen",
    "Rating": 5,
    "Review": "Our family has enjoyed this recipetime and time again with great success. Favorite topping for this is to serve with chiligrated cheese and onions. The kids love it simply with catsup."
  },
  {
    "_id": 1265,
    "recipe_id": 79,
    "user_id": 1572,
    "user": "Ed Paulhus",
    "Rating": 4,
    "Review": "This recipie would be 5 STARS if you top it before you bake it with1 C crushed corn flakes1/2 C brown sugar1/4 chopped pecans4 Tbsp butter and a Tbsp of flour and bake as directed. Topping is about accurateto the best of my memorydefinately try....This is a Thanksgiving MUSTand NO ONE will believe it is carrots!!!!!!"
  },
  {
    "_id": 1266,
    "recipe_id": 80,
    "user_id": 1573,
    "user": "benluc",
    "Rating": 1,
    "Review": "This dish was good the first few bites then it got a vinager taste. I wont make it again"
  },
  {
    "_id": 1267,
    "recipe_id": 82,
    "user_id": 1530,
    "user": "Carole Reu",
    "Rating": 5,
    "Review": "This is a great quick,easy,tasy cheescake."
  },
  {
    "_id": 1268,
    "recipe_id": 83,
    "user_id": 1531,
    "user": "Mimi Hiller",
    "Rating": 4,
    "Review": "I found this meat loaf to be quite tastyI was a little nervous about the carrots,but it made it sweeter than I have tasted in a meat loaf. The measurements were a little over it made a rather large loaf and took a lot longer to cook. I had to raise the temp to 400 to get it to cook at a faster rate. It also gave off a lot of liquid and I used extra lean meat. It made about eight servings and all together was a good meat loaf. I would defintely make it again."
  },
  {
    "_id": 1269,
    "recipe_id": 85,
    "user_id": 1533,
    "user": "Dancer",
    "Rating": 5,
    "Review": "A lot of people at our baby shower said how much they liked this punch.  Even one person said that they didn't like champagne but they loved this punch.  It had a nice fruity flavor and pretty color.  This one will go in my recipe file.  I couldn't find the frozen pineapple-orange-guava juice so I went with pineapple-orange.  Thanks for this wonderful recipe that was definitely a hit!"
  },
  {
    "_id": 1270,
    "recipe_id": 86,
    "user_id": 1534,
    "user": "Tonkcats",
    "Rating": 5,
    "Review": "I made this casserole using light cream of celerylight sour creamlight Ritz crackers and light cheddar.  It still came out wonderful! Great alternative to the same old green bean casserole."
  },
  {
    "_id": 1271,
    "recipe_id": 87,
    "user_id": 1535,
    "user": "Marg CaymanDesigns",
    "Rating": 4,
    "Review": "Will go great with Thangsgiving meal."
  },
  {
    "_id": 1272,
    "recipe_id": 89,
    "user_id": 1537,
    "user": "Barbara5",
    "Rating": 3,
    "Review": "Simple and easy to prepare."
  },
  {
    "_id": 1273,
    "recipe_id": 90,
    "user_id": 1538,
    "user": "Duckie067",
    "Rating": 5,
    "Review": "she loved it"
  },
  {
    "_id": 1274,
    "recipe_id": 91,
    "user_id": 1539,
    "user": "opal Fitzgerald",
    "Rating": 3,
    "Review": "I just had to make this magic food of song (at least as sung by SharenLois and Bram).  I must say that I usually don't  like walnutsbut they were great in this.  This was very tastythough not as rich as I might have guessed.  It was somewhat  sweeter than I normally likebut I did not leave any in the bowl. The upside down presentation is showy.  I recommend some very rich ice cream as a topping or side dish (Blue Bell Homemade Vanilla  Ice Cream fills the bill in my neck of the woods).  Fun and tasty."
  },
  {
    "_id": 1275,
    "recipe_id": 92,
    "user_id": 1542,
    "user": "ann joy",
    "Rating": 5,
    "Review": "I would reccomend this recipe to any one that doesn't like pumpkin pieit is a delicious substitute. The pumkin rolls are almost like cinnamon rolls except for the taste.  I reccomend this recipe to every one."
  },
  {
    "_id": 1276,
    "recipe_id": 93,
    "user_id": 1543,
    "user": "Doreen Randal",
    "Rating": 0,
    "Review": "makes 2- 9inch pies  or 1 deep dish pie"
  },
  {
    "_id": 1277,
    "recipe_id": 94,
    "user_id": 1544,
    "user": "tranch",
    "Rating": 5,
    "Review": "I recently tried this recipe and got rave reviews from family and friends!"
  },
  {
    "_id": 1278,
    "recipe_id": 100,
    "user_id": 1545,
    "user": "Nancy Van Ess",
    "Rating": 3,
    "Review": "I came upon this recipe while searching for a sweet potato topping. I didn't like the recipe for the potato itself because it would have been much to sweet and \"heavy\" for my tastes. I did enjoy the topping very muchthough. I topped plainbuttered sweet potatoes with it and they were quite good."
  },
  {
    "_id": 1279,
    "recipe_id": 101,
    "user_id": 1546,
    "user": "Jane McCLure",
    "Rating": 3,
    "Review": "Where's the Nutmeg And the Cinnamon?"
  },
  {
    "_id": 1280,
    "recipe_id": 103,
    "user_id": 1547,
    "user": "Morton Design Graph",
    "Rating": 5,
    "Review": "My wife made this recipie for Thanksgiving today and the whole family agreed it was the best food on the whole table."
  },
  {
    "_id": 1281,
    "recipe_id": 105,
    "user_id": 1548,
    "user": "Peggy Benisch",
    "Rating": 5,
    "Review": "The Turkey was wonderful!!! My Husband thought I was crazy when he read the note I left him in the morning when he got up to put it in the oven. when I pulled it out of the oven he said it was the prettiest Turkey he had ever seenBut said lets wait to see what it taste like. when he tried it at my parents he loved it and made sure every one know he was the one who cooked it since he was the one who put it in the oven"
  },
  {
    "_id": 1282,
    "recipe_id": 110,
    "user_id": 1549,
    "user": "Dave5003",
    "Rating": 5,
    "Review": "Muffins were simply excellent!  Easy to preparemoist and so tasty!  We started out by reducing the recipe for only 4 servings...after the first muffin was gonewe started the second batch (increasing to 12 servings!).  ENJOY!"
  },
  {
    "_id": 1283,
    "recipe_id": 113,
    "user_id": 1550,
    "user": "Linda Sundbye",
    "Rating": 2,
    "Review": "Recipe did not result in expected product.  Noodles were BLAHdid not hold form well.  By farthis is not one of the better recipes I have used for Spatzel.  A little tweaking is required.  Most likely I will stick with my Grandmother Stroud''s tried and true recipe."
  },
  {
    "_id": 1284,
    "recipe_id": 115,
    "user_id": 1551,
    "user": "Sean Coate",
    "Rating": 5,
    "Review": "Excellent and great tasting.  Easy prep!!!!! My guest loved it!   :-)"
  },
  {
    "_id": 1285,
    "recipe_id": 119,
    "user_id": 1552,
    "user": "Ron  Joyce Ripple S",
    "Rating": 1,
    "Review": "Onions and whiskey overpowered the sauce.  Not at all similar to TGI Friday's mariande."
  },
  {
    "_id": 1286,
    "recipe_id": 120,
    "user_id": 1554,
    "user": "Jacques Lorrain",
    "Rating": 2,
    "Review": "Goodstraight forward side dish.  Howeverthe author of the recipe forgot to list the sour cream in the list of ingredients.  Thanksgiving morning I was preparing my casserole and got to the part where I was supposed to add it.  I substituted some extra broth to make up for itbut it still ended up dry and gooey.  My advicedon't try anything new on a holiday."
  },
  {
    "_id": 1287,
    "recipe_id": 121,
    "user_id": 1555,
    "user": "Cindy Hartlin",
    "Rating": 4,
    "Review": "very good   made it with and without the vodka"
  },
  {
    "_id": 1288,
    "recipe_id": 124,
    "user_id": 1556,
    "user": "Strawberry Girl",
    "Rating": 4,
    "Review": "I ended up adapting this to make a kind of taco instead of baking it as enchiladasbut we liked it quite a bit."
  },
  {
    "_id": 1289,
    "recipe_id": 125,
    "user_id": 1557,
    "user": "Angel Villanueva",
    "Rating": 4,
    "Review": "It was a good recipebut I felt it needed a little garlic. My son said it was just like he had it in a restaurant. (which in our neighborhood is a great restuarant).  Bravo great stuff."
  },
  {
    "_id": 1290,
    "recipe_id": 126,
    "user_id": 1558,
    "user": "S. Malcolm",
    "Rating": 5,
    "Review": "I served this recipeCherry Cheese Salad at our community dinner for 60 people. It was a hit. It is a wonderfulrefreshing salad. It seems to come alive in your mouth when all the flavors hit the taste buds. Great recipe!"
  },
  {
    "_id": 1291,
    "recipe_id": 127,
    "user_id": 1559,
    "user": "Will Parkinson",
    "Rating": 4,
    "Review": "This is great.  Very similar to apple butterand cans in jars very well.  My family loved itas well as some friends I gave it to.  This is a neat way to use the pumpkins left over from halloween or thanksgiving time."
  },
  {
    "_id": 1292,
    "recipe_id": 128,
    "user_id": 1562,
    "user": "Libby1",
    "Rating": 0,
    "Review": "This is in fact not a Greek dishbut Turkish.  \"Dolma\" means \"StuffingStuffed\" in Turkish and the origins of this dish go back to authentic Ottoman Imperial Cuisine. In fact there are very many other stuffed vegetable dishes in the Turkish Cuisinesuch as eggplantsarthichokesmarrow(zuccihini) and its blossomspotatoes etc.  This termstuffedis also used for dishes where chickenturkey and the like are stuffed with various ingredientsmainly ricebefore cooking usually in the oven."
  },
  {
    "_id": 1293,
    "recipe_id": 129,
    "user_id": 1564,
    "user": "Ginny Holmy-Willcox",
    "Rating": 0,
    "Review": "Baklava is definitely not Greekbut Turkish.  It was the prime dessert in the Ottoman Cuisine and a feast never ended without a serving.  In fact the word itself is Turkishmeaning \"diamond-shaped\" which was the way in which the pastry was cut before serving. Generally walnutspistachios and other nuts are used for the filling."
  },
  {
    "_id": 1294,
    "recipe_id": 130,
    "user_id": 1567,
    "user": "elly9812",
    "Rating": 0,
    "Review": "This dishwith slight variations (usually lemon juice is used) is very common in Middle Eastern Countries and should not be categorised as Greekbut \"collective\".  I suspect that it is in fact Lebanese."
  },
  {
    "_id": 1295,
    "recipe_id": 131,
    "user_id": 1569,
    "user": "Linda7",
    "Rating": 5,
    "Review": "This is a great recipe I made it for my family soon it will be served in my restaurants."
  },
  {
    "_id": 1296,
    "recipe_id": 134,
    "user_id": 1570,
    "user": "Dave Miner",
    "Rating": 2,
    "Review": "This recipe sounded a lot better than it turned out for me.  I ends up too runny and mushy for my tastes.  Still ediblejust not my best bread pudding.  Suggestions?"
  },
  {
    "_id": 1297,
    "recipe_id": 135,
    "user_id": 1571,
    "user": "Linda Johansen",
    "Rating": 5,
    "Review": "I thought this recipe was very quick and easy and delicious. I made at Thanksgiving for my family and they really enjoyed it.  I'm making it again for some friends at work."
  },
  {
    "_id": 1298,
    "recipe_id": 138,
    "user_id": 1572,
    "user": "Ed Paulhus",
    "Rating": 5,
    "Review": "It was A great recipe but I did not use the apples"
  },
  {
    "_id": 1299,
    "recipe_id": 143,
    "user_id": 1573,
    "user": "benluc",
    "Rating": 5,
    "Review": "I have baked these biscotti before and they are excellent.  I'm so glad I could find the recipe again."
  },
  {
    "_id": 1300,
    "recipe_id": 144,
    "user_id": 1596,
    "user": "Joan Edington",
    "Rating": 5,
    "Review": "This is a very tasty cake--my recipe calls for sprinkling the batter with 1/2 cup chopped nuts before baking--Delicious!!"
  },
  {
    "_id": 1301,
    "recipe_id": 145,
    "user_id": 1598,
    "user": "Miss Daisy",
    "Rating": 5,
    "Review": "The French Onion soup recipe is one of the most popular dish served at the Famous Barr (also part of the May Dept store group) restaurants found in St.Louis.   Based on my travels to the various countries including EuropeAsia and USthis version of French Onion soup is one of the best I've had. My husband who is from London just loves this recipe."
  },
  {
    "_id": 1302,
    "recipe_id": 147,
    "user_id": 1599,
    "user": "Mays Pearls of Wisd",
    "Rating": 5,
    "Review": "My grandma has been making this simple coffee cake for years.  It is a huge favorite for the whole family!  We add chopped pecans to ours.  Really easy for overnight company.  It rises overnight and you pop it in the oven before everyone gets up."
  },
  {
    "_id": 1303,
    "recipe_id": 148,
    "user_id": 1600,
    "user": "Leon  Miriam Posvol",
    "Rating": 5,
    "Review": "This taste great!!!!!! Even my 3yr. old loved it"
  },
  {
    "_id": 1304,
    "recipe_id": 149,
    "user_id": 1601,
    "user": "Gilcat2",
    "Rating": 5,
    "Review": "Everyone loved it. I have made it up twice in one week.  I put it up in the freezer in individual servings."
  },
  {
    "_id": 1305,
    "recipe_id": 151,
    "user_id": 1603,
    "user": "Carol H",
    "Rating": 4,
    "Review": "Great recipeeveryone loved it,,young & old."
  },
  {
    "_id": 1306,
    "recipe_id": 152,
    "user_id": 1604,
    "user": "itsjustme",
    "Rating": 4,
    "Review": "This recipe is greatespecially for chocolate lovers. It goes very well topped off with whipped cream. However the recipe never tells you what to do with the hazelnuts. So I just added them into the mixture along with the biscuits and turned the chocolate into it. It was delicious."
  },
  {
    "_id": 1307,
    "recipe_id": 154,
    "user_id": 1605,
    "user": "William Fitzgerald",
    "Rating": 3,
    "Review": "Ok"
  },
  {
    "_id": 1308,
    "recipe_id": 156,
    "user_id": 1609,
    "user": "Barbara Heller",
    "Rating": 5,
    "Review": "This is a wonderful holiday bread.  I make it every year and give some of the loaves to my close friends and neighbors who look forward to this special treat.  It is especially delicious served with a hot cup of Christmas tea."
  },
  {
    "_id": 1309,
    "recipe_id": 157,
    "user_id": 1610,
    "user": "B  B Adams",
    "Rating": 0,
    "Review": "I''m really happy to read so many people are enjoying my Mothers recipe for cucumber salad. She would be absolutely thrilled. Thanks you so much. ENJOY."
  },
  {
    "_id": 1310,
    "recipe_id": 158,
    "user_id": 1612,
    "user": "JANIC412",
    "Rating": 4,
    "Review": "It was not the best that I ever ate but it was definately the best that I ever made. I didn't make it in the microwave but on the stove. I liked itand it was easy to make. One of the reasons it was probably not the best I ever ate is because I used chicken that was all ready cut up so there was no skin and less fat and less taste. I have to watch my fat intake."
  },
  {
    "_id": 1311,
    "recipe_id": 160,
    "user_id": 1613,
    "user": "george nuckols",
    "Rating": 0,
    "Review": "the finished product is excellent."
  },
  {
    "_id": 1312,
    "recipe_id": 162,
    "user_id": 1616,
    "user": "Melody",
    "Rating": 4,
    "Review": "Very unique & since garlic is my favorite ingredient...i love it!"
  },
  {
    "_id": 1313,
    "recipe_id": 163,
    "user_id": 1617,
    "user": "Irene Wilcox",
    "Rating": 5,
    "Review": "I made this soup pretty much as directed except I browned the meat in olive oiland added 2 bay leaves,and two cloves of garlic. I just had it for lunch and my sister and I thought it was excelent I will freeze the rest in individule serving sizes for my husband and I."
  },
  {
    "_id": 1314,
    "recipe_id": 164,
    "user_id": 1621,
    "user": "Quick n Easy Recipes",
    "Rating": 5,
    "Review": "Excellent chiliespecially liked it with the spaghetti.  I prefer more chili powder than the recipe called for.  Also makes for very good chili cheese fries."
  },
  {
    "_id": 1315,
    "recipe_id": 165,
    "user_id": 1629,
    "user": "Joy Boss",
    "Rating": 5,
    "Review": "I live on the Oregon coast and met and fell in love with a wonderful man from cinncinnati."
  },
  {
    "_id": 1316,
    "recipe_id": 166,
    "user_id": 1630,
    "user": "Tim  Tina Ireland",
    "Rating": 5,
    "Review": "I heard about this fudge this morning..looked up the recipe and made it..it is great..so easy and the best fudge I've ever eaten."
  },
  {
    "_id": 1317,
    "recipe_id": 167,
    "user_id": 1632,
    "user": "Peeter Raudvere",
    "Rating": 0,
    "Review": "Rum Flavoringmight have been her way of saying 100 proof Rum."
  },
  {
    "_id": 1318,
    "recipe_id": 169,
    "user_id": 1633,
    "user": "Julie chazelet",
    "Rating": 5,
    "Review": "I loved this recipevery tasty and makes a great appyi will be making it for my new years party."
  },
  {
    "_id": 1319,
    "recipe_id": 170,
    "user_id": 1634,
    "user": "Bill Hilbrich",
    "Rating": 5,
    "Review": "This was easy to make and handy to have in the freezer ready to just bake. I will have to learn to cut it down into four serving sizes though. It was to much just for my husband and I. I also added ground beef to mine. It tasted really good."
  },
  {
    "_id": 1320,
    "recipe_id": 171,
    "user_id": 1635,
    "user": "Jill McQuown",
    "Rating": 5,
    "Review": "BOY!  You sure can't eat just one of these muffins at a time. They were really great and easy to make. I even made a terrible mistakeI forgot to put the brown sugar in. The next two batches I make I will do right. I didn't think something with green chili in would taste good. Was I surprised."
  },
  {
    "_id": 1321,
    "recipe_id": 173,
    "user_id": 1636,
    "user": "carlanna livingstone",
    "Rating": 4,
    "Review": "Very good and really easy!!!"
  },
  {
    "_id": 1322,
    "recipe_id": 176,
    "user_id": 1639,
    "user": "elt8588",
    "Rating": 5,
    "Review": "I have made this recipe for the last 6-7yrs. at Christmas.  I usually don't like fudgebut this is GREAT.  I give it as gifts and everyone always asks for the recipe."
  },
  {
    "_id": 1323,
    "recipe_id": 177,
    "user_id": 1640,
    "user": "Seausoon39",
    "Rating": 5,
    "Review": "Best Chilli I have ever had.  Nice and spiceyfilling and againthe best chilli I have ever had."
  },
  {
    "_id": 1324,
    "recipe_id": 179,
    "user_id": 1641,
    "user": "June Neil",
    "Rating": 4,
    "Review": "These were incredibly easy and fast to make.  They stored well in the refrigerator...I brought them to my organization's holiday potluck on a nice paper plate.  They all went quicklyso there was no cleanup or any leftovers to take back home.  PS--my coworkers liked them!"
  },
  {
    "_id": 1325,
    "recipe_id": 181,
    "user_id": 1642,
    "user": "M Messer",
    "Rating": 5,
    "Review": "This is a great recipe... make ahead and broil before serving. My friends love this."
  },
  {
    "_id": 1326,
    "recipe_id": 183,
    "user_id": 1643,
    "user": "Mutende",
    "Rating": 5,
    "Review": "I made a double batch of this soup and added a medium onion and two cloves of garlic. It was easy and I thought it was really great. Of coarse potato soup is my favorite and this was the best that I have ever made. I am going to put in individual servings and freeze."
  },
  {
    "_id": 1327,
    "recipe_id": 186,
    "user_id": 1646,
    "user": "WildlifeDi",
    "Rating": 5,
    "Review": "I've often made these with different liquers. Orangeraspberry and peach are favorites.  Of coursewhen my husband makes themwith either rum or bourbonthey're a bit more \"liquidy\" than normal."
  },
  {
    "_id": 1328,
    "recipe_id": 189,
    "user_id": 1647,
    "user": "MJ  BARB HUNDAHL",
    "Rating": 5,
    "Review": "I love this soup it was great.  i would love to try to make it again some time to have.  I did tell all my friends about it and they loved it too.  ao to eveyone this is the best soup try it too."
  },
  {
    "_id": 1329,
    "recipe_id": 191,
    "user_id": 1648,
    "user": "a-j-b",
    "Rating": 0,
    "Review": "This recipe sounds interesting except what is the brine made of?"
  },
  {
    "_id": 1330,
    "recipe_id": 193,
    "user_id": 1649,
    "user": "Whtsebring",
    "Rating": 4,
    "Review": "It was my first time making sweet potatoesand this recipe was very simple and easy to follow. Everyone at Thanksgiving loved them."
  },
  {
    "_id": 1331,
    "recipe_id": 209,
    "user_id": 1652,
    "user": "Graham Scott",
    "Rating": 5,
    "Review": "This recipe is so versatile!  I've made it minty with flavoring. I've used nuts and marshmellows for a rocky road fudge."
  },
  {
    "_id": 1332,
    "recipe_id": 210,
    "user_id": 1654,
    "user": "Paula Maguire",
    "Rating": 5,
    "Review": "3 medium onions made a very tasty part of a meal for 3 persons. The recipe ingredients reads \"20 butter\" and \"onions\" but doesn't say  how many.  I used about a 1/2 C. butter and 3 medium onions & it worked out fine and the cooking time seemed to be the right time.  3 med. onions would serve 4 people. They would be really yummy atop a thick juicy filet mignon! In factI believe that this recipe could be included with a large number of meals of various types."
  },
  {
    "_id": 1333,
    "recipe_id": 217,
    "user_id": 1657,
    "user": "cwambeam",
    "Rating": 5,
    "Review": "This is the best eggnog I have ever had.  It's good with fat-free half & halftoo.  The writer suggested Jack Daniels might be good in itbut it is especially good with 1/2 cup of light rum (preferably Bacardi) and 1/2 cup of Crown Royal.  Delicious!"
  },
  {
    "_id": 1334,
    "recipe_id": 218,
    "user_id": 1659,
    "user": "WisTex",
    "Rating": 5,
    "Review": "This recipe was great! In order to make the recipe even easierI substituted the sweet potatoes with canned sweet potatoes -- and it STILL came out good. The entire family loved itincluding the kidsand my sister and mother-in-law asked for the \"secret\" recipe."
  },
  {
    "_id": 1335,
    "recipe_id": 221,
    "user_id": 1660,
    "user": "Mehitabel",
    "Rating": 4,
    "Review": "Delicious! And I was able to stretch the recipe to 4 cups of walnut halves with no problem. It takes about an hour from start to finishbut the coating needs to set a couple of hours in order for them not to stick together."
  },
  {
    "_id": 1336,
    "recipe_id": 223,
    "user_id": 1662,
    "user": "Anne Edgell",
    "Rating": 5,
    "Review": "Absolutely Delightful Recipe! Rich and Flavorful!"
  },
  {
    "_id": 1337,
    "recipe_id": 225,
    "user_id": 1664,
    "user": "Duane and Ginger Va",
    "Rating": 5,
    "Review": "this is a traditional dish my family has enjoyed on christmas eve for over 30 years. my mother passed away 2 years ago and it fell to me to keep the tradition going. i needed to recheck my memory and had a hard time finding this till i came across your site. many thanks and merry christmas"
  },
  {
    "_id": 1338,
    "recipe_id": 226,
    "user_id": 1667,
    "user": "Binkie45",
    "Rating": 5,
    "Review": "My daughter and I made this bread over Christmas and it was wonderful.  We left out the fruit--the bread lasted almost one day--the aroma was awesome!!! Everyone that came by the day we were baking our Christmas goodies wanted to stick around until THAT bread was done.  We have already made another loaf.  Thanks for a great recipe."
  },
  {
    "_id": 1339,
    "recipe_id": 227,
    "user_id": 1668,
    "user": "Medit",
    "Rating": 4,
    "Review": "There is no temperature given for baking these bars."
  },
  {
    "_id": 1340,
    "recipe_id": 234,
    "user_id": 1670,
    "user": "Evans",
    "Rating": 5,
    "Review": "While on my first visit to Ireland in July 1999the birthplace of parentsmy cousin and I stopped in Doolen near the Cliffs of Mohr and had this marvelous dark Irish Beef Stew cooked in Guinness Stout\"  at O'Connors Pub.  It was absolutely delicous and the first authentic Irish meal we had and while all the food was great there was nothing that could beat the Irish Stew.  When I found the recipe on this siteI immediately tried it and it is exactly like what we had in Ireland.  When my cousin came to dinner and I served ithe was sure I had gotten the recipe from O'Connors Pub while we were in Ireland.  It was a cinch to makedirections were very easy to follow and it practically cooks itself.  It is equally as good over mashed potatoes or rice.  Try ityou'll like it. The one ingredient I added was a \"wee bit of blarney"
  },
  {
    "_id": 1341,
    "recipe_id": 238,
    "user_id": 1671,
    "user": "Eduardo Maldonado",
    "Rating": 2,
    "Review": "The potatoes turned a very unappealing shade of gray.  Although they tasted ok once you got past the looksmy kids wouldn't eat them."
  },
  {
    "_id": 1342,
    "recipe_id": 245,
    "user_id": 1672,
    "user": "W1xyz",
    "Rating": 4,
    "Review": "This is a very good basic recipe and I just thought I would add the variation that I took.  It being the day after Christmas I had a ham bone I needed to use and my son wanted lentil soup.  I just wanted to make something a little different so I surfed the web until I found this one that was nice and basic but I added the ham bone and skipped the hot dogsadded two potatoes and a can of diced tomatoes to make a very delicious soup.  Thanks for the basics,"
  },
  {
    "_id": 1343,
    "recipe_id": 248,
    "user_id": 1673,
    "user": "Jay Grush",
    "Rating": 5,
    "Review": "very good!!!"
  },
  {
    "_id": 1344,
    "recipe_id": 252,
    "user_id": 1675,
    "user": "Jim Weller",
    "Rating": 5,
    "Review": "We had these for Christmas dinner and they are great. I added a 1/2 tsp. or cinnamon and placed a whole walnut on each Ball. Easy and fast and they were a hit"
  },
  {
    "_id": 1345,
    "recipe_id": 257,
    "user_id": 1676,
    "user": "Larry",
    "Rating": 2,
    "Review": "I'm sorrybut I tried this method for my Christmas turkey and the results just do not comapare with preparing a turkey the old-fashioned way . . . basting frequently in a roasting pan in a hot oven.  The turkey skin did not fully brown and the wings/legs had a distinct steamed texture.  This is an easier way of cooking a turkeybut sometimes easier is not better."
  },
  {
    "_id": 1346,
    "recipe_id": 258,
    "user_id": 1677,
    "user": "Klaus Alexander Sei",
    "Rating": 1,
    "Review": "Blueberries sink to bottom of bundt pan and stick.  I had planned on giving these cakes as Christmas presentshowevergave up after three attempts.   No amount of greasing or flouring the pan seemed to help."
  },
  {
    "_id": 1347,
    "recipe_id": 259,
    "user_id": 1678,
    "user": "Mary Lord",
    "Rating": 5,
    "Review": "Thank you for providing this recipe.  I'll let you know how the customer liked it."
  },
  {
    "_id": 1348,
    "recipe_id": 260,
    "user_id": 1679,
    "user": "news.mercuryin.es",
    "Rating": 2,
    "Review": "I was expecting a simplistic recipe but instead was provided a recipe with ingredients that I have never heard of (Gruyere Cheese) and measurement values that require research (150 ml of milk).  I think the consideration should be made for those of us who are new to this internet age and they should keep in mind that the cookers of the household are middle aged women who are use to regular methods of measurement."
  },
  {
    "_id": 1349,
    "recipe_id": 261,
    "user_id": 1680,
    "user": "Cathi Allen",
    "Rating": 1,
    "Review": "It is like rubber."
  },
  {
    "_id": 1350,
    "recipe_id": 265,
    "user_id": 1681,
    "user": "nancy5",
    "Rating": 5,
    "Review": "This is the recipe I have used for many years.  It is so yummy.  It is easy to make and a treat to eat.  It is good for every day type bread and wonderful to give as a gift.  It is a favorite of my family."
  },
  {
    "_id": 1351,
    "recipe_id": 271,
    "user_id": 1684,
    "user": "Katrina Streiff",
    "Rating": 0,
    "Review": "Goodbut I wished they were a bit more moist."
  },
  {
    "_id": 1352,
    "recipe_id": 279,
    "user_id": 1689,
    "user": "Kevin Kirkland",
    "Rating": 4,
    "Review": "This is really good for a little something different.  Alsoyou may want to vary the mayonnaise by adding cream cheesea few chivesgarlic powder and maybe a few other spices occasionally.  But it is really fine just \"as is.\"  I really enjoyed this.  Thanks!"
  },
  {
    "_id": 1353,
    "recipe_id": 281,
    "user_id": 1691,
    "user": "I Dunno",
    "Rating": 4,
    "Review": "This really is a great recipe. I substitute Chicken Broth for the water and at the end I add some cream (HeavyLight or Half & Half) just to add some creamy richness. Also for a special twist add some cooked baby shrimp (peeled & de-viened of course) 15-20 minutes before serving. And plenty of cracked Pepper and Soda Crackers :-) Enjoy."
  },
  {
    "_id": 1354,
    "recipe_id": 282,
    "user_id": 1692,
    "user": "MP562",
    "Rating": 0,
    "Review": "I just found this recipebut I am going to bake itwould be great with a salad...."
  },
  {
    "_id": 1355,
    "recipe_id": 288,
    "user_id": 3337,
    "user": "Erin Laddie",
    "Rating": 4,
    "Review": "It takes approximately 45 minutes to prepare meatballs & sauce. Serving size is approximately 38 meat balls. I used ground turkey instead of beef & came out much betterused fresh garlic & minced together with the onionsalso a dash of cajun & Itatilian seasonings made the meatballs a complete success."
  },
  {
    "_id": 1356,
    "recipe_id": 290,
    "user_id": 4244,
    "user": "Danny Bennett",
    "Rating": 5,
    "Review": "I doubled this recipe for Christmas dinner 2000 and everyone came back for 2nd's and some even for 3rd's.   Very easy to make.  I increased the cooking time to 60 min's and put a extra cheese on top for the last 15 min. uncovered for a nice crust of baked cheese."
  },
  {
    "_id": 1357,
    "recipe_id": 291,
    "user_id": 4242,
    "user": "marie m",
    "Rating": 5,
    "Review": "my family loved these.  fresher than any boughten poppers.  take some preparation timebut are well worth it."
  },
  {
    "_id": 1358,
    "recipe_id": 293,
    "user_id": 1566,
    "user": "Stephen Little",
    "Rating": 0,
    "Review": "Try dipping or coating one side with some good chocolate... even better!!!"
  },
  {
    "_id": 1359,
    "recipe_id": 296,
    "user_id": 3962,
    "user": "Erna House",
    "Rating": 1,
    "Review": "The recipe did not say to drain the juice from the pineapple and mandarin oranges and therefore it was very soupy!"
  },
  {
    "_id": 1360,
    "recipe_id": 298,
    "user_id": 4200,
    "user": "LC Liu",
    "Rating": 5,
    "Review": "I received this \"hoax\" email forward about 4 years agobut never attempted the recipe. A friend of the family made it for us just a few weeks ago and it tastes incredible! I can't believe I held on to this recipe for so long!!"
  },
  {
    "_id": 1361,
    "recipe_id": 302,
    "user_id": 4074,
    "user": "TJ Witt",
    "Rating": 5,
    "Review": "I made this recipe for Christmas and it was great!  The red and green coloring also made it festive-looking.  Itooleft out the bean sprouts and substituted cashews.  Even my picky Mother-in-law couldn't complain!!"
  },
  {
    "_id": 1362,
    "recipe_id": 306,
    "user_id": 4190,
    "user": "leeann walker",
    "Rating": 5,
    "Review": "Excellent Pumpkin Rollvery tasty. I add Pecans ontop of cream cheese filling"
  },
  {
    "_id": 1363,
    "recipe_id": 309,
    "user_id": 4312,
    "user": "Claude Santini",
    "Rating": 4,
    "Review": "Ravishing and delightfulvery easy to make."
  },
  {
    "_id": 1364,
    "recipe_id": 311,
    "user_id": 4309,
    "user": "Beverly Kaplan",
    "Rating": 4,
    "Review": "This recipe was easily adapted as a sugar free recipe--substituting Nutrisweet for sugar--My diabetic husband loved it--Thank-you"
  },
  {
    "_id": 1365,
    "recipe_id": 312,
    "user_id": 4329,
    "user": "melanie mcgackin",
    "Rating": 4,
    "Review": "AN extremely fast and easy to follow recipe! Though I did not add in the raisins or brandyI substituted drained crushed pineapple insteadturned out great. We served the dip with pineapple chunks and poundcake. Add in extra chocolate chips for sweetness!"
  },
  {
    "_id": 1366,
    "recipe_id": 313,
    "user_id": 4335,
    "user": "Tiina",
    "Rating": 0,
    "Review": "great recipe its delicious"
  },
  {
    "_id": 1367,
    "recipe_id": 315,
    "user_id": 4336,
    "user": "Marquise Patton",
    "Rating": 5,
    "Review": "This recipe is so easy I usually make two at a time. Not only does it taste greatbut I make them and put into the freezer to use at a church circleclub meetingor for friends who just happen to drop by.  I always try to keep at least one in the freezer."
  },
  {
    "_id": 1368,
    "recipe_id": 320,
    "user_id": 4340,
    "user": "Doug Thompson",
    "Rating": 0,
    "Review": "Concerning handling chili peppersit really is unnecessary to use gloves."
  },
  {
    "_id": 1369,
    "recipe_id": 321,
    "user_id": 4203,
    "user": "Amy12583",
    "Rating": 5,
    "Review": "I have had a hashbrown casserole similar to this as wellbut never got the recipe.  I am curious as how much sour cream should you put in then.  Thanks."
  },
  {
    "_id": 1370,
    "recipe_id": 322,
    "user_id": 4317,
    "user": "Kay Abbott",
    "Rating": 3,
    "Review": "This is a traditional way of making english bread pudding - but i live in Texas - does anyone know what they call suet in Texas? someone told me they only use it for birdseed???"
  },
  {
    "_id": 1371,
    "recipe_id": 324,
    "user_id": 4240,
    "user": "Christine Cipullo",
    "Rating": 0,
    "Review": "Have not tried this yetwas looking for crock-pot recipesbut Chicken Cacc. is one of my family's favorites and  it absolutely has to have red wine in itand green peppers."
  },
  {
    "_id": 1372,
    "recipe_id": 327,
    "user_id": 4353,
    "user": "Judith Boncaro",
    "Rating": 3,
    "Review": "This is only a low sodium recipe if you completely omit the salt - just use a little more pepperor some garlic powder."
  },
  {
    "_id": 1373,
    "recipe_id": 330,
    "user_id": 4353,
    "user": "Judith Boncaro",
    "Rating": 0,
    "Review": "Since 3 oz of anchovies contains 425 mg of sodiumI would guess that 2 anchovy fillets contain about 150 mg of sodium."
  },
  {
    "_id": 1374,
    "recipe_id": 332,
    "user_id": 1694,
    "user": "MaxinePeter",
    "Rating": 5,
    "Review": "It was totally tasty dudes"
  },
  {
    "_id": 1375,
    "recipe_id": 334,
    "user_id": 1697,
    "user": "Alan1",
    "Rating": 5,
    "Review": "Aren't there 6 or seven stars to choose from.  WOW!  I was so excited to see this recipe.  I absolutely loved this soup when my husband and I would go to Famous Barr 30 yearswhen he was in the seminary at Concordia St. Louis.  I have made it through the yearsbecause an aunt had sent me the recipe from her local SpringfieldIL newspaper about 20 years.  Once I lost itbut a friend retrieved it for me from the time she had asked me for it.  What I love about your site is the instant way to double or triple or whatever the recipe!  I make this recipe a number of times each yearbut I always make it for a big Christmas Party we have.  Everyone loves it and looks forward to it each year!  Thanks so much!  I always serve it with homemade bread and a Ceasar Salad.  I look forward to your newsletters."
  },
  {
    "_id": 1376,
    "recipe_id": 339,
    "user_id": 1698,
    "user": "CeeDee",
    "Rating": 5,
    "Review": "I haven't tried it yetbut when I do I will use cherry cola"
  },
  {
    "_id": 1377,
    "recipe_id": 340,
    "user_id": 1702,
    "user": "Alison Corfield",
    "Rating": 4,
    "Review": "I found this recipe to be very goodbut only gave it four stars as it called for (in my opinion) way too much celery and onions.  I cut the onions back to 1/2 cup and the celery to 1 cup.  I also added 1/3 cup grated carrots. My husband loved it!"
  },
  {
    "_id": 1378,
    "recipe_id": 341,
    "user_id": 1704,
    "user": "HELEN PEAGRAM_40951",
    "Rating": 5,
    "Review": "I substituted the green bell pepper with red and it was wonderful."
  },
  {
    "_id": 1379,
    "recipe_id": 343,
    "user_id": 1715,
    "user": "The Fradys",
    "Rating": 5,
    "Review": "Another great way to make this recipe is to put all the ingredients inside the flattened biscuit and then deep fry them this is a real pleaser any time in my house. This recipe is very easy and fun to make I hope to find some more fun recioes soon!"
  },
  {
    "_id": 1380,
    "recipe_id": 347,
    "user_id": 1717,
    "user": "JonquilJan",
    "Rating": 0,
    "Review": "This dish has been in homes across the south for as long as I can remember. Sometimes a little onion is added to the mixture. Goes great with any meal."
  },
  {
    "_id": 1381,
    "recipe_id": 349,
    "user_id": 1719,
    "user": "Dorothy1",
    "Rating": 4,
    "Review": "Very simple to make. there were no strange ingredents or a big mess. taste justlike my moms. very down home"
  },
  {
    "_id": 1382,
    "recipe_id": 350,
    "user_id": 1721,
    "user": "Denise3",
    "Rating": 5,
    "Review": "This is a great basic potato soup receipe!  I used two cups of half & half in place of two cups of milkand added 1/2 pound of cooked bacon plus two tbls. parsley. I took out the cheese to add the half & half!"
  },
  {
    "_id": 1383,
    "recipe_id": 352,
    "user_id": 1722,
    "user": "Jacqui Jones",
    "Rating": 1,
    "Review": "I believe there is a mistake in the amount of eggnog listed in this recipe...5 1/2 cups is too much and the batter overflows a 9x5"
  },
  {
    "_id": 1384,
    "recipe_id": 356,
    "user_id": 1723,
    "user": "Sergio  Dorothy G P",
    "Rating": 5,
    "Review": "Made it for daughter's weddinga GREAT hit!!"
  },
  {
    "_id": 1385,
    "recipe_id": 358,
    "user_id": 1724,
    "user": "goblait",
    "Rating": 4,
    "Review": "I made this dessert for a formal English Christmas dinner.  I did receive nothing but raves!  It was delicious and beautiful. As a matter of facta friend told me it was better than her friend'swho happens to be English.  I especially liked it because it did not call for a pudding mixbut rather a custard from scratchwhich was as easy to make as from a box. It was not difficult to make at all.  I also added frozen berries as well as the strawberrieswhich seemed to only enhance the flavors."
  },
  {
    "_id": 1386,
    "recipe_id": 361,
    "user_id": 1727,
    "user": "Laniakea",
    "Rating": 5,
    "Review": "Outstanding"
  },
  {
    "_id": 1387,
    "recipe_id": 362,
    "user_id": 1728,
    "user": "Philip and Karen Se",
    "Rating": 5,
    "Review": "Ilove this recipe ,it is so easy when you have kids. Just mix and serve."
  },
  {
    "_id": 1388,
    "recipe_id": 364,
    "user_id": 1730,
    "user": "Lintons Seafood",
    "Rating": 5,
    "Review": "I made these muffins to give in my Christmas gift packages. Everyone loved themand including myself. I followed the recipe exactlyand they were easy to make."
  },
  {
    "_id": 1389,
    "recipe_id": 366,
    "user_id": 1732,
    "user": "David Greene",
    "Rating": 4,
    "Review": "it can be made in 15 min.and i bake mine in 25 min."
  },
  {
    "_id": 1390,
    "recipe_id": 368,
    "user_id": 1735,
    "user": "Tracey Kehne",
    "Rating": 0,
    "Review": "I need to try this.....This is typical recipe from my Mother's side of the family. \"use this much\" i can not see this much on the phone."
  },
  {
    "_id": 1391,
    "recipe_id": 370,
    "user_id": 1736,
    "user": "jinx3218",
    "Rating": 4,
    "Review": "This was a very refreshing salad. It''s not time consuming and ingredients were simple. My husband and I are enjoying eating lighter and healthier meals and this one is excellent! Thank You..."
  },
  {
    "_id": 1392,
    "recipe_id": 371,
    "user_id": 1737,
    "user": "Teddi2",
    "Rating": 0,
    "Review": "Is it possible to rate a recipe MINUS five stars?  I'm in a pinchI log on to find some quick and easy app. recipesand this is what I get.  You people should call yourselves \"recipizarre.com\"  Thanks for being no help at all.  It wasn't even that funny."
  },
  {
    "_id": 1393,
    "recipe_id": 372,
    "user_id": 1739,
    "user": "Kathleen Wiseman",
    "Rating": 5,
    "Review": "Great recipe!  Several changes might help thicken the soup a bit.  I used half and half instead of plain milk.  Also1 tsp. corn starch mixed with hot water helped to thicken. I added some small cubes of potato and some celery. This makes the soup complete."
  },
  {
    "_id": 1394,
    "recipe_id": 373,
    "user_id": 1742,
    "user": "Joel Schwarz",
    "Rating": 2,
    "Review": "Thai soup without lemon grass??....don't think so"
  },
  {
    "_id": 1395,
    "recipe_id": 375,
    "user_id": 1743,
    "user": "Robin Cowdrey",
    "Rating": 4,
    "Review": "I used olive oil instead of lard {I didnt have any in the house} and I only used 1 onion. I think it tuned out great. Thanks for the recipeand I hope to hear from you soon."
  },
  {
    "_id": 1396,
    "recipe_id": 377,
    "user_id": 1746,
    "user": "Mr. Bill",
    "Rating": 4,
    "Review": "wasn't that bad ??????? why do the always make the chicken so big in the market place."
  },
  {
    "_id": 1397,
    "recipe_id": 379,
    "user_id": 1747,
    "user": "Gloria Reyes",
    "Rating": 5,
    "Review": "It was a great dish my family loved it I couldn't make as much as I wanted to but I got it finished"
  },
  {
    "_id": 1398,
    "recipe_id": 380,
    "user_id": 1749,
    "user": "Pam Wood",
    "Rating": 5,
    "Review": "delicious desserta little hard to make when you need something for the same day. Maybe you can find a faster and easier version of this same dessert."
  },
  {
    "_id": 1399,
    "recipe_id": 383,
    "user_id": 1751,
    "user": "Jjortikka",
    "Rating": 4,
    "Review": "I finally found the recipe for \"Chow Chow Pickles\"."
  },
  {
    "_id": 1400,
    "recipe_id": 384,
    "user_id": 1754,
    "user": "mark anderson",
    "Rating": 4,
    "Review": "I am a true chocolate pie lover.  I cooked the pie as directed using one deep dish 9\" pie pan and a ready made refrigerated pie crust (next time I will make it with my own crust).  The filling sliced very well and yet it was creamy and delicious.  I made the meringue using the 2 egg whites from the eggs used in the fillingadding 1/4 tsp of cream of tartar and 3 tbsp of sugarand then baking at 400 degrees until golden.  Over all very good."
  },
  {
    "_id": 1401,
    "recipe_id": 385,
    "user_id": 1756,
    "user": "Stacy L Volpe",
    "Rating": 5,
    "Review": "very healthy scone  great web site thank you ii  have 2 tennage girls so they are into recipes ok thanks once a gain"
  },
  {
    "_id": 1402,
    "recipe_id": 396,
    "user_id": 1760,
    "user": "Cheryl Thebeau-Blev",
    "Rating": 4,
    "Review": "Very good but not a 5 star"
  },
  {
    "_id": 1403,
    "recipe_id": 399,
    "user_id": 1761,
    "user": "Moe Martin",
    "Rating": 4,
    "Review": "Very good receipe. The taste is great!"
  },
  {
    "_id": 1404,
    "recipe_id": 401,
    "user_id": 1762,
    "user": "lkadlec",
    "Rating": 5,
    "Review": "When I was a boy in the 1930s my brother and I would catch bull frogs and father would dispatch and prepare themwe also picked wild button and shaggy main mushroomscleaned all and fried in butterserved on toast and devoured."
  },
  {
    "_id": 1405,
    "recipe_id": 402,
    "user_id": 1763,
    "user": "Gregg",
    "Rating": 3,
    "Review": "Apparently I got the wrong pork chops for this receipe!!!  I only cooked for 1 1/2 hrs and they were way to dry...if I had cooked for 2 they would have been hockey pukes!!!  The taste was goodbut I would diffently watch the time and cooking of the chops. Maybe just an hourcovered."
  },
  {
    "_id": 1406,
    "recipe_id": 403,
    "user_id": 1765,
    "user": "STEVE BEDELL",
    "Rating": 5,
    "Review": "I skipped the bread bowls and used fresh italian parsleya little rosemary and thymeand it was great.  Left it chunky too."
  },
  {
    "_id": 1407,
    "recipe_id": 406,
    "user_id": 1771,
    "user": "Joanne Wallace",
    "Rating": 5,
    "Review": "Great recipe for anyone who like it as close as it come to the real thing! Very simple to make and you can find all the ingredents in your local supermarket! I myself would cut back on the white pepper and add a little bit of hot oil (not to much)! I would also add about 1 1/2 tbls more of vineger. (or to taste) add a little more meat and you can serve with a bowl of white rice with steamed veggies for a meal of its own."
  },
  {
    "_id": 1408,
    "recipe_id": 407,
    "user_id": 3794,
    "user": "Sally Wolfe",
    "Rating": 5,
    "Review": "My husband and I simply loved this soup. I added half a medium onion to mineand put in four cloves of garlic instead of two. We sprinkled shredded mozzarella cheese on ours before enjoying."
  },
  {
    "_id": 1409,
    "recipe_id": 409,
    "user_id": 3253,
    "user": "l.lahn",
    "Rating": 2,
    "Review": "This cake didn't rise much.  Also the temperature of 350F. is too high.  The cake burnedpossibly because I used a teflon coated cake pan.  I did turn heat down to 325 but the damaged was already done."
  },
  {
    "_id": 1410,
    "recipe_id": 410,
    "user_id": 5014,
    "user": "Shelly Head",
    "Rating": 5,
    "Review": "This recipe was simple to make and easy to convert to serve more people.  I like the fact that the ingredients are those usually found in someones pantry and that preparation time was 10 minutes or less to combine and could be left alone in the oven to cook.  Wish all recipes were this easy and delicious.  I will definetly add this to my keeper list."
  },
  {
    "_id": 1411,
    "recipe_id": 412,
    "user_id": 5148,
    "user": "R Schlei",
    "Rating": 4,
    "Review": "A fantastic version - very fragrant and complex taste.  Highly recommended for those who like spicy eggplant."
  },
  {
    "_id": 1412,
    "recipe_id": 413,
    "user_id": 2695,
    "user": "Hungarian Gypsy",
    "Rating": 1,
    "Review": "This recipe needs a little help !"
  },
  {
    "_id": 1413,
    "recipe_id": 419,
    "user_id": 2695,
    "user": "Hungarian Gypsy",
    "Rating": 5,
    "Review": "This dish was excellent.  The sauce turned out wonderful and was an excellent choice for the pork chops !"
  },
  {
    "_id": 1414,
    "recipe_id": 421,
    "user_id": 4564,
    "user": "mary sharp",
    "Rating": 5,
    "Review": "this is wonderful very easy but i used cooked pudding. has more lemon pie taste"
  },
  {
    "_id": 1415,
    "recipe_id": 422,
    "user_id": 5199,
    "user": "Karen Fink",
    "Rating": 1,
    "Review": "I think this was the most awfulest punch I have ever tasted hope someone else has better luck!!!!!"
  },
  {
    "_id": 1416,
    "recipe_id": 425,
    "user_id": 5203,
    "user": "Beverly Balkwell",
    "Rating": 4,
    "Review": "This recipe makes a 2 pound loaf. I used the white bread setting (3 hrs). The loaf was beautifultexture was good. The only thing was my machine destroyed the cherries ( I added them as stated in recipe)."
  },
  {
    "_id": 1417,
    "recipe_id": 428,
    "user_id": 5264,
    "user": "danny sayre",
    "Rating": 4,
    "Review": "very easy to make,about 5 minutes. the recipe made 9 pancakes 6 inchs round fluffy very light. I was pleased that butter and syrup didn't \"water log\" the cakes. You could add any fruit in this recipe. Overall these were the best I've ever made.  thank you dansa111"
  },
  {
    "_id": 1418,
    "recipe_id": 430,
    "user_id": 5280,
    "user": "Anita Novotny",
    "Rating": 4,
    "Review": "This casserole was very tasty but a little time consuming to prepare. Next time I know we are going to have this dish (and we definitally will be having it again) I will do the prep work ahead of time."
  },
  {
    "_id": 1419,
    "recipe_id": 431,
    "user_id": 5285,
    "user": "Michael Dahlquist",
    "Rating": 3,
    "Review": "It's between three and four starsreally. Easy to make and good tastin'. It's stick-to-your-ribs stuffit's like chicken paellaand that's pretty good. I am glad I made itI will make it againit will be my lunch for the next three weeks."
  },
  {
    "_id": 1420,
    "recipe_id": 436,
    "user_id": 5142,
    "user": "Catcooks123",
    "Rating": 4,
    "Review": "I wanted a new way to prepare thick pork chops for my family ,and this was really good. I used Lawerys season salt instead of accentand salt. The gravy smelled a little like a marsala sauce. The meat was so tender this wayso much better than dried out broiled thick pork chops."
  },
  {
    "_id": 1421,
    "recipe_id": 441,
    "user_id": 5328,
    "user": "Janie Woodall",
    "Rating": 5,
    "Review": "I used Cream of chicken instead of mushroom and it was wonderful !!! My whole family loved it !!"
  },
  {
    "_id": 1422,
    "recipe_id": 442,
    "user_id": 4884,
    "user": "Carmen",
    "Rating": 5,
    "Review": "Baklava is in fact Greek..I moved from Greece a little over 3 years ago and therefore your feeble-minded Turkish opinion means nothing."
  },
  {
    "_id": 1423,
    "recipe_id": 443,
    "user_id": 5227,
    "user": "rhonda lambert",
    "Rating": 4,
    "Review": "my family like the bamboo shoots whole. but we love your recipe"
  },
  {
    "_id": 1424,
    "recipe_id": 451,
    "user_id": 5227,
    "user": "rhonda lambert",
    "Rating": 4,
    "Review": "the lemon rind made it tastier. great recipe"
  },
  {
    "_id": 1425,
    "recipe_id": 463,
    "user_id": 3858,
    "user": "Vicki Summers",
    "Rating": 4,
    "Review": "No kidding - stir almost constantly. We really liked it. Warmed well in the microwave."
  },
  {
    "_id": 1426,
    "recipe_id": 465,
    "user_id": 5357,
    "user": "Jeanne H",
    "Rating": 5,
    "Review": "This is the best way to serve shoepeg corn there is...we make the same recipe but use two cans of the shoepeg cornand no beans.  It's yummy for Thanksgiving."
  },
  {
    "_id": 1427,
    "recipe_id": 467,
    "user_id": 5355,
    "user": "Rena Reeve",
    "Rating": 5,
    "Review": "I made this bread with a little milk (instead of dry milk) and a little coffee (instead of instant).  AlsoI made it using my mixer with dough hook instead of a bread machine.  It worked very well.  Best pumpernickel I have tasted!"
  },
  {
    "_id": 1428,
    "recipe_id": 469,
    "user_id": 5420,
    "user": "Andrew Murray",
    "Rating": 2,
    "Review": "Why do you have to bake pork chops,this is a B.B.Q recipe. Depending on the size and the amount of time to marinate,they shouldn't be more than 15-20 minutes on the B.B.Q"
  },
  {
    "_id": 1429,
    "recipe_id": 470,
    "user_id": 5090,
    "user": "Marcia Detrick",
    "Rating": 5,
    "Review": "Just the type recipe I came to this site for. I am going to take this to a Super Bowl party on Sunday"
  },
  {
    "_id": 1430,
    "recipe_id": 471,
    "user_id": 4925,
    "user": "christine story",
    "Rating": 5,
    "Review": "We really like this dipit''s creamy & tasty.  I added a little more green onions (including the tops)& some garlic powder (I put that in just about everything that I think it would add a little more zingplus it''s good for you)."
  },
  {
    "_id": 1431,
    "recipe_id": 475,
    "user_id": 5398,
    "user": "gary gierloff",
    "Rating": 5,
    "Review": "if you love clams and garlic you will love this recipe. I plan to make large quanties for the upcoming superbowl party at the hitchin post in salem oregon.go ravens."
  },
  {
    "_id": 1432,
    "recipe_id": 476,
    "user_id": 5385,
    "user": "Cristina Stanfill",
    "Rating": 3,
    "Review": "Be aware that this is the EXACT recipe that is printed in the booklet that comes with a new crockpot."
  },
  {
    "_id": 1433,
    "recipe_id": 479,
    "user_id": 5471,
    "user": "Olivia Cato",
    "Rating": 3,
    "Review": "It was pretty goodbut then again I was really hungry.  Needs more chicken and more cheese."
  },
  {
    "_id": 1434,
    "recipe_id": 480,
    "user_id": 5461,
    "user": "Sarah Stluka",
    "Rating": 5,
    "Review": "This casserole is the best I have ever had.  My grandmother makes it for Christmas every year and I just had to have the recipe."
  },
  {
    "_id": 1435,
    "recipe_id": 482,
    "user_id": 5049,
    "user": "Cynthia Caffey Schw",
    "Rating": 4,
    "Review": "This is easy and very good.  Our family loved it."
  },
  {
    "_id": 1436,
    "recipe_id": 490,
    "user_id": 5049,
    "user": "Cynthia Caffey Schw",
    "Rating": 3,
    "Review": "This was easy to makebut when mashing the potatoes and garlicbe sure to get the garlic mashed.  It is hard to find it in the potatoesso you need to mash it all well.  The taste is subtlebut true.  You may want to add a little more butter and salt."
  },
  {
    "_id": 1437,
    "recipe_id": 491,
    "user_id": 1773,
    "user": "Malarkey Test",
    "Rating": 3,
    "Review": "this was okay.  too greasy for my tastes."
  },
  {
    "_id": 1438,
    "recipe_id": 492,
    "user_id": 4105,
    "user": "Bill de Bruler",
    "Rating": 4,
    "Review": "I would rate this one a five-star if the hot pepper flakes were omitted. I would omit the hot pepper flakes and use 3 cans of tomatoes and add 1 can of tomato and green chile's. Also for the next time I prepare the recipe I will devein and shell the shrimp then sprinkle cajun spice mix and let the shrimp marinate in it. If anyone attempts this recipe and uses 1/4 cup of the hot pepper flakes you will probably not be able to eat it if you cannot handle hot and spicy food. Believe me I am an amateur Cajun Chef and I could eat the dish but most people could not handle it. I will make this dish because it is rather quick and it is a one dish meal. I will however change it as stated in the beginning of this comment/rating."
  },
  {
    "_id": 1439,
    "recipe_id": 496,
    "user_id": 5446,
    "user": "Fedelma Dixon",
    "Rating": 3,
    "Review": "No vanilla?  No butter?  Wasn't sure what to do about thatbut the pie is good."
  },
  {
    "_id": 1440,
    "recipe_id": 499,
    "user_id": 3856,
    "user": "jonathan armytage",
    "Rating": 3,
    "Review": "average taste. Not particularly subtle"
  },
  {
    "_id": 1441,
    "recipe_id": 500,
    "user_id": 5049,
    "user": "Cynthia Caffey Schw",
    "Rating": 5,
    "Review": "First of allI used a 4 pound pork tenderloininstead of 1 pound.  It took 1 hour to bakeso not much longer and was 170 degrees inside.  NextI didn't have the time to marinade overnightso I used garlic powder and marinaded for about 20 minutes.  It turned out wonderful.  Probably the best pork we have had.  It was tendermoist and flavorful.  I also substituted black pepper for white pepper."
  },
  {
    "_id": 1442,
    "recipe_id": 505,
    "user_id": 5235,
    "user": "LJ S3213",
    "Rating": 4,
    "Review": "absolutely fabulousreceived high praise from family members."
  },
  {
    "_id": 1443,
    "recipe_id": 506,
    "user_id": 5355,
    "user": "Rena Reeve",
    "Rating": 0,
    "Review": "I recommend this recipe because I've eaten these muffins many times.  These muffins taste great heated in the micro and then covered with natural applesauce.  A little cinnamon sugar on top makes it the perfect breakfast treat!"
  },
  {
    "_id": 1444,
    "recipe_id": 512,
    "user_id": 5484,
    "user": "Deidre Gilbert",
    "Rating": 5,
    "Review": "After extensive research on turkey soup recipesyou were my first choice.  Now your turkey soup has become \"Deidre's famous turkey soup\".  I have a stomach condition that requires soup on a daily basis and having previously not liked soupthis was a difficult step for me.  But your recipe has converted me into a soup lover.  It works great for chicken too.  Thank you for adding spicesherbs and FLAVOUR to your recipe.  It really is different and great tasting.  Your efforts to get this out to people like me is very much appreciated."
  },
  {
    "_id": 1445,
    "recipe_id": 514,
    "user_id": 5495,
    "user": "annaclaire crocco",
    "Rating": 4,
    "Review": "great when sprinkled with grated parmasaen cheese just before serving!"
  },
  {
    "_id": 1446,
    "recipe_id": 518,
    "user_id": 1773,
    "user": "Malarkey Test",
    "Rating": 4,
    "Review": "interesting. i added celery and some cilantro.  i think i made it a bit too hot though."
  },
  {
    "_id": 1447,
    "recipe_id": 522,
    "user_id": 5503,
    "user": "Jules Yoken",
    "Rating": 0,
    "Review": "Sounds a bit like Bigos"
  },
  {
    "_id": 1448,
    "recipe_id": 523,
    "user_id": 5285,
    "user": "Michael Dahlquist",
    "Rating": 3,
    "Review": "Basicsimple - but it's goodand taught me a thing or two about making good thai (?) soup - never cooked with lemon grassbut it was yummy. Simple to make and wholesome and creamy without dairyI'd forgotten the charms of coconut milk."
  },
  {
    "_id": 1449,
    "recipe_id": 525,
    "user_id": 5519,
    "user": "amity bradley",
    "Rating": 5,
    "Review": "My boyfriend and i were very pleased with this recipe. he is half chinese so he knows the good stuff. the only thing we changed was the amount of chili paste. we only put one tablespoon instead of 2. the soup is very very spicy with 2 tblsp's. other than that it was great. the flavor is awesome. my boyfriend said that it tasted just like his mom's. that is a great compliment."
  },
  {
    "_id": 1450,
    "recipe_id": 526,
    "user_id": 5681,
    "user": "ravindra mandagere",
    "Rating": 3,
    "Review": "the baking time of 1 hour at 300 degrees plus"
  },
  {
    "_id": 1451,
    "recipe_id": 533,
    "user_id": 5683,
    "user": "Patricia Fitzgerald",
    "Rating": 4,
    "Review": "Suggestion:  Subsitiution for bread crumbs. You can also use Cereal(corn-flakes)Crackers,and sometimes you can use Corn chips to."
  },
  {
    "_id": 1452,
    "recipe_id": 534,
    "user_id": 5689,
    "user": "Berevaline Windsor",
    "Rating": 5,
    "Review": "Wow!!!  Egyptian food!!!  Cool!!!"
  },
  {
    "_id": 1453,
    "recipe_id": 535,
    "user_id": 5686,
    "user": "Mariya Davis",
    "Rating": 5,
    "Review": "The dish is wonderful! It so easy to makeit takes 15-20 min :). Also I like to serve it with butter and sour cream. Everytime I cook Spaetzle my husband ask if there anything is left. ThoughI always cook more. Tryand you''ll see how easy and delicious it is!"
  },
  {
    "_id": 1454,
    "recipe_id": 537,
    "user_id": 5704,
    "user": "Francesca Tabaranza",
    "Rating": 4,
    "Review": "Variationinstead of vinegar use freshly squeezed lemon juice."
  },
  {
    "_id": 1455,
    "recipe_id": 538,
    "user_id": 5523,
    "user": "Dave C",
    "Rating": 4,
    "Review": "This looks good. My grandkids will love me. thanks.  :>))"
  },
  {
    "_id": 1456,
    "recipe_id": 543,
    "user_id": 1872,
    "user": "Lisa Rittel",
    "Rating": 5,
    "Review": "I have had this before. It has really good flavor!Be sure to use salted pretzelsthey really make the dish good."
  },
  {
    "_id": 1457,
    "recipe_id": 546,
    "user_id": 1873,
    "user": "Leslie Ashenfelter",
    "Rating": 5,
    "Review": "It was delicious. And very easy too. Even a little kid could make it."
  },
  {
    "_id": 1458,
    "recipe_id": 548,
    "user_id": 1886,
    "user": "HELEN PEAGRAM",
    "Rating": 5,
    "Review": "It was DELICIOUS and so easy too. My six year old niece even made it herself. It is such a healthy snack."
  },
  {
    "_id": 1459,
    "recipe_id": 549,
    "user_id": 1887,
    "user": "Vicky Sinclair",
    "Rating": 5,
    "Review": "Hello!  My family used to use chicken feet in our soup and it was wonderful.  I was raised on a grain and dairy farmwe raised everythingprocessed our own meatcanned all our own vegetables etc.  It's so nice to come across all these wonderful recipes.  June Bug"
  },
  {
    "_id": 1460,
    "recipe_id": 550,
    "user_id": 1889,
    "user": "spam4409",
    "Rating": 0,
    "Review": "I had a Great Aunt that made the most wonderful dill pickles she told me that her secret was that she used rain water.  How interesting.  June Bug"
  },
  {
    "_id": 1461,
    "recipe_id": 552,
    "user_id": 1893,
    "user": "Pam Whitmire",
    "Rating": 5,
    "Review": "As a helper of a girl scout troopone of a projects to earn a badge was to prepare an ethnic meal.  We chose and Italian meal and for dessert we chose these cookies.  The girls really enjoyed making and EATING them.  We got about 5 1/2 dozen cookies from a batch.  Thanks for a really wonderful and delicious recipe."
  },
  {
    "_id": 1462,
    "recipe_id": 555,
    "user_id": 2178,
    "user": "troyh",
    "Rating": 5,
    "Review": "awesome....kids loved it!!!!!"
  },
  {
    "_id": 1463,
    "recipe_id": 556,
    "user_id": 10033,
    "user": "spatchcock",
    "Rating": 0,
    "Review": "This is a great recipe that's too easy."
  },
  {
    "_id": 1464,
    "recipe_id": 557,
    "user_id": 22015,
    "user": "Mysterygirl",
    "Rating": 4,
    "Review": "This recipe was very easy to makeand it turned out great! The cooking temperature was not specifiedso I used 350 degrees. AlsoI subbed low fat ricotta cheese for cottage cheese because I prefer the taste."
  },
  {
    "_id": 1465,
    "recipe_id": 559,
    "user_id": 25843,
    "user": "Crab Place",
    "Rating": 5,
    "Review": "Easy to follow recipe.  Wonderful taste. Had no problems with cake or blueberrys sticking to pan."
  },
  {
    "_id": 1466,
    "recipe_id": 563,
    "user_id": 28729,
    "user": "Auntie Jan",
    "Rating": 5,
    "Review": "I haven't made this as yettoday is Feb. 18,2001but I boiled the carcass of a turkey and the ingredients you have listed just fit us to a tee.  I just happened on this site looking for a quickeasytasty soup.  I am rating it even though I haven't tasted it yet.  I can just tell by the ingredients. I would serve it with crusty bread and a nice light white wine.  Preferably Gallo's white Zinfandel.  Nice going!!"
  },
  {
    "_id": 1467,
    "recipe_id": 566,
    "user_id": 34879,
    "user": "Barefoot Beachcomber",
    "Rating": 4,
    "Review": "I have made these and they are deliciousI also have made them with the Cherry"
  },
  {
    "_id": 1468,
    "recipe_id": 568,
    "user_id": 35526,
    "user": "riffraff",
    "Rating": 4,
    "Review": "We cut up some chorizo (instead of andouille) and put it into the sauceand used it on chicken. It was greatbut with a salty sausage like chorizousing the recommended amount of salt in the recipe was a little too much. I would definitely reccomend this for anyone who loves barbeque!"
  },
  {
    "_id": 1469,
    "recipe_id": 569,
    "user_id": 35635,
    "user": "_Pixie_",
    "Rating": 2,
    "Review": "Wayway too lemony.  I ate about half of my meal and vowed never to eat anything with lemon in it again.  I marinated overnight...  Bad idea!  I imagine this recipe could be great with a little tweaking."
  },
  {
    "_id": 1470,
    "recipe_id": 570,
    "user_id": 39194,
    "user": "OzMan",
    "Rating": 2,
    "Review": "I love Red Lobster caesar salad dressing.  I have looked the net over to find a recipe that tastes like it.  This recipe is alrightbut to me still tastes NOTHING like Red Lobster's caesar dressing.  Guess I'll keep looking."
  },
  {
    "_id": 1471,
    "recipe_id": 571,
    "user_id": 39547,
    "user": "Julesong",
    "Rating": 4,
    "Review": "Add a drop or two of Tabasco sauce to each one to give them a little kick.  I put the Tabasco sauce on top of the cream cheese layer.  Try ityou'll like it."
  },
  {
    "_id": 1472,
    "recipe_id": 572,
    "user_id": 39636,
    "user": "Chrissyo",
    "Rating": 4,
    "Review": "very good,easy to follow"
  },
  {
    "_id": 1473,
    "recipe_id": 573,
    "user_id": 47510,
    "user": "Dreamgoddess",
    "Rating": 4,
    "Review": "This was easy to make and very YUMMY!"
  },
  {
    "_id": 1474,
    "recipe_id": 575,
    "user_id": 51011,
    "user": "Loves2Teach",
    "Rating": 5,
    "Review": "This is a great recipe....It didn't take too much time to prepare and the final results were delicious!"
  },
  {
    "_id": 1475,
    "recipe_id": 576,
    "user_id": 51109,
    "user": "Vina7737",
    "Rating": 2,
    "Review": "I thought the gingerstar anise and parsnips are some of the most important ingredients in the soup.  I have read the recipe many times to find out when to add those ingredients.  No luck.  Can't find it."
  },
  {
    "_id": 1476,
    "recipe_id": 579,
    "user_id": 52448,
    "user": "PetsRus",
    "Rating": 5,
    "Review": "i thought that this was really really yummy."
  },
  {
    "_id": 1477,
    "recipe_id": 580,
    "user_id": 55166,
    "user": "peppermintkitty",
    "Rating": 4,
    "Review": "This was really goodhoweverI left out the turnips due to a family memebers dislikebut added 2 tblsp of worshirer sauce. YUM!!!"
  },
  {
    "_id": 1478,
    "recipe_id": 581,
    "user_id": 56112,
    "user": "Jellyqueen",
    "Rating": 0,
    "Review": "I would just like to say that this recipe comes from the cookbookThe Complete Soy Cookbookby Paulette Mitchell."
  },
  {
    "_id": 1479,
    "recipe_id": 583,
    "user_id": 64203,
    "user": "Dine  Dish",
    "Rating": 0,
    "Review": "This is a great recipe! Try serving with hollandaise sauce."
  },
  {
    "_id": 1480,
    "recipe_id": 705,
    "user_id": 1530,
    "user": "Carole Reu",
    "Rating": 5,
    "Review": "better than any you can get at a restaurant!"
  },
  {
    "_id": 1481,
    "recipe_id": 712,
    "user_id": 1531,
    "user": "Mimi Hiller",
    "Rating": 4,
    "Review": "I cut back on the mayoand made up the difference with sour cream to adjust the stiffness of the dip."
  },
  {
    "_id": 1482,
    "recipe_id": 714,
    "user_id": 1533,
    "user": "Dancer",
    "Rating": 5,
    "Review": "easily the best i have ever had.  juicy flavorfulnot dry.  the vegetables retain crispness as wellnot bland at all!"
  },
  {
    "_id": 1483,
    "recipe_id": 715,
    "user_id": 1534,
    "user": "Tonkcats",
    "Rating": 0,
    "Review": "Would someone please check the Nutrition Facts of this recipe."
  },
  {
    "_id": 1484,
    "recipe_id": 721,
    "user_id": 1535,
    "user": "Marg CaymanDesigns",
    "Rating": 4,
    "Review": "a little greasybut a huge hit with the guests."
  },
  {
    "_id": 1485,
    "recipe_id": 730,
    "user_id": 1537,
    "user": "Barbara5",
    "Rating": 5,
    "Review": "leeks on a pizza?!  it was really delicious.  i used a boboli and added some chicken sausage slices and mushrooms too."
  },
  {
    "_id": 1486,
    "recipe_id": 751,
    "user_id": 1538,
    "user": "Duckie067",
    "Rating": 5,
    "Review": "I deleted the bean sprouts and replaced them with salted cashew nuts...a nice complement to the sweet/sour dressing. Our guests loved itin my opinion,it deserves a \"5-pan\" rating."
  },
  {
    "_id": 1487,
    "recipe_id": 754,
    "user_id": 1539,
    "user": "opal Fitzgerald",
    "Rating": 1,
    "Review": "Where does the bbq come in"
  },
  {
    "_id": 1488,
    "recipe_id": 760,
    "user_id": 1542,
    "user": "ann joy",
    "Rating": 3,
    "Review": "It is a good recipe...but I believe that it would be better if it had raisins included  :)"
  },
  {
    "_id": 1489,
    "recipe_id": 772,
    "user_id": 1543,
    "user": "Doreen Randal",
    "Rating": 2,
    "Review": "This recipe is called pumpkin squareswheres the squares? ITS A PIE !"
  },
  {
    "_id": 1490,
    "recipe_id": 776,
    "user_id": 1544,
    "user": "tranch",
    "Rating": 3,
    "Review": "Careful not to cook it too long... you want the tuna to be closer to raw on the inside and crusty on the outside. Maybe use canola oil instead of butter to help sear the outside."
  },
  {
    "_id": 1491,
    "recipe_id": 778,
    "user_id": 1545,
    "user": "Nancy Van Ess",
    "Rating": 4,
    "Review": "Took about 70 minutes to bake."
  },
  {
    "_id": 1492,
    "recipe_id": 779,
    "user_id": 1546,
    "user": "Jane McCLure",
    "Rating": 5,
    "Review": "These have been an absolute hit with everyone every time I have made them.  They are incredibly easy to make and just heavenly!"
  },
  {
    "_id": 1493,
    "recipe_id": 782,
    "user_id": 1547,
    "user": "Morton Design Graph",
    "Rating": 5,
    "Review": "Working 12 hour days 7 days a weekI was delighted to return home to a delious meal from my Crockpot.  Easy tastyand delious are understatements for this recipe!"
  },
  {
    "_id": 1494,
    "recipe_id": 808,
    "user_id": 1548,
    "user": "Peggy Benisch",
    "Rating": 5,
    "Review": "I think this recipie is awesome. It tastes delicious and my whole family loved it."
  },
  {
    "_id": 1495,
    "recipe_id": 810,
    "user_id": 1549,
    "user": "Dave5003",
    "Rating": 5,
    "Review": "if you like oystersthis is a great alternative to regularboring stuffing."
  },
  {
    "_id": 1496,
    "recipe_id": 820,
    "user_id": 1550,
    "user": "Linda Sundbye",
    "Rating": 5,
    "Review": "quite easy to make make the taste is not bad either. i'd love to make it again and again with different toppings."
  },
  {
    "_id": 1497,
    "recipe_id": 824,
    "user_id": 1551,
    "user": "Sean Coate",
    "Rating": 0,
    "Review": "I thought Chicken Cacciatore had peppers. If i were to make thisit would contain about 5-6 cut up peppers1 can tomato paste and a large can of crushed tomatoes and of course the chicken."
  },
  {
    "_id": 1498,
    "recipe_id": 825,
    "user_id": 1552,
    "user": "Ron  Joyce Ripple S",
    "Rating": 5,
    "Review": "These make a wonderful healthy snack."
  },
  {
    "_id": 1499,
    "recipe_id": 828,
    "user_id": 1554,
    "user": "Jacques Lorrain",
    "Rating": 5,
    "Review": "This is a wonderful recipebut last I knew it was from the famous Chef David Ruggerio actually from his grandmother....so I think he deserves the credit."
  },
  {
    "_id": 1500,
    "recipe_id": 834,
    "user_id": 1555,
    "user": "Cindy Hartlin",
    "Rating": 3,
    "Review": "It's a tasty dish."
  },
  {
    "_id": 1501,
    "recipe_id": 842,
    "user_id": 1556,
    "user": "Strawberry Girl",
    "Rating": 3,
    "Review": "tasty. you can substitute granulated sugar for the palm sugar."
  },
  {
    "_id": 1502,
    "recipe_id": 845,
    "user_id": 1557,
    "user": "Angel Villanueva",
    "Rating": 4,
    "Review": "This is a lovely little repice. Quite delicious. However I recommend you cook the chicken breasts slowly and don't add the honey glaze until the last 4 to 5 minutes of cooking as it burns very quickly. Keping that in mindPlease try this quick and easy recipe. :)"
  },
  {
    "_id": 1503,
    "recipe_id": 846,
    "user_id": 1558,
    "user": "S. Malcolm",
    "Rating": 0,
    "Review": "Terrible directions. Doesn't say how to make the dough or the filling."
  },
  {
    "_id": 1504,
    "recipe_id": 851,
    "user_id": 1559,
    "user": "Will Parkinson",
    "Rating": 5,
    "Review": "It looks fabulousand will go great with my fresh cranberries from Eagle River WI."
  },
  {
    "_id": 1505,
    "recipe_id": 852,
    "user_id": 1562,
    "user": "Libby1",
    "Rating": 4,
    "Review": "needs more spice."
  },
  {
    "_id": 1506,
    "recipe_id": 858,
    "user_id": 1564,
    "user": "Ginny Holmy-Willcox",
    "Rating": 5,
    "Review": "I know that this recipe sounds strangebut I've tried it and it is the best fudge that I've ever had.  It's not too sweet like most areit stays soft (even after a few days). You must try ityou won't believe it!"
  },
  {
    "_id": 1507,
    "recipe_id": 876,
    "user_id": 1567,
    "user": "elly9812",
    "Rating": 4,
    "Review": "My husband LOVES this stuff.  It was the only thing he requested I make for Thanksgiving. The recipe is easy and if it makes him happy I'll keep making it."
  },
  {
    "_id": 1508,
    "recipe_id": 880,
    "user_id": 1569,
    "user": "Linda7",
    "Rating": 1,
    "Review": "Not much Effort."
  },
  {
    "_id": 1509,
    "recipe_id": 884,
    "user_id": 1570,
    "user": "Dave Miner",
    "Rating": 5,
    "Review": "This is the best pie crust I have ever made.  It is simple and easy.  I have tried to make it fail but can not.  The taste and texture is wonderful."
  },
  {
    "_id": 1510,
    "recipe_id": 886,
    "user_id": 1571,
    "user": "Linda Johansen",
    "Rating": 5,
    "Review": "Our family has enjoyed this recipetime and time again with great success. Favorite topping for this is to serve with chiligrated cheese and onions. The kids love it simply with catsup."
  },
  {
    "_id": 1511,
    "recipe_id": 893,
    "user_id": 1572,
    "user": "Ed Paulhus",
    "Rating": 4,
    "Review": "This recipie would be 5 STARS if you top it before you bake it with1 C crushed corn flakes1/2 C brown sugar1/4 chopped pecans4 Tbsp butter and a Tbsp of flour and bake as directed. Topping is about accurateto the best of my memorydefinately try....This is a Thanksgiving MUSTand NO ONE will believe it is carrots!!!!!!"
  },
  {
    "_id": 1512,
    "recipe_id": 902,
    "user_id": 1573,
    "user": "benluc",
    "Rating": 1,
    "Review": "This dish was good the first few bites then it got a vinager taste. I wont make it again"
  },
  {
    "_id": 1513,
    "recipe_id": 911,
    "user_id": 1530,
    "user": "Carole Reu",
    "Rating": 5,
    "Review": "This is a great quick,easy,tasy cheescake."
  },
  {
    "_id": 1514,
    "recipe_id": 912,
    "user_id": 1531,
    "user": "Mimi Hiller",
    "Rating": 4,
    "Review": "I found this meat loaf to be quite tastyI was a little nervous about the carrots,but it made it sweeter than I have tasted in a meat loaf. The measurements were a little over it made a rather large loaf and took a lot longer to cook. I had to raise the temp to 400 to get it to cook at a faster rate. It also gave off a lot of liquid and I used extra lean meat. It made about eight servings and all together was a good meat loaf. I would defintely make it again."
  },
  {
    "_id": 1515,
    "recipe_id": 913,
    "user_id": 1533,
    "user": "Dancer",
    "Rating": 5,
    "Review": "A lot of people at our baby shower said how much they liked this punch.  Even one person said that they didn't like champagne but they loved this punch.  It had a nice fruity flavor and pretty color.  This one will go in my recipe file.  I couldn't find the frozen pineapple-orange-guava juice so I went with pineapple-orange.  Thanks for this wonderful recipe that was definitely a hit!"
  },
  {
    "_id": 1516,
    "recipe_id": 915,
    "user_id": 1534,
    "user": "Tonkcats",
    "Rating": 5,
    "Review": "I made this casserole using light cream of celerylight sour creamlight Ritz crackers and light cheddar.  It still came out wonderful! Great alternative to the same old green bean casserole."
  },
  {
    "_id": 1517,
    "recipe_id": 920,
    "user_id": 1535,
    "user": "Marg CaymanDesigns",
    "Rating": 4,
    "Review": "Will go great with Thangsgiving meal."
  },
  {
    "_id": 1518,
    "recipe_id": 932,
    "user_id": 1537,
    "user": "Barbara5",
    "Rating": 3,
    "Review": "Simple and easy to prepare."
  },
  {
    "_id": 1519,
    "recipe_id": 933,
    "user_id": 1538,
    "user": "Duckie067",
    "Rating": 5,
    "Review": "she loved it"
  },
  {
    "_id": 1520,
    "recipe_id": 943,
    "user_id": 1539,
    "user": "opal Fitzgerald",
    "Rating": 3,
    "Review": "I just had to make this magic food of song (at least as sung by SharenLois and Bram).  I must say that I usually don't  like walnutsbut they were great in this.  This was very tastythough not as rich as I might have guessed.  It was somewhat  sweeter than I normally likebut I did not leave any in the bowl. The upside down presentation is showy.  I recommend some very rich ice cream as a topping or side dish (Blue Bell Homemade Vanilla  Ice Cream fills the bill in my neck of the woods).  Fun and tasty."
  },
  {
    "_id": 1521,
    "recipe_id": 952,
    "user_id": 1542,
    "user": "ann joy",
    "Rating": 5,
    "Review": "I would reccomend this recipe to any one that doesn't like pumpkin pieit is a delicious substitute. The pumkin rolls are almost like cinnamon rolls except for the taste.  I reccomend this recipe to every one."
  },
  {
    "_id": 1522,
    "recipe_id": 953,
    "user_id": 1543,
    "user": "Doreen Randal",
    "Rating": 0,
    "Review": "makes 2- 9inch pies  or 1 deep dish pie"
  },
  {
    "_id": 1523,
    "recipe_id": 962,
    "user_id": 1544,
    "user": "tranch",
    "Rating": 5,
    "Review": "I recently tried this recipe and got rave reviews from family and friends!"
  },
  {
    "_id": 1524,
    "recipe_id": 965,
    "user_id": 1545,
    "user": "Nancy Van Ess",
    "Rating": 3,
    "Review": "I came upon this recipe while searching for a sweet potato topping. I didn't like the recipe for the potato itself because it would have been much to sweet and \"heavy\" for my tastes. I did enjoy the topping very muchthough. I topped plainbuttered sweet potatoes with it and they were quite good."
  },
  {
    "_id": 1525,
    "recipe_id": 966,
    "user_id": 1546,
    "user": "Jane McCLure",
    "Rating": 3,
    "Review": "Where's the Nutmeg And the Cinnamon?"
  },
  {
    "_id": 1526,
    "recipe_id": 970,
    "user_id": 1547,
    "user": "Morton Design Graph",
    "Rating": 5,
    "Review": "My wife made this recipie for Thanksgiving today and the whole family agreed it was the best food on the whole table."
  },
  {
    "_id": 1527,
    "recipe_id": 989,
    "user_id": 1548,
    "user": "Peggy Benisch",
    "Rating": 5,
    "Review": "The Turkey was wonderful!!! My Husband thought I was crazy when he read the note I left him in the morning when he got up to put it in the oven. when I pulled it out of the oven he said it was the prettiest Turkey he had ever seenBut said lets wait to see what it taste like. when he tried it at my parents he loved it and made sure every one know he was the one who cooked it since he was the one who put it in the oven"
  },
  {
    "_id": 1528,
    "recipe_id": 998,
    "user_id": 1549,
    "user": "Dave5003",
    "Rating": 5,
    "Review": "Muffins were simply excellent!  Easy to preparemoist and so tasty!  We started out by reducing the recipe for only 4 servings...after the first muffin was gonewe started the second batch (increasing to 12 servings!).  ENJOY!"
  },
  {
    "_id": 1529,
    "recipe_id": 1008,
    "user_id": 1550,
    "user": "Linda Sundbye",
    "Rating": 2,
    "Review": "Recipe did not result in expected product.  Noodles were BLAHdid not hold form well.  By farthis is not one of the better recipes I have used for Spatzel.  A little tweaking is required.  Most likely I will stick with my Grandmother Stroud''s tried and true recipe."
  },
  {
    "_id": 1530,
    "recipe_id": 1012,
    "user_id": 1551,
    "user": "Sean Coate",
    "Rating": 5,
    "Review": "Excellent and great tasting.  Easy prep!!!!! My guest loved it!   :-)"
  },
  {
    "_id": 1531,
    "recipe_id": 1018,
    "user_id": 1552,
    "user": "Ron  Joyce Ripple S",
    "Rating": 1,
    "Review": "Onions and whiskey overpowered the sauce.  Not at all similar to TGI Friday's mariande."
  },
  {
    "_id": 1532,
    "recipe_id": 1031,
    "user_id": 1554,
    "user": "Jacques Lorrain",
    "Rating": 2,
    "Review": "Goodstraight forward side dish.  Howeverthe author of the recipe forgot to list the sour cream in the list of ingredients.  Thanksgiving morning I was preparing my casserole and got to the part where I was supposed to add it.  I substituted some extra broth to make up for itbut it still ended up dry and gooey.  My advicedon't try anything new on a holiday."
  },
  {
    "_id": 1533,
    "recipe_id": 1034,
    "user_id": 1555,
    "user": "Cindy Hartlin",
    "Rating": 4,
    "Review": "very good   made it with and without the vodka"
  },
  {
    "_id": 1534,
    "recipe_id": 1042,
    "user_id": 1556,
    "user": "Strawberry Girl",
    "Rating": 4,
    "Review": "I ended up adapting this to make a kind of taco instead of baking it as enchiladasbut we liked it quite a bit."
  },
  {
    "_id": 1535,
    "recipe_id": 1048,
    "user_id": 1557,
    "user": "Angel Villanueva",
    "Rating": 4,
    "Review": "It was a good recipebut I felt it needed a little garlic. My son said it was just like he had it in a restaurant. (which in our neighborhood is a great restuarant).  Bravo great stuff."
  },
  {
    "_id": 1536,
    "recipe_id": 1059,
    "user_id": 1558,
    "user": "S. Malcolm",
    "Rating": 5,
    "Review": "I served this recipeCherry Cheese Salad at our community dinner for 60 people. It was a hit. It is a wonderfulrefreshing salad. It seems to come alive in your mouth when all the flavors hit the taste buds. Great recipe!"
  },
  {
    "_id": 1537,
    "recipe_id": 1068,
    "user_id": 1559,
    "user": "Will Parkinson",
    "Rating": 4,
    "Review": "This is great.  Very similar to apple butterand cans in jars very well.  My family loved itas well as some friends I gave it to.  This is a neat way to use the pumpkins left over from halloween or thanksgiving time."
  },
  {
    "_id": 1538,
    "recipe_id": 1073,
    "user_id": 1562,
    "user": "Libby1",
    "Rating": 0,
    "Review": "This is in fact not a Greek dishbut Turkish.  \"Dolma\" means \"StuffingStuffed\" in Turkish and the origins of this dish go back to authentic Ottoman Imperial Cuisine. In fact there are very many other stuffed vegetable dishes in the Turkish Cuisinesuch as eggplantsarthichokesmarrow(zuccihini) and its blossomspotatoes etc.  This termstuffedis also used for dishes where chickenturkey and the like are stuffed with various ingredientsmainly ricebefore cooking usually in the oven."
  },
  {
    "_id": 1539,
    "recipe_id": 1074,
    "user_id": 1564,
    "user": "Ginny Holmy-Willcox",
    "Rating": 0,
    "Review": "Baklava is definitely not Greekbut Turkish.  It was the prime dessert in the Ottoman Cuisine and a feast never ended without a serving.  In fact the word itself is Turkishmeaning \"diamond-shaped\" which was the way in which the pastry was cut before serving. Generally walnutspistachios and other nuts are used for the filling."
  },
  {
    "_id": 1540,
    "recipe_id": 1075,
    "user_id": 1567,
    "user": "elly9812",
    "Rating": 0,
    "Review": "This dishwith slight variations (usually lemon juice is used) is very common in Middle Eastern Countries and should not be categorised as Greekbut \"collective\".  I suspect that it is in fact Lebanese."
  },
  {
    "_id": 1541,
    "recipe_id": 1079,
    "user_id": 1569,
    "user": "Linda7",
    "Rating": 5,
    "Review": "This is a great recipe I made it for my family soon it will be served in my restaurants."
  },
  {
    "_id": 1542,
    "recipe_id": 1081,
    "user_id": 1570,
    "user": "Dave Miner",
    "Rating": 2,
    "Review": "This recipe sounded a lot better than it turned out for me.  I ends up too runny and mushy for my tastes.  Still ediblejust not my best bread pudding.  Suggestions?"
  },
  {
    "_id": 1543,
    "recipe_id": 1086,
    "user_id": 1571,
    "user": "Linda Johansen",
    "Rating": 5,
    "Review": "I thought this recipe was very quick and easy and delicious. I made at Thanksgiving for my family and they really enjoyed it.  I'm making it again for some friends at work."
  },
  {
    "_id": 1544,
    "recipe_id": 1100,
    "user_id": 1572,
    "user": "Ed Paulhus",
    "Rating": 5,
    "Review": "It was A great recipe but I did not use the apples"
  },
  {
    "_id": 1545,
    "recipe_id": 1108,
    "user_id": 1573,
    "user": "benluc",
    "Rating": 5,
    "Review": "I have baked these biscotti before and they are excellent.  I'm so glad I could find the recipe again."
  },
  {
    "_id": 1546,
    "recipe_id": 1129,
    "user_id": 1596,
    "user": "Joan Edington",
    "Rating": 5,
    "Review": "This is a very tasty cake--my recipe calls for sprinkling the batter with 1/2 cup chopped nuts before baking--Delicious!!"
  },
  {
    "_id": 1547,
    "recipe_id": 1136,
    "user_id": 1598,
    "user": "Miss Daisy",
    "Rating": 5,
    "Review": "The French Onion soup recipe is one of the most popular dish served at the Famous Barr (also part of the May Dept store group) restaurants found in St.Louis.   Based on my travels to the various countries including EuropeAsia and USthis version of French Onion soup is one of the best I've had. My husband who is from London just loves this recipe."
  },
  {
    "_id": 1548,
    "recipe_id": 1145,
    "user_id": 1599,
    "user": "Mays Pearls of Wisd",
    "Rating": 5,
    "Review": "My grandma has been making this simple coffee cake for years.  It is a huge favorite for the whole family!  We add chopped pecans to ours.  Really easy for overnight company.  It rises overnight and you pop it in the oven before everyone gets up."
  },
  {
    "_id": 1549,
    "recipe_id": 1148,
    "user_id": 1600,
    "user": "Leon  Miriam Posvol",
    "Rating": 5,
    "Review": "This taste great!!!!!! Even my 3yr. old loved it"
  },
  {
    "_id": 1550,
    "recipe_id": 1155,
    "user_id": 1601,
    "user": "Gilcat2",
    "Rating": 5,
    "Review": "Everyone loved it. I have made it up twice in one week.  I put it up in the freezer in individual servings."
  },
  {
    "_id": 1551,
    "recipe_id": 1165,
    "user_id": 1603,
    "user": "Carol H",
    "Rating": 4,
    "Review": "Great recipeeveryone loved it,,young & old."
  },
  {
    "_id": 1552,
    "recipe_id": 1170,
    "user_id": 1604,
    "user": "itsjustme",
    "Rating": 4,
    "Review": "This recipe is greatespecially for chocolate lovers. It goes very well topped off with whipped cream. However the recipe never tells you what to do with the hazelnuts. So I just added them into the mixture along with the biscuits and turned the chocolate into it. It was delicious."
  },
  {
    "_id": 1553,
    "recipe_id": 1175,
    "user_id": 1605,
    "user": "William Fitzgerald",
    "Rating": 3,
    "Review": "Ok"
  },
  {
    "_id": 1554,
    "recipe_id": 1181,
    "user_id": 1609,
    "user": "Barbara Heller",
    "Rating": 5,
    "Review": "This is a wonderful holiday bread.  I make it every year and give some of the loaves to my close friends and neighbors who look forward to this special treat.  It is especially delicious served with a hot cup of Christmas tea."
  },
  {
    "_id": 1555,
    "recipe_id": 1183,
    "user_id": 1610,
    "user": "B  B Adams",
    "Rating": 0,
    "Review": "I''m really happy to read so many people are enjoying my Mothers recipe for cucumber salad. She would be absolutely thrilled. Thanks you so much. ENJOY."
  },
  {
    "_id": 1556,
    "recipe_id": 1204,
    "user_id": 1612,
    "user": "JANIC412",
    "Rating": 4,
    "Review": "It was not the best that I ever ate but it was definately the best that I ever made. I didn't make it in the microwave but on the stove. I liked itand it was easy to make. One of the reasons it was probably not the best I ever ate is because I used chicken that was all ready cut up so there was no skin and less fat and less taste. I have to watch my fat intake."
  },
  {
    "_id": 1557,
    "recipe_id": 1207,
    "user_id": 1613,
    "user": "george nuckols",
    "Rating": 0,
    "Review": "the finished product is excellent."
  },
  {
    "_id": 1558,
    "recipe_id": 1220,
    "user_id": 1616,
    "user": "Melody",
    "Rating": 4,
    "Review": "Very unique & since garlic is my favorite ingredient...i love it!"
  },
  {
    "_id": 1559,
    "recipe_id": 1224,
    "user_id": 1617,
    "user": "Irene Wilcox",
    "Rating": 5,
    "Review": "I made this soup pretty much as directed except I browned the meat in olive oiland added 2 bay leaves,and two cloves of garlic. I just had it for lunch and my sister and I thought it was excelent I will freeze the rest in individule serving sizes for my husband and I."
  },
  {
    "_id": 1560,
    "recipe_id": 1229,
    "user_id": 1621,
    "user": "Quick n Easy Recipes",
    "Rating": 5,
    "Review": "Excellent chiliespecially liked it with the spaghetti.  I prefer more chili powder than the recipe called for.  Also makes for very good chili cheese fries."
  },
  {
    "_id": 1561,
    "recipe_id": 1232,
    "user_id": 1629,
    "user": "Joy Boss",
    "Rating": 5,
    "Review": "I live on the Oregon coast and met and fell in love with a wonderful man from cinncinnati."
  },
  {
    "_id": 1562,
    "recipe_id": 1242,
    "user_id": 1630,
    "user": "Tim  Tina Ireland",
    "Rating": 5,
    "Review": "I heard about this fudge this morning..looked up the recipe and made it..it is great..so easy and the best fudge I've ever eaten."
  },
  {
    "_id": 1563,
    "recipe_id": 1253,
    "user_id": 1632,
    "user": "Peeter Raudvere",
    "Rating": 0,
    "Review": "Rum Flavoringmight have been her way of saying 100 proof Rum."
  },
  {
    "_id": 1564,
    "recipe_id": 1266,
    "user_id": 1633,
    "user": "Julie chazelet",
    "Rating": 5,
    "Review": "I loved this recipevery tasty and makes a great appyi will be making it for my new years party."
  },
  {
    "_id": 1565,
    "recipe_id": 1267,
    "user_id": 1634,
    "user": "Bill Hilbrich",
    "Rating": 5,
    "Review": "This was easy to make and handy to have in the freezer ready to just bake. I will have to learn to cut it down into four serving sizes though. It was to much just for my husband and I. I also added ground beef to mine. It tasted really good."
  },
  {
    "_id": 1566,
    "recipe_id": 1275,
    "user_id": 1635,
    "user": "Jill McQuown",
    "Rating": 5,
    "Review": "BOY!  You sure can't eat just one of these muffins at a time. They were really great and easy to make. I even made a terrible mistakeI forgot to put the brown sugar in. The next two batches I make I will do right. I didn't think something with green chili in would taste good. Was I surprised."
  },
  {
    "_id": 1567,
    "recipe_id": 1296,
    "user_id": 1636,
    "user": "carlanna livingstone",
    "Rating": 4,
    "Review": "Very good and really easy!!!"
  },
  {
    "_id": 1568,
    "recipe_id": 1298,
    "user_id": 1639,
    "user": "elt8588",
    "Rating": 5,
    "Review": "I have made this recipe for the last 6-7yrs. at Christmas.  I usually don't like fudgebut this is GREAT.  I give it as gifts and everyone always asks for the recipe."
  },
  {
    "_id": 1569,
    "recipe_id": 1306,
    "user_id": 1640,
    "user": "Seausoon39",
    "Rating": 5,
    "Review": "Best Chilli I have ever had.  Nice and spiceyfilling and againthe best chilli I have ever had."
  },
  {
    "_id": 1570,
    "recipe_id": 1315,
    "user_id": 1641,
    "user": "June Neil",
    "Rating": 4,
    "Review": "These were incredibly easy and fast to make.  They stored well in the refrigerator...I brought them to my organization's holiday potluck on a nice paper plate.  They all went quicklyso there was no cleanup or any leftovers to take back home.  PS--my coworkers liked them!"
  },
  {
    "_id": 1571,
    "recipe_id": 1317,
    "user_id": 1642,
    "user": "M Messer",
    "Rating": 5,
    "Review": "This is a great recipe... make ahead and broil before serving. My friends love this."
  },
  {
    "_id": 1572,
    "recipe_id": 1320,
    "user_id": 1643,
    "user": "Mutende",
    "Rating": 5,
    "Review": "I made a double batch of this soup and added a medium onion and two cloves of garlic. It was easy and I thought it was really great. Of coarse potato soup is my favorite and this was the best that I have ever made. I am going to put in individual servings and freeze."
  },
  {
    "_id": 1573,
    "recipe_id": 1322,
    "user_id": 1646,
    "user": "WildlifeDi",
    "Rating": 5,
    "Review": "I've often made these with different liquers. Orangeraspberry and peach are favorites.  Of coursewhen my husband makes themwith either rum or bourbonthey're a bit more \"liquidy\" than normal."
  },
  {
    "_id": 1574,
    "recipe_id": 1367,
    "user_id": 1647,
    "user": "MJ  BARB HUNDAHL",
    "Rating": 5,
    "Review": "I love this soup it was great.  i would love to try to make it again some time to have.  I did tell all my friends about it and they loved it too.  ao to eveyone this is the best soup try it too."
  },
  {
    "_id": 1575,
    "recipe_id": 1396,
    "user_id": 1648,
    "user": "a-j-b",
    "Rating": 0,
    "Review": "This recipe sounds interesting except what is the brine made of?"
  },
  {
    "_id": 1576,
    "recipe_id": 1399,
    "user_id": 1649,
    "user": "Whtsebring",
    "Rating": 4,
    "Review": "It was my first time making sweet potatoesand this recipe was very simple and easy to follow. Everyone at Thanksgiving loved them."
  },
  {
    "_id": 1577,
    "recipe_id": 1406,
    "user_id": 1652,
    "user": "Graham Scott",
    "Rating": 5,
    "Review": "This recipe is so versatile!  I've made it minty with flavoring. I've used nuts and marshmellows for a rocky road fudge."
  },
  {
    "_id": 1578,
    "recipe_id": 1408,
    "user_id": 1654,
    "user": "Paula Maguire",
    "Rating": 5,
    "Review": "3 medium onions made a very tasty part of a meal for 3 persons. The recipe ingredients reads \"20 butter\" and \"onions\" but doesn't say  how many.  I used about a 1/2 C. butter and 3 medium onions & it worked out fine and the cooking time seemed to be the right time.  3 med. onions would serve 4 people. They would be really yummy atop a thick juicy filet mignon! In factI believe that this recipe could be included with a large number of meals of various types."
  },
  {
    "_id": 1579,
    "recipe_id": 1409,
    "user_id": 1657,
    "user": "cwambeam",
    "Rating": 5,
    "Review": "This is the best eggnog I have ever had.  It's good with fat-free half & halftoo.  The writer suggested Jack Daniels might be good in itbut it is especially good with 1/2 cup of light rum (preferably Bacardi) and 1/2 cup of Crown Royal.  Delicious!"
  },
  {
    "_id": 1580,
    "recipe_id": 1411,
    "user_id": 1659,
    "user": "WisTex",
    "Rating": 5,
    "Review": "This recipe was great! In order to make the recipe even easierI substituted the sweet potatoes with canned sweet potatoes -- and it STILL came out good. The entire family loved itincluding the kidsand my sister and mother-in-law asked for the \"secret\" recipe."
  },
  {
    "_id": 1581,
    "recipe_id": 1414,
    "user_id": 1660,
    "user": "Mehitabel",
    "Rating": 4,
    "Review": "Delicious! And I was able to stretch the recipe to 4 cups of walnut halves with no problem. It takes about an hour from start to finishbut the coating needs to set a couple of hours in order for them not to stick together."
  },
  {
    "_id": 1582,
    "recipe_id": 1415,
    "user_id": 1662,
    "user": "Anne Edgell",
    "Rating": 5,
    "Review": "Absolutely Delightful Recipe! Rich and Flavorful!"
  },
  {
    "_id": 1583,
    "recipe_id": 1417,
    "user_id": 1664,
    "user": "Duane and Ginger Va",
    "Rating": 5,
    "Review": "this is a traditional dish my family has enjoyed on christmas eve for over 30 years. my mother passed away 2 years ago and it fell to me to keep the tradition going. i needed to recheck my memory and had a hard time finding this till i came across your site. many thanks and merry christmas"
  },
  {
    "_id": 1584,
    "recipe_id": 1420,
    "user_id": 1667,
    "user": "Binkie45",
    "Rating": 5,
    "Review": "My daughter and I made this bread over Christmas and it was wonderful.  We left out the fruit--the bread lasted almost one day--the aroma was awesome!!! Everyone that came by the day we were baking our Christmas goodies wanted to stick around until THAT bread was done.  We have already made another loaf.  Thanks for a great recipe."
  },
  {
    "_id": 1585,
    "recipe_id": 1423,
    "user_id": 1668,
    "user": "Medit",
    "Rating": 4,
    "Review": "There is no temperature given for baking these bars."
  },
  {
    "_id": 1586,
    "recipe_id": 1432,
    "user_id": 1670,
    "user": "Evans",
    "Rating": 5,
    "Review": "While on my first visit to Ireland in July 1999the birthplace of parentsmy cousin and I stopped in Doolen near the Cliffs of Mohr and had this marvelous dark Irish Beef Stew cooked in Guinness Stout\"  at O'Connors Pub.  It was absolutely delicous and the first authentic Irish meal we had and while all the food was great there was nothing that could beat the Irish Stew.  When I found the recipe on this siteI immediately tried it and it is exactly like what we had in Ireland.  When my cousin came to dinner and I served ithe was sure I had gotten the recipe from O'Connors Pub while we were in Ireland.  It was a cinch to makedirections were very easy to follow and it practically cooks itself.  It is equally as good over mashed potatoes or rice.  Try ityou'll like it. The one ingredient I added was a \"wee bit of blarney"
  },
  {
    "_id": 1587,
    "recipe_id": 1437,
    "user_id": 1671,
    "user": "Eduardo Maldonado",
    "Rating": 2,
    "Review": "The potatoes turned a very unappealing shade of gray.  Although they tasted ok once you got past the looksmy kids wouldn't eat them."
  },
  {
    "_id": 1588,
    "recipe_id": 1438,
    "user_id": 1672,
    "user": "W1xyz",
    "Rating": 4,
    "Review": "This is a very good basic recipe and I just thought I would add the variation that I took.  It being the day after Christmas I had a ham bone I needed to use and my son wanted lentil soup.  I just wanted to make something a little different so I surfed the web until I found this one that was nice and basic but I added the ham bone and skipped the hot dogsadded two potatoes and a can of diced tomatoes to make a very delicious soup.  Thanks for the basics,"
  },
  {
    "_id": 1589,
    "recipe_id": 1446,
    "user_id": 1673,
    "user": "Jay Grush",
    "Rating": 5,
    "Review": "very good!!!"
  },
  {
    "_id": 1590,
    "recipe_id": 1447,
    "user_id": 1675,
    "user": "Jim Weller",
    "Rating": 5,
    "Review": "We had these for Christmas dinner and they are great. I added a 1/2 tsp. or cinnamon and placed a whole walnut on each Ball. Easy and fast and they were a hit"
  },
  {
    "_id": 1591,
    "recipe_id": 1448,
    "user_id": 1676,
    "user": "Larry",
    "Rating": 2,
    "Review": "I'm sorrybut I tried this method for my Christmas turkey and the results just do not comapare with preparing a turkey the old-fashioned way . . . basting frequently in a roasting pan in a hot oven.  The turkey skin did not fully brown and the wings/legs had a distinct steamed texture.  This is an easier way of cooking a turkeybut sometimes easier is not better."
  },
  {
    "_id": 1592,
    "recipe_id": 1451,
    "user_id": 1677,
    "user": "Klaus Alexander Sei",
    "Rating": 1,
    "Review": "Blueberries sink to bottom of bundt pan and stick.  I had planned on giving these cakes as Christmas presentshowevergave up after three attempts.   No amount of greasing or flouring the pan seemed to help."
  },
  {
    "_id": 1593,
    "recipe_id": 1465,
    "user_id": 1678,
    "user": "Mary Lord",
    "Rating": 5,
    "Review": "Thank you for providing this recipe.  I'll let you know how the customer liked it."
  },
  {
    "_id": 1594,
    "recipe_id": 1505,
    "user_id": 1679,
    "user": "news.mercuryin.es",
    "Rating": 2,
    "Review": "I was expecting a simplistic recipe but instead was provided a recipe with ingredients that I have never heard of (Gruyere Cheese) and measurement values that require research (150 ml of milk).  I think the consideration should be made for those of us who are new to this internet age and they should keep in mind that the cookers of the household are middle aged women who are use to regular methods of measurement."
  },
  {
    "_id": 1595,
    "recipe_id": 1516,
    "user_id": 1680,
    "user": "Cathi Allen",
    "Rating": 1,
    "Review": "It is like rubber."
  },
  {
    "_id": 1596,
    "recipe_id": 1530,
    "user_id": 1681,
    "user": "nancy5",
    "Rating": 5,
    "Review": "This is the recipe I have used for many years.  It is so yummy.  It is easy to make and a treat to eat.  It is good for every day type bread and wonderful to give as a gift.  It is a favorite of my family."
  },
  {
    "_id": 1597,
    "recipe_id": 1533,
    "user_id": 1684,
    "user": "Katrina Streiff",
    "Rating": 0,
    "Review": "Goodbut I wished they were a bit more moist."
  },
  {
    "_id": 1598,
    "recipe_id": 1540,
    "user_id": 1689,
    "user": "Kevin Kirkland",
    "Rating": 4,
    "Review": "This is really good for a little something different.  Alsoyou may want to vary the mayonnaise by adding cream cheesea few chivesgarlic powder and maybe a few other spices occasionally.  But it is really fine just \"as is.\"  I really enjoyed this.  Thanks!"
  },
  {
    "_id": 1599,
    "recipe_id": 1541,
    "user_id": 1691,
    "user": "I Dunno",
    "Rating": 4,
    "Review": "This really is a great recipe. I substitute Chicken Broth for the water and at the end I add some cream (HeavyLight or Half & Half) just to add some creamy richness. Also for a special twist add some cooked baby shrimp (peeled & de-viened of course) 15-20 minutes before serving. And plenty of cracked Pepper and Soda Crackers :-) Enjoy."
  },
  {
    "_id": 1600,
    "recipe_id": 1552,
    "user_id": 1692,
    "user": "MP562",
    "Rating": 0,
    "Review": "I just found this recipebut I am going to bake itwould be great with a salad...."
  },
  {
    "_id": 1601,
    "recipe_id": 1557,
    "user_id": 3337,
    "user": "Erin Laddie",
    "Rating": 4,
    "Review": "It takes approximately 45 minutes to prepare meatballs & sauce. Serving size is approximately 38 meat balls. I used ground turkey instead of beef & came out much betterused fresh garlic & minced together with the onionsalso a dash of cajun & Itatilian seasonings made the meatballs a complete success."
  },
  {
    "_id": 1602,
    "recipe_id": 1560,
    "user_id": 4244,
    "user": "Danny Bennett",
    "Rating": 5,
    "Review": "I doubled this recipe for Christmas dinner 2000 and everyone came back for 2nd's and some even for 3rd's.   Very easy to make.  I increased the cooking time to 60 min's and put a extra cheese on top for the last 15 min. uncovered for a nice crust of baked cheese."
  },
  {
    "_id": 1603,
    "recipe_id": 1562,
    "user_id": 4242,
    "user": "marie m",
    "Rating": 5,
    "Review": "my family loved these.  fresher than any boughten poppers.  take some preparation timebut are well worth it."
  },
  {
    "_id": 1604,
    "recipe_id": 1565,
    "user_id": 1566,
    "user": "Stephen Little",
    "Rating": 0,
    "Review": "Try dipping or coating one side with some good chocolate... even better!!!"
  },
  {
    "_id": 1605,
    "recipe_id": 1576,
    "user_id": 3962,
    "user": "Erna House",
    "Rating": 1,
    "Review": "The recipe did not say to drain the juice from the pineapple and mandarin oranges and therefore it was very soupy!"
  },
  {
    "_id": 1606,
    "recipe_id": 1578,
    "user_id": 4200,
    "user": "LC Liu",
    "Rating": 5,
    "Review": "I received this \"hoax\" email forward about 4 years agobut never attempted the recipe. A friend of the family made it for us just a few weeks ago and it tastes incredible! I can't believe I held on to this recipe for so long!!"
  },
  {
    "_id": 1607,
    "recipe_id": 1580,
    "user_id": 4074,
    "user": "TJ Witt",
    "Rating": 5,
    "Review": "I made this recipe for Christmas and it was great!  The red and green coloring also made it festive-looking.  Itooleft out the bean sprouts and substituted cashews.  Even my picky Mother-in-law couldn't complain!!"
  },
  {
    "_id": 1608,
    "recipe_id": 1590,
    "user_id": 4190,
    "user": "leeann walker",
    "Rating": 5,
    "Review": "Excellent Pumpkin Rollvery tasty. I add Pecans ontop of cream cheese filling"
  },
  {
    "_id": 1609,
    "recipe_id": 1591,
    "user_id": 4312,
    "user": "Claude Santini",
    "Rating": 4,
    "Review": "Ravishing and delightfulvery easy to make."
  },
  {
    "_id": 1610,
    "recipe_id": 1593,
    "user_id": 4309,
    "user": "Beverly Kaplan",
    "Rating": 4,
    "Review": "This recipe was easily adapted as a sugar free recipe--substituting Nutrisweet for sugar--My diabetic husband loved it--Thank-you"
  },
  {
    "_id": 1611,
    "recipe_id": 1627,
    "user_id": 4329,
    "user": "melanie mcgackin",
    "Rating": 4,
    "Review": "AN extremely fast and easy to follow recipe! Though I did not add in the raisins or brandyI substituted drained crushed pineapple insteadturned out great. We served the dip with pineapple chunks and poundcake. Add in extra chocolate chips for sweetness!"
  },
  {
    "_id": 1612,
    "recipe_id": 1630,
    "user_id": 4335,
    "user": "Tiina",
    "Rating": 0,
    "Review": "great recipe its delicious"
  },
  {
    "_id": 1613,
    "recipe_id": 1636,
    "user_id": 4336,
    "user": "Marquise Patton",
    "Rating": 5,
    "Review": "This recipe is so easy I usually make two at a time. Not only does it taste greatbut I make them and put into the freezer to use at a church circleclub meetingor for friends who just happen to drop by.  I always try to keep at least one in the freezer."
  },
  {
    "_id": 1614,
    "recipe_id": 1638,
    "user_id": 4340,
    "user": "Doug Thompson",
    "Rating": 0,
    "Review": "Concerning handling chili peppersit really is unnecessary to use gloves."
  },
  {
    "_id": 1615,
    "recipe_id": 1660,
    "user_id": 4203,
    "user": "Amy12583",
    "Rating": 5,
    "Review": "I have had a hashbrown casserole similar to this as wellbut never got the recipe.  I am curious as how much sour cream should you put in then.  Thanks."
  },
  {
    "_id": 1616,
    "recipe_id": 1693,
    "user_id": 4317,
    "user": "Kay Abbott",
    "Rating": 3,
    "Review": "This is a traditional way of making english bread pudding - but i live in Texas - does anyone know what they call suet in Texas? someone told me they only use it for birdseed???"
  },
  {
    "_id": 1617,
    "recipe_id": 1699,
    "user_id": 4240,
    "user": "Christine Cipullo",
    "Rating": 0,
    "Review": "Have not tried this yetwas looking for crock-pot recipesbut Chicken Cacc. is one of my family's favorites and  it absolutely has to have red wine in itand green peppers."
  },
  {
    "_id": 1618,
    "recipe_id": 1716,
    "user_id": 4353,
    "user": "Judith Boncaro",
    "Rating": 3,
    "Review": "This is only a low sodium recipe if you completely omit the salt - just use a little more pepperor some garlic powder."
  },
  {
    "_id": 1619,
    "recipe_id": 1721,
    "user_id": 4353,
    "user": "Judith Boncaro",
    "Rating": 0,
    "Review": "Since 3 oz of anchovies contains 425 mg of sodiumI would guess that 2 anchovy fillets contain about 150 mg of sodium."
  },
  {
    "_id": 1620,
    "recipe_id": 1722,
    "user_id": 1694,
    "user": "MaxinePeter",
    "Rating": 5,
    "Review": "It was totally tasty dudes"
  },
  {
    "_id": 1621,
    "recipe_id": 1725,
    "user_id": 1697,
    "user": "Alan1",
    "Rating": 5,
    "Review": "Aren't there 6 or seven stars to choose from.  WOW!  I was so excited to see this recipe.  I absolutely loved this soup when my husband and I would go to Famous Barr 30 yearswhen he was in the seminary at Concordia St. Louis.  I have made it through the yearsbecause an aunt had sent me the recipe from her local SpringfieldIL newspaper about 20 years.  Once I lost itbut a friend retrieved it for me from the time she had asked me for it.  What I love about your site is the instant way to double or triple or whatever the recipe!  I make this recipe a number of times each yearbut I always make it for a big Christmas Party we have.  Everyone loves it and looks forward to it each year!  Thanks so much!  I always serve it with homemade bread and a Ceasar Salad.  I look forward to your newsletters."
  },
  {
    "_id": 1622,
    "recipe_id": 1731,
    "user_id": 1698,
    "user": "CeeDee",
    "Rating": 5,
    "Review": "I haven't tried it yetbut when I do I will use cherry cola"
  },
  {
    "_id": 1623,
    "recipe_id": 1746,
    "user_id": 1702,
    "user": "Alison Corfield",
    "Rating": 4,
    "Review": "I found this recipe to be very goodbut only gave it four stars as it called for (in my opinion) way too much celery and onions.  I cut the onions back to 1/2 cup and the celery to 1 cup.  I also added 1/3 cup grated carrots. My husband loved it!"
  },
  {
    "_id": 1624,
    "recipe_id": 1750,
    "user_id": 1704,
    "user": "HELEN PEAGRAM_40951",
    "Rating": 5,
    "Review": "I substituted the green bell pepper with red and it was wonderful."
  },
  {
    "_id": 1625,
    "recipe_id": 1753,
    "user_id": 1715,
    "user": "The Fradys",
    "Rating": 5,
    "Review": "Another great way to make this recipe is to put all the ingredients inside the flattened biscuit and then deep fry them this is a real pleaser any time in my house. This recipe is very easy and fun to make I hope to find some more fun recioes soon!"
  },
  {
    "_id": 1626,
    "recipe_id": 1760,
    "user_id": 1717,
    "user": "JonquilJan",
    "Rating": 0,
    "Review": "This dish has been in homes across the south for as long as I can remember. Sometimes a little onion is added to the mixture. Goes great with any meal."
  },
  {
    "_id": 1627,
    "recipe_id": 1771,
    "user_id": 1719,
    "user": "Dorothy1",
    "Rating": 4,
    "Review": "Very simple to make. there were no strange ingredents or a big mess. taste justlike my moms. very down home"
  },
  {
    "_id": 1628,
    "recipe_id": 1773,
    "user_id": 1721,
    "user": "Denise3",
    "Rating": 5,
    "Review": "This is a great basic potato soup receipe!  I used two cups of half & half in place of two cups of milkand added 1/2 pound of cooked bacon plus two tbls. parsley. I took out the cheese to add the half & half!"
  },
  {
    "_id": 1629,
    "recipe_id": 1778,
    "user_id": 1722,
    "user": "Jacqui Jones",
    "Rating": 1,
    "Review": "I believe there is a mistake in the amount of eggnog listed in this recipe...5 1/2 cups is too much and the batter overflows a 9x5"
  },
  {
    "_id": 1630,
    "recipe_id": 1797,
    "user_id": 1723,
    "user": "Sergio  Dorothy G P",
    "Rating": 5,
    "Review": "Made it for daughter's weddinga GREAT hit!!"
  },
  {
    "_id": 1631,
    "recipe_id": 1809,
    "user_id": 1724,
    "user": "goblait",
    "Rating": 4,
    "Review": "I made this dessert for a formal English Christmas dinner.  I did receive nothing but raves!  It was delicious and beautiful. As a matter of facta friend told me it was better than her friend'swho happens to be English.  I especially liked it because it did not call for a pudding mixbut rather a custard from scratchwhich was as easy to make as from a box. It was not difficult to make at all.  I also added frozen berries as well as the strawberrieswhich seemed to only enhance the flavors."
  },
  {
    "_id": 1632,
    "recipe_id": 1824,
    "user_id": 1727,
    "user": "Laniakea",
    "Rating": 5,
    "Review": "Outstanding"
  },
  {
    "_id": 1633,
    "recipe_id": 1825,
    "user_id": 1728,
    "user": "Philip and Karen Se",
    "Rating": 5,
    "Review": "Ilove this recipe ,it is so easy when you have kids. Just mix and serve."
  },
  {
    "_id": 1634,
    "recipe_id": 1826,
    "user_id": 1730,
    "user": "Lintons Seafood",
    "Rating": 5,
    "Review": "I made these muffins to give in my Christmas gift packages. Everyone loved themand including myself. I followed the recipe exactlyand they were easy to make."
  },
  {
    "_id": 1635,
    "recipe_id": 1832,
    "user_id": 1732,
    "user": "David Greene",
    "Rating": 4,
    "Review": "it can be made in 15 min.and i bake mine in 25 min."
  },
  {
    "_id": 1636,
    "recipe_id": 1835,
    "user_id": 1735,
    "user": "Tracey Kehne",
    "Rating": 0,
    "Review": "I need to try this.....This is typical recipe from my Mother's side of the family. \"use this much\" i can not see this much on the phone."
  },
  {
    "_id": 1637,
    "recipe_id": 1841,
    "user_id": 1736,
    "user": "jinx3218",
    "Rating": 4,
    "Review": "This was a very refreshing salad. It''s not time consuming and ingredients were simple. My husband and I are enjoying eating lighter and healthier meals and this one is excellent! Thank You..."
  },
  {
    "_id": 1638,
    "recipe_id": 1857,
    "user_id": 1737,
    "user": "Teddi2",
    "Rating": 0,
    "Review": "Is it possible to rate a recipe MINUS five stars?  I'm in a pinchI log on to find some quick and easy app. recipesand this is what I get.  You people should call yourselves \"recipizarre.com\"  Thanks for being no help at all.  It wasn't even that funny."
  },
  {
    "_id": 1639,
    "recipe_id": 1870,
    "user_id": 1739,
    "user": "Kathleen Wiseman",
    "Rating": 5,
    "Review": "Great recipe!  Several changes might help thicken the soup a bit.  I used half and half instead of plain milk.  Also1 tsp. corn starch mixed with hot water helped to thicken. I added some small cubes of potato and some celery. This makes the soup complete."
  },
  {
    "_id": 1640,
    "recipe_id": 1878,
    "user_id": 1742,
    "user": "Joel Schwarz",
    "Rating": 2,
    "Review": "Thai soup without lemon grass??....don't think so"
  },
  {
    "_id": 1641,
    "recipe_id": 1883,
    "user_id": 1743,
    "user": "Robin Cowdrey",
    "Rating": 4,
    "Review": "I used olive oil instead of lard {I didnt have any in the house} and I only used 1 onion. I think it tuned out great. Thanks for the recipeand I hope to hear from you soon."
  },
  {
    "_id": 1642,
    "recipe_id": 1887,
    "user_id": 1746,
    "user": "Mr. Bill",
    "Rating": 4,
    "Review": "wasn't that bad ??????? why do the always make the chicken so big in the market place."
  },
  {
    "_id": 1643,
    "recipe_id": 1889,
    "user_id": 1747,
    "user": "Gloria Reyes",
    "Rating": 5,
    "Review": "It was a great dish my family loved it I couldn't make as much as I wanted to but I got it finished"
  },
  {
    "_id": 1644,
    "recipe_id": 1891,
    "user_id": 1749,
    "user": "Pam Wood",
    "Rating": 5,
    "Review": "delicious desserta little hard to make when you need something for the same day. Maybe you can find a faster and easier version of this same dessert."
  },
  {
    "_id": 1645,
    "recipe_id": 1902,
    "user_id": 1751,
    "user": "Jjortikka",
    "Rating": 4,
    "Review": "I finally found the recipe for \"Chow Chow Pickles\"."
  },
  {
    "_id": 1646,
    "recipe_id": 1923,
    "user_id": 1754,
    "user": "mark anderson",
    "Rating": 4,
    "Review": "I am a true chocolate pie lover.  I cooked the pie as directed using one deep dish 9\" pie pan and a ready made refrigerated pie crust (next time I will make it with my own crust).  The filling sliced very well and yet it was creamy and delicious.  I made the meringue using the 2 egg whites from the eggs used in the fillingadding 1/4 tsp of cream of tartar and 3 tbsp of sugarand then baking at 400 degrees until golden.  Over all very good."
  },
  {
    "_id": 1647,
    "recipe_id": 1940,
    "user_id": 1756,
    "user": "Stacy L Volpe",
    "Rating": 5,
    "Review": "very healthy scone  great web site thank you ii  have 2 tennage girls so they are into recipes ok thanks once a gain"
  },
  {
    "_id": 1648,
    "recipe_id": 1945,
    "user_id": 1760,
    "user": "Cheryl Thebeau-Blev",
    "Rating": 4,
    "Review": "Very good but not a 5 star"
  },
  {
    "_id": 1649,
    "recipe_id": 1947,
    "user_id": 1761,
    "user": "Moe Martin",
    "Rating": 4,
    "Review": "Very good receipe. The taste is great!"
  },
  {
    "_id": 1650,
    "recipe_id": 1955,
    "user_id": 1762,
    "user": "lkadlec",
    "Rating": 5,
    "Review": "When I was a boy in the 1930s my brother and I would catch bull frogs and father would dispatch and prepare themwe also picked wild button and shaggy main mushroomscleaned all and fried in butterserved on toast and devoured."
  },
  {
    "_id": 1651,
    "recipe_id": 1967,
    "user_id": 1763,
    "user": "Gregg",
    "Rating": 3,
    "Review": "Apparently I got the wrong pork chops for this receipe!!!  I only cooked for 1 1/2 hrs and they were way to dry...if I had cooked for 2 they would have been hockey pukes!!!  The taste was goodbut I would diffently watch the time and cooking of the chops. Maybe just an hourcovered."
  },
  {
    "_id": 1652,
    "recipe_id": 1968,
    "user_id": 1765,
    "user": "STEVE BEDELL",
    "Rating": 5,
    "Review": "I skipped the bread bowls and used fresh italian parsleya little rosemary and thymeand it was great.  Left it chunky too."
  },
  {
    "_id": 1653,
    "recipe_id": 1970,
    "user_id": 1771,
    "user": "Joanne Wallace",
    "Rating": 5,
    "Review": "Great recipe for anyone who like it as close as it come to the real thing! Very simple to make and you can find all the ingredents in your local supermarket! I myself would cut back on the white pepper and add a little bit of hot oil (not to much)! I would also add about 1 1/2 tbls more of vineger. (or to taste) add a little more meat and you can serve with a bowl of white rice with steamed veggies for a meal of its own."
  },
  {
    "_id": 1654,
    "recipe_id": 1975,
    "user_id": 3794,
    "user": "Sally Wolfe",
    "Rating": 5,
    "Review": "My husband and I simply loved this soup. I added half a medium onion to mineand put in four cloves of garlic instead of two. We sprinkled shredded mozzarella cheese on ours before enjoying."
  },
  {
    "_id": 1655,
    "recipe_id": 1978,
    "user_id": 3253,
    "user": "l.lahn",
    "Rating": 2,
    "Review": "This cake didn't rise much.  Also the temperature of 350F. is too high.  The cake burnedpossibly because I used a teflon coated cake pan.  I did turn heat down to 325 but the damaged was already done."
  },
  {
    "_id": 1656,
    "recipe_id": 1981,
    "user_id": 5014,
    "user": "Shelly Head",
    "Rating": 5,
    "Review": "This recipe was simple to make and easy to convert to serve more people.  I like the fact that the ingredients are those usually found in someones pantry and that preparation time was 10 minutes or less to combine and could be left alone in the oven to cook.  Wish all recipes were this easy and delicious.  I will definetly add this to my keeper list."
  },
  {
    "_id": 1657,
    "recipe_id": 1999,
    "user_id": 5148,
    "user": "R Schlei",
    "Rating": 4,
    "Review": "A fantastic version - very fragrant and complex taste.  Highly recommended for those who like spicy eggplant."
  },
  {
    "_id": 1658,
    "recipe_id": 2002,
    "user_id": 2695,
    "user": "Hungarian Gypsy",
    "Rating": 1,
    "Review": "This recipe needs a little help !"
  },
  {
    "_id": 1659,
    "recipe_id": 2013,
    "user_id": 2695,
    "user": "Hungarian Gypsy",
    "Rating": 5,
    "Review": "This dish was excellent.  The sauce turned out wonderful and was an excellent choice for the pork chops !"
  },
  {
    "_id": 1660,
    "recipe_id": 2015,
    "user_id": 4564,
    "user": "mary sharp",
    "Rating": 5,
    "Review": "this is wonderful very easy but i used cooked pudding. has more lemon pie taste"
  },
  {
    "_id": 1661,
    "recipe_id": 2019,
    "user_id": 5199,
    "user": "Karen Fink",
    "Rating": 1,
    "Review": "I think this was the most awfulest punch I have ever tasted hope someone else has better luck!!!!!"
  },
  {
    "_id": 1662,
    "recipe_id": 2020,
    "user_id": 5203,
    "user": "Beverly Balkwell",
    "Rating": 4,
    "Review": "This recipe makes a 2 pound loaf. I used the white bread setting (3 hrs). The loaf was beautifultexture was good. The only thing was my machine destroyed the cherries ( I added them as stated in recipe)."
  },
  {
    "_id": 1663,
    "recipe_id": 2027,
    "user_id": 5264,
    "user": "danny sayre",
    "Rating": 4,
    "Review": "very easy to make,about 5 minutes. the recipe made 9 pancakes 6 inchs round fluffy very light. I was pleased that butter and syrup didn't \"water log\" the cakes. You could add any fruit in this recipe. Overall these were the best I've ever made.  thank you dansa111"
  },
  {
    "_id": 1664,
    "recipe_id": 2029,
    "user_id": 5280,
    "user": "Anita Novotny",
    "Rating": 4,
    "Review": "This casserole was very tasty but a little time consuming to prepare. Next time I know we are going to have this dish (and we definitally will be having it again) I will do the prep work ahead of time."
  },
  {
    "_id": 1665,
    "recipe_id": 2057,
    "user_id": 5285,
    "user": "Michael Dahlquist",
    "Rating": 3,
    "Review": "It's between three and four starsreally. Easy to make and good tastin'. It's stick-to-your-ribs stuffit's like chicken paellaand that's pretty good. I am glad I made itI will make it againit will be my lunch for the next three weeks."
  },
  {
    "_id": 1666,
    "recipe_id": 2066,
    "user_id": 5142,
    "user": "Catcooks123",
    "Rating": 4,
    "Review": "I wanted a new way to prepare thick pork chops for my family ,and this was really good. I used Lawerys season salt instead of accentand salt. The gravy smelled a little like a marsala sauce. The meat was so tender this wayso much better than dried out broiled thick pork chops."
  },
  {
    "_id": 1667,
    "recipe_id": 2072,
    "user_id": 5328,
    "user": "Janie Woodall",
    "Rating": 5,
    "Review": "I used Cream of chicken instead of mushroom and it was wonderful !!! My whole family loved it !!"
  },
  {
    "_id": 1668,
    "recipe_id": 2075,
    "user_id": 4884,
    "user": "Carmen",
    "Rating": 5,
    "Review": "Baklava is in fact Greek..I moved from Greece a little over 3 years ago and therefore your feeble-minded Turkish opinion means nothing."
  },
  {
    "_id": 1669,
    "recipe_id": 2078,
    "user_id": 5227,
    "user": "rhonda lambert",
    "Rating": 4,
    "Review": "my family like the bamboo shoots whole. but we love your recipe"
  },
  {
    "_id": 1670,
    "recipe_id": 2080,
    "user_id": 5227,
    "user": "rhonda lambert",
    "Rating": 4,
    "Review": "the lemon rind made it tastier. great recipe"
  },
  {
    "_id": 1671,
    "recipe_id": 2086,
    "user_id": 3858,
    "user": "Vicki Summers",
    "Rating": 4,
    "Review": "No kidding - stir almost constantly. We really liked it. Warmed well in the microwave."
  },
  {
    "_id": 1672,
    "recipe_id": 2087,
    "user_id": 5357,
    "user": "Jeanne H",
    "Rating": 5,
    "Review": "This is the best way to serve shoepeg corn there is...we make the same recipe but use two cans of the shoepeg cornand no beans.  It's yummy for Thanksgiving."
  },
  {
    "_id": 1673,
    "recipe_id": 2088,
    "user_id": 5355,
    "user": "Rena Reeve",
    "Rating": 5,
    "Review": "I made this bread with a little milk (instead of dry milk) and a little coffee (instead of instant).  AlsoI made it using my mixer with dough hook instead of a bread machine.  It worked very well.  Best pumpernickel I have tasted!"
  },
  {
    "_id": 1674,
    "recipe_id": 2092,
    "user_id": 5420,
    "user": "Andrew Murray",
    "Rating": 2,
    "Review": "Why do you have to bake pork chops,this is a B.B.Q recipe. Depending on the size and the amount of time to marinate,they shouldn't be more than 15-20 minutes on the B.B.Q"
  },
  {
    "_id": 1675,
    "recipe_id": 2101,
    "user_id": 5090,
    "user": "Marcia Detrick",
    "Rating": 5,
    "Review": "Just the type recipe I came to this site for. I am going to take this to a Super Bowl party on Sunday"
  },
  {
    "_id": 1676,
    "recipe_id": 2104,
    "user_id": 4925,
    "user": "christine story",
    "Rating": 5,
    "Review": "We really like this dipit''s creamy & tasty.  I added a little more green onions (including the tops)& some garlic powder (I put that in just about everything that I think it would add a little more zingplus it''s good for you)."
  },
  {
    "_id": 1677,
    "recipe_id": 2109,
    "user_id": 5398,
    "user": "gary gierloff",
    "Rating": 5,
    "Review": "if you love clams and garlic you will love this recipe. I plan to make large quanties for the upcoming superbowl party at the hitchin post in salem oregon.go ravens."
  },
  {
    "_id": 1678,
    "recipe_id": 2110,
    "user_id": 5385,
    "user": "Cristina Stanfill",
    "Rating": 3,
    "Review": "Be aware that this is the EXACT recipe that is printed in the booklet that comes with a new crockpot."
  },
  {
    "_id": 1679,
    "recipe_id": 2111,
    "user_id": 5471,
    "user": "Olivia Cato",
    "Rating": 3,
    "Review": "It was pretty goodbut then again I was really hungry.  Needs more chicken and more cheese."
  },
  {
    "_id": 1680,
    "recipe_id": 2112,
    "user_id": 5461,
    "user": "Sarah Stluka",
    "Rating": 5,
    "Review": "This casserole is the best I have ever had.  My grandmother makes it for Christmas every year and I just had to have the recipe."
  },
  {
    "_id": 1681,
    "recipe_id": 2113,
    "user_id": 5049,
    "user": "Cynthia Caffey Schw",
    "Rating": 4,
    "Review": "This is easy and very good.  Our family loved it."
  },
  {
    "_id": 1682,
    "recipe_id": 2118,
    "user_id": 5049,
    "user": "Cynthia Caffey Schw",
    "Rating": 3,
    "Review": "This was easy to makebut when mashing the potatoes and garlicbe sure to get the garlic mashed.  It is hard to find it in the potatoesso you need to mash it all well.  The taste is subtlebut true.  You may want to add a little more butter and salt."
  },
  {
    "_id": 1683,
    "recipe_id": 2120,
    "user_id": 1773,
    "user": "Malarkey Test",
    "Rating": 3,
    "Review": "this was okay.  too greasy for my tastes."
  },
  {
    "_id": 1684,
    "recipe_id": 2121,
    "user_id": 4105,
    "user": "Bill de Bruler",
    "Rating": 4,
    "Review": "I would rate this one a five-star if the hot pepper flakes were omitted. I would omit the hot pepper flakes and use 3 cans of tomatoes and add 1 can of tomato and green chile's. Also for the next time I prepare the recipe I will devein and shell the shrimp then sprinkle cajun spice mix and let the shrimp marinate in it. If anyone attempts this recipe and uses 1/4 cup of the hot pepper flakes you will probably not be able to eat it if you cannot handle hot and spicy food. Believe me I am an amateur Cajun Chef and I could eat the dish but most people could not handle it. I will make this dish because it is rather quick and it is a one dish meal. I will however change it as stated in the beginning of this comment/rating."
  },
  {
    "_id": 1685,
    "recipe_id": 2126,
    "user_id": 5446,
    "user": "Fedelma Dixon",
    "Rating": 3,
    "Review": "No vanilla?  No butter?  Wasn't sure what to do about thatbut the pie is good."
  },
  {
    "_id": 1686,
    "recipe_id": 2130,
    "user_id": 3856,
    "user": "jonathan armytage",
    "Rating": 3,
    "Review": "average taste. Not particularly subtle"
  },
  {
    "_id": 1687,
    "recipe_id": 2131,
    "user_id": 5049,
    "user": "Cynthia Caffey Schw",
    "Rating": 5,
    "Review": "First of allI used a 4 pound pork tenderloininstead of 1 pound.  It took 1 hour to bakeso not much longer and was 170 degrees inside.  NextI didn't have the time to marinade overnightso I used garlic powder and marinaded for about 20 minutes.  It turned out wonderful.  Probably the best pork we have had.  It was tendermoist and flavorful.  I also substituted black pepper for white pepper."
  },
  {
    "_id": 1688,
    "recipe_id": 2141,
    "user_id": 5235,
    "user": "LJ S3213",
    "Rating": 4,
    "Review": "absolutely fabulousreceived high praise from family members."
  },
  {
    "_id": 1689,
    "recipe_id": 2165,
    "user_id": 5355,
    "user": "Rena Reeve",
    "Rating": 0,
    "Review": "I recommend this recipe because I've eaten these muffins many times.  These muffins taste great heated in the micro and then covered with natural applesauce.  A little cinnamon sugar on top makes it the perfect breakfast treat!"
  },
  {
    "_id": 1690,
    "recipe_id": 2169,
    "user_id": 5484,
    "user": "Deidre Gilbert",
    "Rating": 5,
    "Review": "After extensive research on turkey soup recipesyou were my first choice.  Now your turkey soup has become \"Deidre's famous turkey soup\".  I have a stomach condition that requires soup on a daily basis and having previously not liked soupthis was a difficult step for me.  But your recipe has converted me into a soup lover.  It works great for chicken too.  Thank you for adding spicesherbs and FLAVOUR to your recipe.  It really is different and great tasting.  Your efforts to get this out to people like me is very much appreciated."
  },
  {
    "_id": 1691,
    "recipe_id": 2196,
    "user_id": 5495,
    "user": "annaclaire crocco",
    "Rating": 4,
    "Review": "great when sprinkled with grated parmasaen cheese just before serving!"
  },
  {
    "_id": 1692,
    "recipe_id": 2209,
    "user_id": 1773,
    "user": "Malarkey Test",
    "Rating": 4,
    "Review": "interesting. i added celery and some cilantro.  i think i made it a bit too hot though."
  },
  {
    "_id": 1693,
    "recipe_id": 2216,
    "user_id": 5503,
    "user": "Jules Yoken",
    "Rating": 0,
    "Review": "Sounds a bit like Bigos"
  },
  {
    "_id": 1694,
    "recipe_id": 2218,
    "user_id": 5285,
    "user": "Michael Dahlquist",
    "Rating": 3,
    "Review": "Basicsimple - but it's goodand taught me a thing or two about making good thai (?) soup - never cooked with lemon grassbut it was yummy. Simple to make and wholesome and creamy without dairyI'd forgotten the charms of coconut milk."
  },
  {
    "_id": 1695,
    "recipe_id": 2221,
    "user_id": 5519,
    "user": "amity bradley",
    "Rating": 5,
    "Review": "My boyfriend and i were very pleased with this recipe. he is half chinese so he knows the good stuff. the only thing we changed was the amount of chili paste. we only put one tablespoon instead of 2. the soup is very very spicy with 2 tblsp's. other than that it was great. the flavor is awesome. my boyfriend said that it tasted just like his mom's. that is a great compliment."
  },
  {
    "_id": 1696,
    "recipe_id": 2255,
    "user_id": 5681,
    "user": "ravindra mandagere",
    "Rating": 3,
    "Review": "the baking time of 1 hour at 300 degrees plus"
  },
  {
    "_id": 1697,
    "recipe_id": 2264,
    "user_id": 5683,
    "user": "Patricia Fitzgerald",
    "Rating": 4,
    "Review": "Suggestion:  Subsitiution for bread crumbs. You can also use Cereal(corn-flakes)Crackers,and sometimes you can use Corn chips to."
  },
  {
    "_id": 1698,
    "recipe_id": 2265,
    "user_id": 5689,
    "user": "Berevaline Windsor",
    "Rating": 5,
    "Review": "Wow!!!  Egyptian food!!!  Cool!!!"
  },
  {
    "_id": 1699,
    "recipe_id": 2325,
    "user_id": 5686,
    "user": "Mariya Davis",
    "Rating": 5,
    "Review": "The dish is wonderful! It so easy to makeit takes 15-20 min :). Also I like to serve it with butter and sour cream. Everytime I cook Spaetzle my husband ask if there anything is left. ThoughI always cook more. Tryand you''ll see how easy and delicious it is!"
  },
  {
    "_id": 1700,
    "recipe_id": 2333,
    "user_id": 5704,
    "user": "Francesca Tabaranza",
    "Rating": 4,
    "Review": "Variationinstead of vinegar use freshly squeezed lemon juice."
  },
  {
    "_id": 1701,
    "recipe_id": 2336,
    "user_id": 5523,
    "user": "Dave C",
    "Rating": 4,
    "Review": "This looks good. My grandkids will love me. thanks.  :>))"
  },
  {
    "_id": 1702,
    "recipe_id": 2337,
    "user_id": 1872,
    "user": "Lisa Rittel",
    "Rating": 5,
    "Review": "I have had this before. It has really good flavor!Be sure to use salted pretzelsthey really make the dish good."
  },
  {
    "_id": 1703,
    "recipe_id": 2361,
    "user_id": 1873,
    "user": "Leslie Ashenfelter",
    "Rating": 5,
    "Review": "It was delicious. And very easy too. Even a little kid could make it."
  },
  {
    "_id": 1704,
    "recipe_id": 2364,
    "user_id": 1886,
    "user": "HELEN PEAGRAM",
    "Rating": 5,
    "Review": "It was DELICIOUS and so easy too. My six year old niece even made it herself. It is such a healthy snack."
  },
  {
    "_id": 1705,
    "recipe_id": 2373,
    "user_id": 1887,
    "user": "Vicky Sinclair",
    "Rating": 5,
    "Review": "Hello!  My family used to use chicken feet in our soup and it was wonderful.  I was raised on a grain and dairy farmwe raised everythingprocessed our own meatcanned all our own vegetables etc.  It's so nice to come across all these wonderful recipes.  June Bug"
  },
  {
    "_id": 1706,
    "recipe_id": 2384,
    "user_id": 1889,
    "user": "spam4409",
    "Rating": 0,
    "Review": "I had a Great Aunt that made the most wonderful dill pickles she told me that her secret was that she used rain water.  How interesting.  June Bug"
  },
  {
    "_id": 1707,
    "recipe_id": 2386,
    "user_id": 1893,
    "user": "Pam Whitmire",
    "Rating": 5,
    "Review": "As a helper of a girl scout troopone of a projects to earn a badge was to prepare an ethnic meal.  We chose and Italian meal and for dessert we chose these cookies.  The girls really enjoyed making and EATING them.  We got about 5 1/2 dozen cookies from a batch.  Thanks for a really wonderful and delicious recipe."
  },
  {
    "_id": 1708,
    "recipe_id": 2387,
    "user_id": 2178,
    "user": "troyh",
    "Rating": 5,
    "Review": "awesome....kids loved it!!!!!"
  },
  {
    "_id": 1709,
    "recipe_id": 2388,
    "user_id": 10033,
    "user": "spatchcock",
    "Rating": 0,
    "Review": "This is a great recipe that's too easy."
  },
  {
    "_id": 1710,
    "recipe_id": 2393,
    "user_id": 22015,
    "user": "Mysterygirl",
    "Rating": 4,
    "Review": "This recipe was very easy to makeand it turned out great! The cooking temperature was not specifiedso I used 350 degrees. AlsoI subbed low fat ricotta cheese for cottage cheese because I prefer the taste."
  },
  {
    "_id": 1711,
    "recipe_id": 2405,
    "user_id": 25843,
    "user": "Crab Place",
    "Rating": 5,
    "Review": "Easy to follow recipe.  Wonderful taste. Had no problems with cake or blueberrys sticking to pan."
  },
  {
    "_id": 1712,
    "recipe_id": 2420,
    "user_id": 28729,
    "user": "Auntie Jan",
    "Rating": 5,
    "Review": "I haven't made this as yettoday is Feb. 18,2001but I boiled the carcass of a turkey and the ingredients you have listed just fit us to a tee.  I just happened on this site looking for a quickeasytasty soup.  I am rating it even though I haven't tasted it yet.  I can just tell by the ingredients. I would serve it with crusty bread and a nice light white wine.  Preferably Gallo's white Zinfandel.  Nice going!!"
  },
  {
    "_id": 1713,
    "recipe_id": 2422,
    "user_id": 34879,
    "user": "Barefoot Beachcomber",
    "Rating": 4,
    "Review": "I have made these and they are deliciousI also have made them with the Cherry"
  },
  {
    "_id": 1714,
    "recipe_id": 2425,
    "user_id": 35526,
    "user": "riffraff",
    "Rating": 4,
    "Review": "We cut up some chorizo (instead of andouille) and put it into the sauceand used it on chicken. It was greatbut with a salty sausage like chorizousing the recommended amount of salt in the recipe was a little too much. I would definitely reccomend this for anyone who loves barbeque!"
  },
  {
    "_id": 1715,
    "recipe_id": 2438,
    "user_id": 35635,
    "user": "_Pixie_",
    "Rating": 2,
    "Review": "Wayway too lemony.  I ate about half of my meal and vowed never to eat anything with lemon in it again.  I marinated overnight...  Bad idea!  I imagine this recipe could be great with a little tweaking."
  },
  {
    "_id": 1716,
    "recipe_id": 2441,
    "user_id": 39194,
    "user": "OzMan",
    "Rating": 2,
    "Review": "I love Red Lobster caesar salad dressing.  I have looked the net over to find a recipe that tastes like it.  This recipe is alrightbut to me still tastes NOTHING like Red Lobster's caesar dressing.  Guess I'll keep looking."
  },
  {
    "_id": 1717,
    "recipe_id": 2450,
    "user_id": 39547,
    "user": "Julesong",
    "Rating": 4,
    "Review": "Add a drop or two of Tabasco sauce to each one to give them a little kick.  I put the Tabasco sauce on top of the cream cheese layer.  Try ityou'll like it."
  },
  {
    "_id": 1718,
    "recipe_id": 2456,
    "user_id": 39636,
    "user": "Chrissyo",
    "Rating": 4,
    "Review": "very good,easy to follow"
  },
  {
    "_id": 1719,
    "recipe_id": 2460,
    "user_id": 47510,
    "user": "Dreamgoddess",
    "Rating": 4,
    "Review": "This was easy to make and very YUMMY!"
  },
  {
    "_id": 1720,
    "recipe_id": 2462,
    "user_id": 51011,
    "user": "Loves2Teach",
    "Rating": 5,
    "Review": "This is a great recipe....It didn't take too much time to prepare and the final results were delicious!"
  },
  {
    "_id": 1721,
    "recipe_id": 2468,
    "user_id": 51109,
    "user": "Vina7737",
    "Rating": 2,
    "Review": "I thought the gingerstar anise and parsnips are some of the most important ingredients in the soup.  I have read the recipe many times to find out when to add those ingredients.  No luck.  Can't find it."
  },
  {
    "_id": 1722,
    "recipe_id": 2479,
    "user_id": 52448,
    "user": "PetsRus",
    "Rating": 5,
    "Review": "i thought that this was really really yummy."
  },
  {
    "_id": 1723,
    "recipe_id": 2484,
    "user_id": 55166,
    "user": "peppermintkitty",
    "Rating": 4,
    "Review": "This was really goodhoweverI left out the turnips due to a family memebers dislikebut added 2 tblsp of worshirer sauce. YUM!!!"
  },
  {
    "_id": 1724,
    "recipe_id": 2490,
    "user_id": 56112,
    "user": "Jellyqueen",
    "Rating": 0,
    "Review": "I would just like to say that this recipe comes from the cookbookThe Complete Soy Cookbookby Paulette Mitchell."
  },
  {
    "_id": 1725,
    "recipe_id": 2514,
    "user_id": 64203,
    "user": "Dine  Dish",
    "Rating": 0,
    "Review": "This is a great recipe! Try serving with hollandaise sauce."
  },
  {
    "_id": 1726,
    "recipe_id": 2709,
    "user_id": 1530,
    "user": "Carole Reu",
    "Rating": 5,
    "Review": "better than any you can get at a restaurant!"
  },
  {
    "_id": 1727,
    "recipe_id": 2712,
    "user_id": 1531,
    "user": "Mimi Hiller",
    "Rating": 4,
    "Review": "I cut back on the mayoand made up the difference with sour cream to adjust the stiffness of the dip."
  },
  {
    "_id": 1728,
    "recipe_id": 2715,
    "user_id": 1533,
    "user": "Dancer",
    "Rating": 5,
    "Review": "easily the best i have ever had.  juicy flavorfulnot dry.  the vegetables retain crispness as wellnot bland at all!"
  },
  {
    "_id": 1729,
    "recipe_id": 2717,
    "user_id": 1534,
    "user": "Tonkcats",
    "Rating": 0,
    "Review": "Would someone please check the Nutrition Facts of this recipe."
  },
  {
    "_id": 1730,
    "recipe_id": 2719,
    "user_id": 1535,
    "user": "Marg CaymanDesigns",
    "Rating": 4,
    "Review": "a little greasybut a huge hit with the guests."
  },
  {
    "_id": 1731,
    "recipe_id": 2721,
    "user_id": 1537,
    "user": "Barbara5",
    "Rating": 5,
    "Review": "leeks on a pizza?!  it was really delicious.  i used a boboli and added some chicken sausage slices and mushrooms too."
  },
  {
    "_id": 1732,
    "recipe_id": 2722,
    "user_id": 1538,
    "user": "Duckie067",
    "Rating": 5,
    "Review": "I deleted the bean sprouts and replaced them with salted cashew nuts...a nice complement to the sweet/sour dressing. Our guests loved itin my opinion,it deserves a \"5-pan\" rating."
  },
  {
    "_id": 1733,
    "recipe_id": 2727,
    "user_id": 1539,
    "user": "opal Fitzgerald",
    "Rating": 1,
    "Review": "Where does the bbq come in"
  },
  {
    "_id": 1734,
    "recipe_id": 2734,
    "user_id": 1542,
    "user": "ann joy",
    "Rating": 3,
    "Review": "It is a good recipe...but I believe that it would be better if it had raisins included  :)"
  },
  {
    "_id": 1735,
    "recipe_id": 2736,
    "user_id": 1543,
    "user": "Doreen Randal",
    "Rating": 2,
    "Review": "This recipe is called pumpkin squareswheres the squares? ITS A PIE !"
  },
  {
    "_id": 1736,
    "recipe_id": 2737,
    "user_id": 1544,
    "user": "tranch",
    "Rating": 3,
    "Review": "Careful not to cook it too long... you want the tuna to be closer to raw on the inside and crusty on the outside. Maybe use canola oil instead of butter to help sear the outside."
  },
  {
    "_id": 1737,
    "recipe_id": 2739,
    "user_id": 1545,
    "user": "Nancy Van Ess",
    "Rating": 4,
    "Review": "Took about 70 minutes to bake."
  },
  {
    "_id": 1738,
    "recipe_id": 2740,
    "user_id": 1546,
    "user": "Jane McCLure",
    "Rating": 5,
    "Review": "These have been an absolute hit with everyone every time I have made them.  They are incredibly easy to make and just heavenly!"
  },
  {
    "_id": 1739,
    "recipe_id": 2743,
    "user_id": 1547,
    "user": "Morton Design Graph",
    "Rating": 5,
    "Review": "Working 12 hour days 7 days a weekI was delighted to return home to a delious meal from my Crockpot.  Easy tastyand delious are understatements for this recipe!"
  },
  {
    "_id": 1740,
    "recipe_id": 2744,
    "user_id": 1548,
    "user": "Peggy Benisch",
    "Rating": 5,
    "Review": "I think this recipie is awesome. It tastes delicious and my whole family loved it."
  },
  {
    "_id": 1741,
    "recipe_id": 2745,
    "user_id": 1549,
    "user": "Dave5003",
    "Rating": 5,
    "Review": "if you like oystersthis is a great alternative to regularboring stuffing."
  },
  {
    "_id": 1742,
    "recipe_id": 2746,
    "user_id": 1550,
    "user": "Linda Sundbye",
    "Rating": 5,
    "Review": "quite easy to make make the taste is not bad either. i'd love to make it again and again with different toppings."
  },
  {
    "_id": 1743,
    "recipe_id": 2748,
    "user_id": 1551,
    "user": "Sean Coate",
    "Rating": 0,
    "Review": "I thought Chicken Cacciatore had peppers. If i were to make thisit would contain about 5-6 cut up peppers1 can tomato paste and a large can of crushed tomatoes and of course the chicken."
  },
  {
    "_id": 1744,
    "recipe_id": 2751,
    "user_id": 1552,
    "user": "Ron  Joyce Ripple S",
    "Rating": 5,
    "Review": "These make a wonderful healthy snack."
  },
  {
    "_id": 1745,
    "recipe_id": 2757,
    "user_id": 1554,
    "user": "Jacques Lorrain",
    "Rating": 5,
    "Review": "This is a wonderful recipebut last I knew it was from the famous Chef David Ruggerio actually from his grandmother....so I think he deserves the credit."
  },
  {
    "_id": 1746,
    "recipe_id": 2762,
    "user_id": 1555,
    "user": "Cindy Hartlin",
    "Rating": 3,
    "Review": "It's a tasty dish."
  },
  {
    "_id": 1747,
    "recipe_id": 2765,
    "user_id": 1556,
    "user": "Strawberry Girl",
    "Rating": 3,
    "Review": "tasty. you can substitute granulated sugar for the palm sugar."
  },
  {
    "_id": 1748,
    "recipe_id": 2776,
    "user_id": 1557,
    "user": "Angel Villanueva",
    "Rating": 4,
    "Review": "This is a lovely little repice. Quite delicious. However I recommend you cook the chicken breasts slowly and don't add the honey glaze until the last 4 to 5 minutes of cooking as it burns very quickly. Keping that in mindPlease try this quick and easy recipe. :)"
  },
  {
    "_id": 1749,
    "recipe_id": 2779,
    "user_id": 1558,
    "user": "S. Malcolm",
    "Rating": 0,
    "Review": "Terrible directions. Doesn't say how to make the dough or the filling."
  },
  {
    "_id": 1750,
    "recipe_id": 2780,
    "user_id": 1559,
    "user": "Will Parkinson",
    "Rating": 5,
    "Review": "It looks fabulousand will go great with my fresh cranberries from Eagle River WI."
  },
  {
    "_id": 1751,
    "recipe_id": 2783,
    "user_id": 1562,
    "user": "Libby1",
    "Rating": 4,
    "Review": "needs more spice."
  },
  {
    "_id": 1752,
    "recipe_id": 2786,
    "user_id": 1564,
    "user": "Ginny Holmy-Willcox",
    "Rating": 5,
    "Review": "I know that this recipe sounds strangebut I've tried it and it is the best fudge that I've ever had.  It's not too sweet like most areit stays soft (even after a few days). You must try ityou won't believe it!"
  },
  {
    "_id": 1753,
    "recipe_id": 2787,
    "user_id": 1567,
    "user": "elly9812",
    "Rating": 4,
    "Review": "My husband LOVES this stuff.  It was the only thing he requested I make for Thanksgiving. The recipe is easy and if it makes him happy I'll keep making it."
  },
  {
    "_id": 1754,
    "recipe_id": 2789,
    "user_id": 1569,
    "user": "Linda7",
    "Rating": 1,
    "Review": "Not much Effort."
  },
  {
    "_id": 1755,
    "recipe_id": 2792,
    "user_id": 1570,
    "user": "Dave Miner",
    "Rating": 5,
    "Review": "This is the best pie crust I have ever made.  It is simple and easy.  I have tried to make it fail but can not.  The taste and texture is wonderful."
  },
  {
    "_id": 1756,
    "recipe_id": 2793,
    "user_id": 1571,
    "user": "Linda Johansen",
    "Rating": 5,
    "Review": "Our family has enjoyed this recipetime and time again with great success. Favorite topping for this is to serve with chiligrated cheese and onions. The kids love it simply with catsup."
  },
  {
    "_id": 1757,
    "recipe_id": 2797,
    "user_id": 1572,
    "user": "Ed Paulhus",
    "Rating": 4,
    "Review": "This recipie would be 5 STARS if you top it before you bake it with1 C crushed corn flakes1/2 C brown sugar1/4 chopped pecans4 Tbsp butter and a Tbsp of flour and bake as directed. Topping is about accurateto the best of my memorydefinately try....This is a Thanksgiving MUSTand NO ONE will believe it is carrots!!!!!!"
  },
  {
    "_id": 1758,
    "recipe_id": 2804,
    "user_id": 1573,
    "user": "benluc",
    "Rating": 1,
    "Review": "This dish was good the first few bites then it got a vinager taste. I wont make it again"
  },
  {
    "_id": 1759,
    "recipe_id": 2808,
    "user_id": 1530,
    "user": "Carole Reu",
    "Rating": 5,
    "Review": "This is a great quick,easy,tasy cheescake."
  },
  {
    "_id": 1760,
    "recipe_id": 2810,
    "user_id": 1531,
    "user": "Mimi Hiller",
    "Rating": 4,
    "Review": "I found this meat loaf to be quite tastyI was a little nervous about the carrots,but it made it sweeter than I have tasted in a meat loaf. The measurements were a little over it made a rather large loaf and took a lot longer to cook. I had to raise the temp to 400 to get it to cook at a faster rate. It also gave off a lot of liquid and I used extra lean meat. It made about eight servings and all together was a good meat loaf. I would defintely make it again."
  },
  {
    "_id": 1761,
    "recipe_id": 2811,
    "user_id": 1533,
    "user": "Dancer",
    "Rating": 5,
    "Review": "A lot of people at our baby shower said how much they liked this punch.  Even one person said that they didn't like champagne but they loved this punch.  It had a nice fruity flavor and pretty color.  This one will go in my recipe file.  I couldn't find the frozen pineapple-orange-guava juice so I went with pineapple-orange.  Thanks for this wonderful recipe that was definitely a hit!"
  },
  {
    "_id": 1762,
    "recipe_id": 2813,
    "user_id": 1534,
    "user": "Tonkcats",
    "Rating": 5,
    "Review": "I made this casserole using light cream of celerylight sour creamlight Ritz crackers and light cheddar.  It still came out wonderful! Great alternative to the same old green bean casserole."
  },
  {
    "_id": 1763,
    "recipe_id": 2818,
    "user_id": 1535,
    "user": "Marg CaymanDesigns",
    "Rating": 4,
    "Review": "Will go great with Thangsgiving meal."
  },
  {
    "_id": 1764,
    "recipe_id": 2819,
    "user_id": 1537,
    "user": "Barbara5",
    "Rating": 3,
    "Review": "Simple and easy to prepare."
  },
  {
    "_id": 1765,
    "recipe_id": 2821,
    "user_id": 1538,
    "user": "Duckie067",
    "Rating": 5,
    "Review": "she loved it"
  },
  {
    "_id": 1766,
    "recipe_id": 2824,
    "user_id": 1539,
    "user": "opal Fitzgerald",
    "Rating": 3,
    "Review": "I just had to make this magic food of song (at least as sung by SharenLois and Bram).  I must say that I usually don't  like walnutsbut they were great in this.  This was very tastythough not as rich as I might have guessed.  It was somewhat  sweeter than I normally likebut I did not leave any in the bowl. The upside down presentation is showy.  I recommend some very rich ice cream as a topping or side dish (Blue Bell Homemade Vanilla  Ice Cream fills the bill in my neck of the woods).  Fun and tasty."
  },
  {
    "_id": 1767,
    "recipe_id": 2826,
    "user_id": 1542,
    "user": "ann joy",
    "Rating": 5,
    "Review": "I would reccomend this recipe to any one that doesn't like pumpkin pieit is a delicious substitute. The pumkin rolls are almost like cinnamon rolls except for the taste.  I reccomend this recipe to every one."
  },
  {
    "_id": 1768,
    "recipe_id": 2832,
    "user_id": 1543,
    "user": "Doreen Randal",
    "Rating": 0,
    "Review": "makes 2- 9inch pies  or 1 deep dish pie"
  },
  {
    "_id": 1769,
    "recipe_id": 2834,
    "user_id": 1544,
    "user": "tranch",
    "Rating": 5,
    "Review": "I recently tried this recipe and got rave reviews from family and friends!"
  },
  {
    "_id": 1770,
    "recipe_id": 2844,
    "user_id": 1545,
    "user": "Nancy Van Ess",
    "Rating": 3,
    "Review": "I came upon this recipe while searching for a sweet potato topping. I didn't like the recipe for the potato itself because it would have been much to sweet and \"heavy\" for my tastes. I did enjoy the topping very muchthough. I topped plainbuttered sweet potatoes with it and they were quite good."
  },
  {
    "_id": 1771,
    "recipe_id": 2850,
    "user_id": 1546,
    "user": "Jane McCLure",
    "Rating": 3,
    "Review": "Where's the Nutmeg And the Cinnamon?"
  },
  {
    "_id": 1772,
    "recipe_id": 2856,
    "user_id": 1547,
    "user": "Morton Design Graph",
    "Rating": 5,
    "Review": "My wife made this recipie for Thanksgiving today and the whole family agreed it was the best food on the whole table."
  },
  {
    "_id": 1773,
    "recipe_id": 2864,
    "user_id": 1548,
    "user": "Peggy Benisch",
    "Rating": 5,
    "Review": "The Turkey was wonderful!!! My Husband thought I was crazy when he read the note I left him in the morning when he got up to put it in the oven. when I pulled it out of the oven he said it was the prettiest Turkey he had ever seenBut said lets wait to see what it taste like. when he tried it at my parents he loved it and made sure every one know he was the one who cooked it since he was the one who put it in the oven"
  },
  {
    "_id": 1774,
    "recipe_id": 2865,
    "user_id": 1549,
    "user": "Dave5003",
    "Rating": 5,
    "Review": "Muffins were simply excellent!  Easy to preparemoist and so tasty!  We started out by reducing the recipe for only 4 servings...after the first muffin was gonewe started the second batch (increasing to 12 servings!).  ENJOY!"
  },
  {
    "_id": 1775,
    "recipe_id": 2866,
    "user_id": 1550,
    "user": "Linda Sundbye",
    "Rating": 2,
    "Review": "Recipe did not result in expected product.  Noodles were BLAHdid not hold form well.  By farthis is not one of the better recipes I have used for Spatzel.  A little tweaking is required.  Most likely I will stick with my Grandmother Stroud''s tried and true recipe."
  },
  {
    "_id": 1776,
    "recipe_id": 2872,
    "user_id": 1551,
    "user": "Sean Coate",
    "Rating": 5,
    "Review": "Excellent and great tasting.  Easy prep!!!!! My guest loved it!   :-)"
  },
  {
    "_id": 1777,
    "recipe_id": 2879,
    "user_id": 1552,
    "user": "Ron  Joyce Ripple S",
    "Rating": 1,
    "Review": "Onions and whiskey overpowered the sauce.  Not at all similar to TGI Friday's mariande."
  },
  {
    "_id": 1778,
    "recipe_id": 2891,
    "user_id": 1554,
    "user": "Jacques Lorrain",
    "Rating": 2,
    "Review": "Goodstraight forward side dish.  Howeverthe author of the recipe forgot to list the sour cream in the list of ingredients.  Thanksgiving morning I was preparing my casserole and got to the part where I was supposed to add it.  I substituted some extra broth to make up for itbut it still ended up dry and gooey.  My advicedon't try anything new on a holiday."
  },
  {
    "_id": 1779,
    "recipe_id": 2892,
    "user_id": 1555,
    "user": "Cindy Hartlin",
    "Rating": 4,
    "Review": "very good   made it with and without the vodka"
  },
  {
    "_id": 1780,
    "recipe_id": 2898,
    "user_id": 1556,
    "user": "Strawberry Girl",
    "Rating": 4,
    "Review": "I ended up adapting this to make a kind of taco instead of baking it as enchiladasbut we liked it quite a bit."
  },
  {
    "_id": 1781,
    "recipe_id": 2900,
    "user_id": 1557,
    "user": "Angel Villanueva",
    "Rating": 4,
    "Review": "It was a good recipebut I felt it needed a little garlic. My son said it was just like he had it in a restaurant. (which in our neighborhood is a great restuarant).  Bravo great stuff."
  },
  {
    "_id": 1782,
    "recipe_id": 2912,
    "user_id": 1558,
    "user": "S. Malcolm",
    "Rating": 5,
    "Review": "I served this recipeCherry Cheese Salad at our community dinner for 60 people. It was a hit. It is a wonderfulrefreshing salad. It seems to come alive in your mouth when all the flavors hit the taste buds. Great recipe!"
  },
  {
    "_id": 1783,
    "recipe_id": 2917,
    "user_id": 1559,
    "user": "Will Parkinson",
    "Rating": 4,
    "Review": "This is great.  Very similar to apple butterand cans in jars very well.  My family loved itas well as some friends I gave it to.  This is a neat way to use the pumpkins left over from halloween or thanksgiving time."
  },
  {
    "_id": 1784,
    "recipe_id": 2918,
    "user_id": 1562,
    "user": "Libby1",
    "Rating": 0,
    "Review": "This is in fact not a Greek dishbut Turkish.  \"Dolma\" means \"StuffingStuffed\" in Turkish and the origins of this dish go back to authentic Ottoman Imperial Cuisine. In fact there are very many other stuffed vegetable dishes in the Turkish Cuisinesuch as eggplantsarthichokesmarrow(zuccihini) and its blossomspotatoes etc.  This termstuffedis also used for dishes where chickenturkey and the like are stuffed with various ingredientsmainly ricebefore cooking usually in the oven."
  },
  {
    "_id": 1785,
    "recipe_id": 2925,
    "user_id": 1564,
    "user": "Ginny Holmy-Willcox",
    "Rating": 0,
    "Review": "Baklava is definitely not Greekbut Turkish.  It was the prime dessert in the Ottoman Cuisine and a feast never ended without a serving.  In fact the word itself is Turkishmeaning \"diamond-shaped\" which was the way in which the pastry was cut before serving. Generally walnutspistachios and other nuts are used for the filling."
  },
  {
    "_id": 1786,
    "recipe_id": 2926,
    "user_id": 1567,
    "user": "elly9812",
    "Rating": 0,
    "Review": "This dishwith slight variations (usually lemon juice is used) is very common in Middle Eastern Countries and should not be categorised as Greekbut \"collective\".  I suspect that it is in fact Lebanese."
  },
  {
    "_id": 1787,
    "recipe_id": 2933,
    "user_id": 1569,
    "user": "Linda7",
    "Rating": 5,
    "Review": "This is a great recipe I made it for my family soon it will be served in my restaurants."
  },
  {
    "_id": 1788,
    "recipe_id": 2934,
    "user_id": 1570,
    "user": "Dave Miner",
    "Rating": 2,
    "Review": "This recipe sounded a lot better than it turned out for me.  I ends up too runny and mushy for my tastes.  Still ediblejust not my best bread pudding.  Suggestions?"
  },
  {
    "_id": 1789,
    "recipe_id": 2937,
    "user_id": 1571,
    "user": "Linda Johansen",
    "Rating": 5,
    "Review": "I thought this recipe was very quick and easy and delicious. I made at Thanksgiving for my family and they really enjoyed it.  I'm making it again for some friends at work."
  },
  {
    "_id": 1790,
    "recipe_id": 2939,
    "user_id": 1572,
    "user": "Ed Paulhus",
    "Rating": 5,
    "Review": "It was A great recipe but I did not use the apples"
  },
  {
    "_id": 1791,
    "recipe_id": 2940,
    "user_id": 1573,
    "user": "benluc",
    "Rating": 5,
    "Review": "I have baked these biscotti before and they are excellent.  I'm so glad I could find the recipe again."
  },
  {
    "_id": 1792,
    "recipe_id": 2941,
    "user_id": 1596,
    "user": "Joan Edington",
    "Rating": 5,
    "Review": "This is a very tasty cake--my recipe calls for sprinkling the batter with 1/2 cup chopped nuts before baking--Delicious!!"
  },
  {
    "_id": 1793,
    "recipe_id": 2942,
    "user_id": 1598,
    "user": "Miss Daisy",
    "Rating": 5,
    "Review": "The French Onion soup recipe is one of the most popular dish served at the Famous Barr (also part of the May Dept store group) restaurants found in St.Louis.   Based on my travels to the various countries including EuropeAsia and USthis version of French Onion soup is one of the best I've had. My husband who is from London just loves this recipe."
  },
  {
    "_id": 1794,
    "recipe_id": 2944,
    "user_id": 1599,
    "user": "Mays Pearls of Wisd",
    "Rating": 5,
    "Review": "My grandma has been making this simple coffee cake for years.  It is a huge favorite for the whole family!  We add chopped pecans to ours.  Really easy for overnight company.  It rises overnight and you pop it in the oven before everyone gets up."
  },
  {
    "_id": 1795,
    "recipe_id": 2947,
    "user_id": 1600,
    "user": "Leon  Miriam Posvol",
    "Rating": 5,
    "Review": "This taste great!!!!!! Even my 3yr. old loved it"
  },
  {
    "_id": 1796,
    "recipe_id": 2952,
    "user_id": 1601,
    "user": "Gilcat2",
    "Rating": 5,
    "Review": "Everyone loved it. I have made it up twice in one week.  I put it up in the freezer in individual servings."
  },
  {
    "_id": 1797,
    "recipe_id": 2953,
    "user_id": 1603,
    "user": "Carol H",
    "Rating": 4,
    "Review": "Great recipeeveryone loved it,,young & old."
  },
  {
    "_id": 1798,
    "recipe_id": 2954,
    "user_id": 1604,
    "user": "itsjustme",
    "Rating": 4,
    "Review": "This recipe is greatespecially for chocolate lovers. It goes very well topped off with whipped cream. However the recipe never tells you what to do with the hazelnuts. So I just added them into the mixture along with the biscuits and turned the chocolate into it. It was delicious."
  },
  {
    "_id": 1799,
    "recipe_id": 2962,
    "user_id": 1605,
    "user": "William Fitzgerald",
    "Rating": 3,
    "Review": "Ok"
  },
  {
    "_id": 1800,
    "recipe_id": 2964,
    "user_id": 1609,
    "user": "Barbara Heller",
    "Rating": 5,
    "Review": "This is a wonderful holiday bread.  I make it every year and give some of the loaves to my close friends and neighbors who look forward to this special treat.  It is especially delicious served with a hot cup of Christmas tea."
  },
  {
    "_id": 1801,
    "recipe_id": 2965,
    "user_id": 1610,
    "user": "B  B Adams",
    "Rating": 0,
    "Review": "I''m really happy to read so many people are enjoying my Mothers recipe for cucumber salad. She would be absolutely thrilled. Thanks you so much. ENJOY."
  },
  {
    "_id": 1802,
    "recipe_id": 2976,
    "user_id": 1612,
    "user": "JANIC412",
    "Rating": 4,
    "Review": "It was not the best that I ever ate but it was definately the best that I ever made. I didn't make it in the microwave but on the stove. I liked itand it was easy to make. One of the reasons it was probably not the best I ever ate is because I used chicken that was all ready cut up so there was no skin and less fat and less taste. I have to watch my fat intake."
  },
  {
    "_id": 1803,
    "recipe_id": 2977,
    "user_id": 1613,
    "user": "george nuckols",
    "Rating": 0,
    "Review": "the finished product is excellent."
  },
  {
    "_id": 1804,
    "recipe_id": 2982,
    "user_id": 1616,
    "user": "Melody",
    "Rating": 4,
    "Review": "Very unique & since garlic is my favorite ingredient...i love it!"
  },
  {
    "_id": 1805,
    "recipe_id": 2988,
    "user_id": 1617,
    "user": "Irene Wilcox",
    "Rating": 5,
    "Review": "I made this soup pretty much as directed except I browned the meat in olive oiland added 2 bay leaves,and two cloves of garlic. I just had it for lunch and my sister and I thought it was excelent I will freeze the rest in individule serving sizes for my husband and I."
  },
  {
    "_id": 1806,
    "recipe_id": 3001,
    "user_id": 1621,
    "user": "Quick n Easy Recipes",
    "Rating": 5,
    "Review": "Excellent chiliespecially liked it with the spaghetti.  I prefer more chili powder than the recipe called for.  Also makes for very good chili cheese fries."
  },
  {
    "_id": 1807,
    "recipe_id": 3002,
    "user_id": 1629,
    "user": "Joy Boss",
    "Rating": 5,
    "Review": "I live on the Oregon coast and met and fell in love with a wonderful man from cinncinnati."
  },
  {
    "_id": 1808,
    "recipe_id": 3006,
    "user_id": 1630,
    "user": "Tim  Tina Ireland",
    "Rating": 5,
    "Review": "I heard about this fudge this morning..looked up the recipe and made it..it is great..so easy and the best fudge I've ever eaten."
  },
  {
    "_id": 1809,
    "recipe_id": 3007,
    "user_id": 1632,
    "user": "Peeter Raudvere",
    "Rating": 0,
    "Review": "Rum Flavoringmight have been her way of saying 100 proof Rum."
  },
  {
    "_id": 1810,
    "recipe_id": 3014,
    "user_id": 1633,
    "user": "Julie chazelet",
    "Rating": 5,
    "Review": "I loved this recipevery tasty and makes a great appyi will be making it for my new years party."
  },
  {
    "_id": 1811,
    "recipe_id": 3019,
    "user_id": 1634,
    "user": "Bill Hilbrich",
    "Rating": 5,
    "Review": "This was easy to make and handy to have in the freezer ready to just bake. I will have to learn to cut it down into four serving sizes though. It was to much just for my husband and I. I also added ground beef to mine. It tasted really good."
  },
  {
    "_id": 1812,
    "recipe_id": 3023,
    "user_id": 1635,
    "user": "Jill McQuown",
    "Rating": 5,
    "Review": "BOY!  You sure can't eat just one of these muffins at a time. They were really great and easy to make. I even made a terrible mistakeI forgot to put the brown sugar in. The next two batches I make I will do right. I didn't think something with green chili in would taste good. Was I surprised."
  },
  {
    "_id": 1813,
    "recipe_id": 3025,
    "user_id": 1636,
    "user": "carlanna livingstone",
    "Rating": 4,
    "Review": "Very good and really easy!!!"
  },
  {
    "_id": 1814,
    "recipe_id": 3026,
    "user_id": 1639,
    "user": "elt8588",
    "Rating": 5,
    "Review": "I have made this recipe for the last 6-7yrs. at Christmas.  I usually don't like fudgebut this is GREAT.  I give it as gifts and everyone always asks for the recipe."
  },
  {
    "_id": 1815,
    "recipe_id": 3030,
    "user_id": 1640,
    "user": "Seausoon39",
    "Rating": 5,
    "Review": "Best Chilli I have ever had.  Nice and spiceyfilling and againthe best chilli I have ever had."
  },
  {
    "_id": 1816,
    "recipe_id": 3032,
    "user_id": 1641,
    "user": "June Neil",
    "Rating": 4,
    "Review": "These were incredibly easy and fast to make.  They stored well in the refrigerator...I brought them to my organization's holiday potluck on a nice paper plate.  They all went quicklyso there was no cleanup or any leftovers to take back home.  PS--my coworkers liked them!"
  },
  {
    "_id": 1817,
    "recipe_id": 3033,
    "user_id": 1642,
    "user": "M Messer",
    "Rating": 5,
    "Review": "This is a great recipe... make ahead and broil before serving. My friends love this."
  },
  {
    "_id": 1818,
    "recipe_id": 3034,
    "user_id": 1643,
    "user": "Mutende",
    "Rating": 5,
    "Review": "I made a double batch of this soup and added a medium onion and two cloves of garlic. It was easy and I thought it was really great. Of coarse potato soup is my favorite and this was the best that I have ever made. I am going to put in individual servings and freeze."
  },
  {
    "_id": 1819,
    "recipe_id": 3035,
    "user_id": 1646,
    "user": "WildlifeDi",
    "Rating": 5,
    "Review": "I've often made these with different liquers. Orangeraspberry and peach are favorites.  Of coursewhen my husband makes themwith either rum or bourbonthey're a bit more \"liquidy\" than normal."
  },
  {
    "_id": 1820,
    "recipe_id": 3037,
    "user_id": 1647,
    "user": "MJ  BARB HUNDAHL",
    "Rating": 5,
    "Review": "I love this soup it was great.  i would love to try to make it again some time to have.  I did tell all my friends about it and they loved it too.  ao to eveyone this is the best soup try it too."
  },
  {
    "_id": 1821,
    "recipe_id": 3039,
    "user_id": 1648,
    "user": "a-j-b",
    "Rating": 0,
    "Review": "This recipe sounds interesting except what is the brine made of?"
  },
  {
    "_id": 1822,
    "recipe_id": 3040,
    "user_id": 1649,
    "user": "Whtsebring",
    "Rating": 4,
    "Review": "It was my first time making sweet potatoesand this recipe was very simple and easy to follow. Everyone at Thanksgiving loved them."
  },
  {
    "_id": 1823,
    "recipe_id": 3041,
    "user_id": 1652,
    "user": "Graham Scott",
    "Rating": 5,
    "Review": "This recipe is so versatile!  I've made it minty with flavoring. I've used nuts and marshmellows for a rocky road fudge."
  },
  {
    "_id": 1824,
    "recipe_id": 3042,
    "user_id": 1654,
    "user": "Paula Maguire",
    "Rating": 5,
    "Review": "3 medium onions made a very tasty part of a meal for 3 persons. The recipe ingredients reads \"20 butter\" and \"onions\" but doesn't say  how many.  I used about a 1/2 C. butter and 3 medium onions & it worked out fine and the cooking time seemed to be the right time.  3 med. onions would serve 4 people. They would be really yummy atop a thick juicy filet mignon! In factI believe that this recipe could be included with a large number of meals of various types."
  },
  {
    "_id": 1825,
    "recipe_id": 3043,
    "user_id": 1657,
    "user": "cwambeam",
    "Rating": 5,
    "Review": "This is the best eggnog I have ever had.  It's good with fat-free half & halftoo.  The writer suggested Jack Daniels might be good in itbut it is especially good with 1/2 cup of light rum (preferably Bacardi) and 1/2 cup of Crown Royal.  Delicious!"
  },
  {
    "_id": 1826,
    "recipe_id": 3044,
    "user_id": 1659,
    "user": "WisTex",
    "Rating": 5,
    "Review": "This recipe was great! In order to make the recipe even easierI substituted the sweet potatoes with canned sweet potatoes -- and it STILL came out good. The entire family loved itincluding the kidsand my sister and mother-in-law asked for the \"secret\" recipe."
  },
  {
    "_id": 1827,
    "recipe_id": 3046,
    "user_id": 1660,
    "user": "Mehitabel",
    "Rating": 4,
    "Review": "Delicious! And I was able to stretch the recipe to 4 cups of walnut halves with no problem. It takes about an hour from start to finishbut the coating needs to set a couple of hours in order for them not to stick together."
  },
  {
    "_id": 1828,
    "recipe_id": 3047,
    "user_id": 1662,
    "user": "Anne Edgell",
    "Rating": 5,
    "Review": "Absolutely Delightful Recipe! Rich and Flavorful!"
  },
  {
    "_id": 1829,
    "recipe_id": 3053,
    "user_id": 1664,
    "user": "Duane and Ginger Va",
    "Rating": 5,
    "Review": "this is a traditional dish my family has enjoyed on christmas eve for over 30 years. my mother passed away 2 years ago and it fell to me to keep the tradition going. i needed to recheck my memory and had a hard time finding this till i came across your site. many thanks and merry christmas"
  },
  {
    "_id": 1830,
    "recipe_id": 3055,
    "user_id": 1667,
    "user": "Binkie45",
    "Rating": 5,
    "Review": "My daughter and I made this bread over Christmas and it was wonderful.  We left out the fruit--the bread lasted almost one day--the aroma was awesome!!! Everyone that came by the day we were baking our Christmas goodies wanted to stick around until THAT bread was done.  We have already made another loaf.  Thanks for a great recipe."
  },
  {
    "_id": 1831,
    "recipe_id": 3057,
    "user_id": 1668,
    "user": "Medit",
    "Rating": 4,
    "Review": "There is no temperature given for baking these bars."
  },
  {
    "_id": 1832,
    "recipe_id": 3060,
    "user_id": 1670,
    "user": "Evans",
    "Rating": 5,
    "Review": "While on my first visit to Ireland in July 1999the birthplace of parentsmy cousin and I stopped in Doolen near the Cliffs of Mohr and had this marvelous dark Irish Beef Stew cooked in Guinness Stout\"  at O'Connors Pub.  It was absolutely delicous and the first authentic Irish meal we had and while all the food was great there was nothing that could beat the Irish Stew.  When I found the recipe on this siteI immediately tried it and it is exactly like what we had in Ireland.  When my cousin came to dinner and I served ithe was sure I had gotten the recipe from O'Connors Pub while we were in Ireland.  It was a cinch to makedirections were very easy to follow and it practically cooks itself.  It is equally as good over mashed potatoes or rice.  Try ityou'll like it. The one ingredient I added was a \"wee bit of blarney"
  },
  {
    "_id": 1833,
    "recipe_id": 3064,
    "user_id": 1671,
    "user": "Eduardo Maldonado",
    "Rating": 2,
    "Review": "The potatoes turned a very unappealing shade of gray.  Although they tasted ok once you got past the looksmy kids wouldn't eat them."
  },
  {
    "_id": 1834,
    "recipe_id": 3065,
    "user_id": 1672,
    "user": "W1xyz",
    "Rating": 4,
    "Review": "This is a very good basic recipe and I just thought I would add the variation that I took.  It being the day after Christmas I had a ham bone I needed to use and my son wanted lentil soup.  I just wanted to make something a little different so I surfed the web until I found this one that was nice and basic but I added the ham bone and skipped the hot dogsadded two potatoes and a can of diced tomatoes to make a very delicious soup.  Thanks for the basics,"
  },
  {
    "_id": 1835,
    "recipe_id": 3072,
    "user_id": 1673,
    "user": "Jay Grush",
    "Rating": 5,
    "Review": "very good!!!"
  },
  {
    "_id": 1836,
    "recipe_id": 3073,
    "user_id": 1675,
    "user": "Jim Weller",
    "Rating": 5,
    "Review": "We had these for Christmas dinner and they are great. I added a 1/2 tsp. or cinnamon and placed a whole walnut on each Ball. Easy and fast and they were a hit"
  },
  {
    "_id": 1837,
    "recipe_id": 3076,
    "user_id": 1676,
    "user": "Larry",
    "Rating": 2,
    "Review": "I'm sorrybut I tried this method for my Christmas turkey and the results just do not comapare with preparing a turkey the old-fashioned way . . . basting frequently in a roasting pan in a hot oven.  The turkey skin did not fully brown and the wings/legs had a distinct steamed texture.  This is an easier way of cooking a turkeybut sometimes easier is not better."
  },
  {
    "_id": 1838,
    "recipe_id": 3077,
    "user_id": 1677,
    "user": "Klaus Alexander Sei",
    "Rating": 1,
    "Review": "Blueberries sink to bottom of bundt pan and stick.  I had planned on giving these cakes as Christmas presentshowevergave up after three attempts.   No amount of greasing or flouring the pan seemed to help."
  },
  {
    "_id": 1839,
    "recipe_id": 3078,
    "user_id": 1678,
    "user": "Mary Lord",
    "Rating": 5,
    "Review": "Thank you for providing this recipe.  I'll let you know how the customer liked it."
  },
  {
    "_id": 1840,
    "recipe_id": 3079,
    "user_id": 1679,
    "user": "news.mercuryin.es",
    "Rating": 2,
    "Review": "I was expecting a simplistic recipe but instead was provided a recipe with ingredients that I have never heard of (Gruyere Cheese) and measurement values that require research (150 ml of milk).  I think the consideration should be made for those of us who are new to this internet age and they should keep in mind that the cookers of the household are middle aged women who are use to regular methods of measurement."
  },
  {
    "_id": 1841,
    "recipe_id": 3080,
    "user_id": 1680,
    "user": "Cathi Allen",
    "Rating": 1,
    "Review": "It is like rubber."
  },
  {
    "_id": 1842,
    "recipe_id": 3082,
    "user_id": 1681,
    "user": "nancy5",
    "Rating": 5,
    "Review": "This is the recipe I have used for many years.  It is so yummy.  It is easy to make and a treat to eat.  It is good for every day type bread and wonderful to give as a gift.  It is a favorite of my family."
  },
  {
    "_id": 1843,
    "recipe_id": 3088,
    "user_id": 1684,
    "user": "Katrina Streiff",
    "Rating": 0,
    "Review": "Goodbut I wished they were a bit more moist."
  },
  {
    "_id": 1844,
    "recipe_id": 3089,
    "user_id": 1689,
    "user": "Kevin Kirkland",
    "Rating": 4,
    "Review": "This is really good for a little something different.  Alsoyou may want to vary the mayonnaise by adding cream cheesea few chivesgarlic powder and maybe a few other spices occasionally.  But it is really fine just \"as is.\"  I really enjoyed this.  Thanks!"
  },
  {
    "_id": 1845,
    "recipe_id": 3090,
    "user_id": 1691,
    "user": "I Dunno",
    "Rating": 4,
    "Review": "This really is a great recipe. I substitute Chicken Broth for the water and at the end I add some cream (HeavyLight or Half & Half) just to add some creamy richness. Also for a special twist add some cooked baby shrimp (peeled & de-viened of course) 15-20 minutes before serving. And plenty of cracked Pepper and Soda Crackers :-) Enjoy."
  },
  {
    "_id": 1846,
    "recipe_id": 3093,
    "user_id": 1692,
    "user": "MP562",
    "Rating": 0,
    "Review": "I just found this recipebut I am going to bake itwould be great with a salad...."
  },
  {
    "_id": 1847,
    "recipe_id": 3095,
    "user_id": 3337,
    "user": "Erin Laddie",
    "Rating": 4,
    "Review": "It takes approximately 45 minutes to prepare meatballs & sauce. Serving size is approximately 38 meat balls. I used ground turkey instead of beef & came out much betterused fresh garlic & minced together with the onionsalso a dash of cajun & Itatilian seasonings made the meatballs a complete success."
  },
  {
    "_id": 1848,
    "recipe_id": 3098,
    "user_id": 4244,
    "user": "Danny Bennett",
    "Rating": 5,
    "Review": "I doubled this recipe for Christmas dinner 2000 and everyone came back for 2nd's and some even for 3rd's.   Very easy to make.  I increased the cooking time to 60 min's and put a extra cheese on top for the last 15 min. uncovered for a nice crust of baked cheese."
  },
  {
    "_id": 1849,
    "recipe_id": 3099,
    "user_id": 4242,
    "user": "marie m",
    "Rating": 5,
    "Review": "my family loved these.  fresher than any boughten poppers.  take some preparation timebut are well worth it."
  },
  {
    "_id": 1850,
    "recipe_id": 3100,
    "user_id": 1566,
    "user": "Stephen Little",
    "Rating": 0,
    "Review": "Try dipping or coating one side with some good chocolate... even better!!!"
  },
  {
    "_id": 1851,
    "recipe_id": 3104,
    "user_id": 3962,
    "user": "Erna House",
    "Rating": 1,
    "Review": "The recipe did not say to drain the juice from the pineapple and mandarin oranges and therefore it was very soupy!"
  },
  {
    "_id": 1852,
    "recipe_id": 3105,
    "user_id": 4200,
    "user": "LC Liu",
    "Rating": 5,
    "Review": "I received this \"hoax\" email forward about 4 years agobut never attempted the recipe. A friend of the family made it for us just a few weeks ago and it tastes incredible! I can't believe I held on to this recipe for so long!!"
  },
  {
    "_id": 1853,
    "recipe_id": 3106,
    "user_id": 4074,
    "user": "TJ Witt",
    "Rating": 5,
    "Review": "I made this recipe for Christmas and it was great!  The red and green coloring also made it festive-looking.  Itooleft out the bean sprouts and substituted cashews.  Even my picky Mother-in-law couldn't complain!!"
  },
  {
    "_id": 1854,
    "recipe_id": 3107,
    "user_id": 4190,
    "user": "leeann walker",
    "Rating": 5,
    "Review": "Excellent Pumpkin Rollvery tasty. I add Pecans ontop of cream cheese filling"
  },
  {
    "_id": 1855,
    "recipe_id": 3108,
    "user_id": 4312,
    "user": "Claude Santini",
    "Rating": 4,
    "Review": "Ravishing and delightfulvery easy to make."
  },
  {
    "_id": 1856,
    "recipe_id": 3109,
    "user_id": 4309,
    "user": "Beverly Kaplan",
    "Rating": 4,
    "Review": "This recipe was easily adapted as a sugar free recipe--substituting Nutrisweet for sugar--My diabetic husband loved it--Thank-you"
  },
  {
    "_id": 1857,
    "recipe_id": 3110,
    "user_id": 4329,
    "user": "melanie mcgackin",
    "Rating": 4,
    "Review": "AN extremely fast and easy to follow recipe! Though I did not add in the raisins or brandyI substituted drained crushed pineapple insteadturned out great. We served the dip with pineapple chunks and poundcake. Add in extra chocolate chips for sweetness!"
  },
  {
    "_id": 1858,
    "recipe_id": 3114,
    "user_id": 4335,
    "user": "Tiina",
    "Rating": 0,
    "Review": "great recipe its delicious"
  },
  {
    "_id": 1859,
    "recipe_id": 3115,
    "user_id": 4336,
    "user": "Marquise Patton",
    "Rating": 5,
    "Review": "This recipe is so easy I usually make two at a time. Not only does it taste greatbut I make them and put into the freezer to use at a church circleclub meetingor for friends who just happen to drop by.  I always try to keep at least one in the freezer."
  },
  {
    "_id": 1860,
    "recipe_id": 3122,
    "user_id": 4340,
    "user": "Doug Thompson",
    "Rating": 0,
    "Review": "Concerning handling chili peppersit really is unnecessary to use gloves."
  },
  {
    "_id": 1861,
    "recipe_id": 3126,
    "user_id": 4203,
    "user": "Amy12583",
    "Rating": 5,
    "Review": "I have had a hashbrown casserole similar to this as wellbut never got the recipe.  I am curious as how much sour cream should you put in then.  Thanks."
  },
  {
    "_id": 1862,
    "recipe_id": 3127,
    "user_id": 4317,
    "user": "Kay Abbott",
    "Rating": 3,
    "Review": "This is a traditional way of making english bread pudding - but i live in Texas - does anyone know what they call suet in Texas? someone told me they only use it for birdseed???"
  },
  {
    "_id": 1863,
    "recipe_id": 3130,
    "user_id": 4240,
    "user": "Christine Cipullo",
    "Rating": 0,
    "Review": "Have not tried this yetwas looking for crock-pot recipesbut Chicken Cacc. is one of my family's favorites and  it absolutely has to have red wine in itand green peppers."
  },
  {
    "_id": 1864,
    "recipe_id": 3138,
    "user_id": 4353,
    "user": "Judith Boncaro",
    "Rating": 3,
    "Review": "This is only a low sodium recipe if you completely omit the salt - just use a little more pepperor some garlic powder."
  },
  {
    "_id": 1865,
    "recipe_id": 3146,
    "user_id": 4353,
    "user": "Judith Boncaro",
    "Rating": 0,
    "Review": "Since 3 oz of anchovies contains 425 mg of sodiumI would guess that 2 anchovy fillets contain about 150 mg of sodium."
  },
  {
    "_id": 1866,
    "recipe_id": 3148,
    "user_id": 1694,
    "user": "MaxinePeter",
    "Rating": 5,
    "Review": "It was totally tasty dudes"
  },
  {
    "_id": 1867,
    "recipe_id": 3155,
    "user_id": 1697,
    "user": "Alan1",
    "Rating": 5,
    "Review": "Aren't there 6 or seven stars to choose from.  WOW!  I was so excited to see this recipe.  I absolutely loved this soup when my husband and I would go to Famous Barr 30 yearswhen he was in the seminary at Concordia St. Louis.  I have made it through the yearsbecause an aunt had sent me the recipe from her local SpringfieldIL newspaper about 20 years.  Once I lost itbut a friend retrieved it for me from the time she had asked me for it.  What I love about your site is the instant way to double or triple or whatever the recipe!  I make this recipe a number of times each yearbut I always make it for a big Christmas Party we have.  Everyone loves it and looks forward to it each year!  Thanks so much!  I always serve it with homemade bread and a Ceasar Salad.  I look forward to your newsletters."
  },
  {
    "_id": 1868,
    "recipe_id": 3156,
    "user_id": 1698,
    "user": "CeeDee",
    "Rating": 5,
    "Review": "I haven't tried it yetbut when I do I will use cherry cola"
  },
  {
    "_id": 1869,
    "recipe_id": 3158,
    "user_id": 1702,
    "user": "Alison Corfield",
    "Rating": 4,
    "Review": "I found this recipe to be very goodbut only gave it four stars as it called for (in my opinion) way too much celery and onions.  I cut the onions back to 1/2 cup and the celery to 1 cup.  I also added 1/3 cup grated carrots. My husband loved it!"
  },
  {
    "_id": 1870,
    "recipe_id": 3161,
    "user_id": 1704,
    "user": "HELEN PEAGRAM_40951",
    "Rating": 5,
    "Review": "I substituted the green bell pepper with red and it was wonderful."
  },
  {
    "_id": 1871,
    "recipe_id": 3175,
    "user_id": 1715,
    "user": "The Fradys",
    "Rating": 5,
    "Review": "Another great way to make this recipe is to put all the ingredients inside the flattened biscuit and then deep fry them this is a real pleaser any time in my house. This recipe is very easy and fun to make I hope to find some more fun recioes soon!"
  },
  {
    "_id": 1872,
    "recipe_id": 3178,
    "user_id": 1717,
    "user": "JonquilJan",
    "Rating": 0,
    "Review": "This dish has been in homes across the south for as long as I can remember. Sometimes a little onion is added to the mixture. Goes great with any meal."
  },
  {
    "_id": 1873,
    "recipe_id": 3179,
    "user_id": 1719,
    "user": "Dorothy1",
    "Rating": 4,
    "Review": "Very simple to make. there were no strange ingredents or a big mess. taste justlike my moms. very down home"
  },
  {
    "_id": 1874,
    "recipe_id": 3182,
    "user_id": 1721,
    "user": "Denise3",
    "Rating": 5,
    "Review": "This is a great basic potato soup receipe!  I used two cups of half & half in place of two cups of milkand added 1/2 pound of cooked bacon plus two tbls. parsley. I took out the cheese to add the half & half!"
  },
  {
    "_id": 1875,
    "recipe_id": 3183,
    "user_id": 1722,
    "user": "Jacqui Jones",
    "Rating": 1,
    "Review": "I believe there is a mistake in the amount of eggnog listed in this recipe...5 1/2 cups is too much and the batter overflows a 9x5"
  },
  {
    "_id": 1876,
    "recipe_id": 3184,
    "user_id": 1723,
    "user": "Sergio  Dorothy G P",
    "Rating": 5,
    "Review": "Made it for daughter's weddinga GREAT hit!!"
  },
  {
    "_id": 1877,
    "recipe_id": 3192,
    "user_id": 1724,
    "user": "goblait",
    "Rating": 4,
    "Review": "I made this dessert for a formal English Christmas dinner.  I did receive nothing but raves!  It was delicious and beautiful. As a matter of facta friend told me it was better than her friend'swho happens to be English.  I especially liked it because it did not call for a pudding mixbut rather a custard from scratchwhich was as easy to make as from a box. It was not difficult to make at all.  I also added frozen berries as well as the strawberrieswhich seemed to only enhance the flavors."
  },
  {
    "_id": 1878,
    "recipe_id": 3193,
    "user_id": 1727,
    "user": "Laniakea",
    "Rating": 5,
    "Review": "Outstanding"
  },
  {
    "_id": 1879,
    "recipe_id": 3195,
    "user_id": 1728,
    "user": "Philip and Karen Se",
    "Rating": 5,
    "Review": "Ilove this recipe ,it is so easy when you have kids. Just mix and serve."
  },
  {
    "_id": 1880,
    "recipe_id": 3196,
    "user_id": 1730,
    "user": "Lintons Seafood",
    "Rating": 5,
    "Review": "I made these muffins to give in my Christmas gift packages. Everyone loved themand including myself. I followed the recipe exactlyand they were easy to make."
  },
  {
    "_id": 1881,
    "recipe_id": 3203,
    "user_id": 1732,
    "user": "David Greene",
    "Rating": 4,
    "Review": "it can be made in 15 min.and i bake mine in 25 min."
  },
  {
    "_id": 1882,
    "recipe_id": 3206,
    "user_id": 1735,
    "user": "Tracey Kehne",
    "Rating": 0,
    "Review": "I need to try this.....This is typical recipe from my Mother's side of the family. \"use this much\" i can not see this much on the phone."
  },
  {
    "_id": 1883,
    "recipe_id": 3208,
    "user_id": 1736,
    "user": "jinx3218",
    "Rating": 4,
    "Review": "This was a very refreshing salad. It''s not time consuming and ingredients were simple. My husband and I are enjoying eating lighter and healthier meals and this one is excellent! Thank You..."
  },
  {
    "_id": 1884,
    "recipe_id": 3209,
    "user_id": 1737,
    "user": "Teddi2",
    "Rating": 0,
    "Review": "Is it possible to rate a recipe MINUS five stars?  I'm in a pinchI log on to find some quick and easy app. recipesand this is what I get.  You people should call yourselves \"recipizarre.com\"  Thanks for being no help at all.  It wasn't even that funny."
  },
  {
    "_id": 1885,
    "recipe_id": 3223,
    "user_id": 1739,
    "user": "Kathleen Wiseman",
    "Rating": 5,
    "Review": "Great recipe!  Several changes might help thicken the soup a bit.  I used half and half instead of plain milk.  Also1 tsp. corn starch mixed with hot water helped to thicken. I added some small cubes of potato and some celery. This makes the soup complete."
  },
  {
    "_id": 1886,
    "recipe_id": 3225,
    "user_id": 1742,
    "user": "Joel Schwarz",
    "Rating": 2,
    "Review": "Thai soup without lemon grass??....don't think so"
  },
  {
    "_id": 1887,
    "recipe_id": 3229,
    "user_id": 1743,
    "user": "Robin Cowdrey",
    "Rating": 4,
    "Review": "I used olive oil instead of lard {I didnt have any in the house} and I only used 1 onion. I think it tuned out great. Thanks for the recipeand I hope to hear from you soon."
  },
  {
    "_id": 1888,
    "recipe_id": 3232,
    "user_id": 1746,
    "user": "Mr. Bill",
    "Rating": 4,
    "Review": "wasn't that bad ??????? why do the always make the chicken so big in the market place."
  },
  {
    "_id": 1889,
    "recipe_id": 3233,
    "user_id": 1747,
    "user": "Gloria Reyes",
    "Rating": 5,
    "Review": "It was a great dish my family loved it I couldn't make as much as I wanted to but I got it finished"
  },
  {
    "_id": 1890,
    "recipe_id": 3235,
    "user_id": 1749,
    "user": "Pam Wood",
    "Rating": 5,
    "Review": "delicious desserta little hard to make when you need something for the same day. Maybe you can find a faster and easier version of this same dessert."
  },
  {
    "_id": 1891,
    "recipe_id": 3238,
    "user_id": 1751,
    "user": "Jjortikka",
    "Rating": 4,
    "Review": "I finally found the recipe for \"Chow Chow Pickles\"."
  },
  {
    "_id": 1892,
    "recipe_id": 3240,
    "user_id": 1754,
    "user": "mark anderson",
    "Rating": 4,
    "Review": "I am a true chocolate pie lover.  I cooked the pie as directed using one deep dish 9\" pie pan and a ready made refrigerated pie crust (next time I will make it with my own crust).  The filling sliced very well and yet it was creamy and delicious.  I made the meringue using the 2 egg whites from the eggs used in the fillingadding 1/4 tsp of cream of tartar and 3 tbsp of sugarand then baking at 400 degrees until golden.  Over all very good."
  },
  {
    "_id": 1893,
    "recipe_id": 3241,
    "user_id": 1756,
    "user": "Stacy L Volpe",
    "Rating": 5,
    "Review": "very healthy scone  great web site thank you ii  have 2 tennage girls so they are into recipes ok thanks once a gain"
  },
  {
    "_id": 1894,
    "recipe_id": 3244,
    "user_id": 1760,
    "user": "Cheryl Thebeau-Blev",
    "Rating": 4,
    "Review": "Very good but not a 5 star"
  },
  {
    "_id": 1895,
    "recipe_id": 3250,
    "user_id": 1761,
    "user": "Moe Martin",
    "Rating": 4,
    "Review": "Very good receipe. The taste is great!"
  },
  {
    "_id": 1896,
    "recipe_id": 3251,
    "user_id": 1762,
    "user": "lkadlec",
    "Rating": 5,
    "Review": "When I was a boy in the 1930s my brother and I would catch bull frogs and father would dispatch and prepare themwe also picked wild button and shaggy main mushroomscleaned all and fried in butterserved on toast and devoured."
  },
  {
    "_id": 1897,
    "recipe_id": 3252,
    "user_id": 1763,
    "user": "Gregg",
    "Rating": 3,
    "Review": "Apparently I got the wrong pork chops for this receipe!!!  I only cooked for 1 1/2 hrs and they were way to dry...if I had cooked for 2 they would have been hockey pukes!!!  The taste was goodbut I would diffently watch the time and cooking of the chops. Maybe just an hourcovered."
  },
  {
    "_id": 1898,
    "recipe_id": 3253,
    "user_id": 1765,
    "user": "STEVE BEDELL",
    "Rating": 5,
    "Review": "I skipped the bread bowls and used fresh italian parsleya little rosemary and thymeand it was great.  Left it chunky too."
  },
  {
    "_id": 1899,
    "recipe_id": 3262,
    "user_id": 1771,
    "user": "Joanne Wallace",
    "Rating": 5,
    "Review": "Great recipe for anyone who like it as close as it come to the real thing! Very simple to make and you can find all the ingredents in your local supermarket! I myself would cut back on the white pepper and add a little bit of hot oil (not to much)! I would also add about 1 1/2 tbls more of vineger. (or to taste) add a little more meat and you can serve with a bowl of white rice with steamed veggies for a meal of its own."
  },
  {
    "_id": 1900,
    "recipe_id": 3263,
    "user_id": 3794,
    "user": "Sally Wolfe",
    "Rating": 5,
    "Review": "My husband and I simply loved this soup. I added half a medium onion to mineand put in four cloves of garlic instead of two. We sprinkled shredded mozzarella cheese on ours before enjoying."
  },
  {
    "_id": 1901,
    "recipe_id": 3268,
    "user_id": 3253,
    "user": "l.lahn",
    "Rating": 2,
    "Review": "This cake didn't rise much.  Also the temperature of 350F. is too high.  The cake burnedpossibly because I used a teflon coated cake pan.  I did turn heat down to 325 but the damaged was already done."
  },
  {
    "_id": 1902,
    "recipe_id": 3270,
    "user_id": 5014,
    "user": "Shelly Head",
    "Rating": 5,
    "Review": "This recipe was simple to make and easy to convert to serve more people.  I like the fact that the ingredients are those usually found in someones pantry and that preparation time was 10 minutes or less to combine and could be left alone in the oven to cook.  Wish all recipes were this easy and delicious.  I will definetly add this to my keeper list."
  },
  {
    "_id": 1903,
    "recipe_id": 3271,
    "user_id": 5148,
    "user": "R Schlei",
    "Rating": 4,
    "Review": "A fantastic version - very fragrant and complex taste.  Highly recommended for those who like spicy eggplant."
  },
  {
    "_id": 1904,
    "recipe_id": 3272,
    "user_id": 2695,
    "user": "Hungarian Gypsy",
    "Rating": 1,
    "Review": "This recipe needs a little help !"
  },
  {
    "_id": 1905,
    "recipe_id": 3273,
    "user_id": 2695,
    "user": "Hungarian Gypsy",
    "Rating": 5,
    "Review": "This dish was excellent.  The sauce turned out wonderful and was an excellent choice for the pork chops !"
  },
  {
    "_id": 1906,
    "recipe_id": 3277,
    "user_id": 4564,
    "user": "mary sharp",
    "Rating": 5,
    "Review": "this is wonderful very easy but i used cooked pudding. has more lemon pie taste"
  },
  {
    "_id": 1907,
    "recipe_id": 3278,
    "user_id": 5199,
    "user": "Karen Fink",
    "Rating": 1,
    "Review": "I think this was the most awfulest punch I have ever tasted hope someone else has better luck!!!!!"
  },
  {
    "_id": 1908,
    "recipe_id": 3283,
    "user_id": 5203,
    "user": "Beverly Balkwell",
    "Rating": 4,
    "Review": "This recipe makes a 2 pound loaf. I used the white bread setting (3 hrs). The loaf was beautifultexture was good. The only thing was my machine destroyed the cherries ( I added them as stated in recipe)."
  },
  {
    "_id": 1909,
    "recipe_id": 3284,
    "user_id": 5264,
    "user": "danny sayre",
    "Rating": 4,
    "Review": "very easy to make,about 5 minutes. the recipe made 9 pancakes 6 inchs round fluffy very light. I was pleased that butter and syrup didn't \"water log\" the cakes. You could add any fruit in this recipe. Overall these were the best I've ever made.  thank you dansa111"
  },
  {
    "_id": 1910,
    "recipe_id": 3288,
    "user_id": 5280,
    "user": "Anita Novotny",
    "Rating": 4,
    "Review": "This casserole was very tasty but a little time consuming to prepare. Next time I know we are going to have this dish (and we definitally will be having it again) I will do the prep work ahead of time."
  },
  {
    "_id": 1911,
    "recipe_id": 3290,
    "user_id": 5285,
    "user": "Michael Dahlquist",
    "Rating": 3,
    "Review": "It's between three and four starsreally. Easy to make and good tastin'. It's stick-to-your-ribs stuffit's like chicken paellaand that's pretty good. I am glad I made itI will make it againit will be my lunch for the next three weeks."
  },
  {
    "_id": 1912,
    "recipe_id": 3293,
    "user_id": 5142,
    "user": "Catcooks123",
    "Rating": 4,
    "Review": "I wanted a new way to prepare thick pork chops for my family ,and this was really good. I used Lawerys season salt instead of accentand salt. The gravy smelled a little like a marsala sauce. The meat was so tender this wayso much better than dried out broiled thick pork chops."
  },
  {
    "_id": 1913,
    "recipe_id": 3296,
    "user_id": 5328,
    "user": "Janie Woodall",
    "Rating": 5,
    "Review": "I used Cream of chicken instead of mushroom and it was wonderful !!! My whole family loved it !!"
  },
  {
    "_id": 1914,
    "recipe_id": 3304,
    "user_id": 4884,
    "user": "Carmen",
    "Rating": 5,
    "Review": "Baklava is in fact Greek..I moved from Greece a little over 3 years ago and therefore your feeble-minded Turkish opinion means nothing."
  },
  {
    "_id": 1915,
    "recipe_id": 3305,
    "user_id": 5227,
    "user": "rhonda lambert",
    "Rating": 4,
    "Review": "my family like the bamboo shoots whole. but we love your recipe"
  },
  {
    "_id": 1916,
    "recipe_id": 3308,
    "user_id": 5227,
    "user": "rhonda lambert",
    "Rating": 4,
    "Review": "the lemon rind made it tastier. great recipe"
  },
  {
    "_id": 1917,
    "recipe_id": 3309,
    "user_id": 3858,
    "user": "Vicki Summers",
    "Rating": 4,
    "Review": "No kidding - stir almost constantly. We really liked it. Warmed well in the microwave."
  },
  {
    "_id": 1918,
    "recipe_id": 3312,
    "user_id": 5357,
    "user": "Jeanne H",
    "Rating": 5,
    "Review": "This is the best way to serve shoepeg corn there is...we make the same recipe but use two cans of the shoepeg cornand no beans.  It's yummy for Thanksgiving."
  },
  {
    "_id": 1919,
    "recipe_id": 3313,
    "user_id": 5355,
    "user": "Rena Reeve",
    "Rating": 5,
    "Review": "I made this bread with a little milk (instead of dry milk) and a little coffee (instead of instant).  AlsoI made it using my mixer with dough hook instead of a bread machine.  It worked very well.  Best pumpernickel I have tasted!"
  },
  {
    "_id": 1920,
    "recipe_id": 3315,
    "user_id": 5420,
    "user": "Andrew Murray",
    "Rating": 2,
    "Review": "Why do you have to bake pork chops,this is a B.B.Q recipe. Depending on the size and the amount of time to marinate,they shouldn't be more than 15-20 minutes on the B.B.Q"
  },
  {
    "_id": 1921,
    "recipe_id": 3318,
    "user_id": 5090,
    "user": "Marcia Detrick",
    "Rating": 5,
    "Review": "Just the type recipe I came to this site for. I am going to take this to a Super Bowl party on Sunday"
  },
  {
    "_id": 1922,
    "recipe_id": 3319,
    "user_id": 4925,
    "user": "christine story",
    "Rating": 5,
    "Review": "We really like this dipit''s creamy & tasty.  I added a little more green onions (including the tops)& some garlic powder (I put that in just about everything that I think it would add a little more zingplus it''s good for you)."
  },
  {
    "_id": 1923,
    "recipe_id": 3325,
    "user_id": 5398,
    "user": "gary gierloff",
    "Rating": 5,
    "Review": "if you love clams and garlic you will love this recipe. I plan to make large quanties for the upcoming superbowl party at the hitchin post in salem oregon.go ravens."
  },
  {
    "_id": 1924,
    "recipe_id": 3327,
    "user_id": 5385,
    "user": "Cristina Stanfill",
    "Rating": 3,
    "Review": "Be aware that this is the EXACT recipe that is printed in the booklet that comes with a new crockpot."
  },
  {
    "_id": 1925,
    "recipe_id": 3329,
    "user_id": 5471,
    "user": "Olivia Cato",
    "Rating": 3,
    "Review": "It was pretty goodbut then again I was really hungry.  Needs more chicken and more cheese."
  },
  {
    "_id": 1926,
    "recipe_id": 3330,
    "user_id": 5461,
    "user": "Sarah Stluka",
    "Rating": 5,
    "Review": "This casserole is the best I have ever had.  My grandmother makes it for Christmas every year and I just had to have the recipe."
  },
  {
    "_id": 1927,
    "recipe_id": 3331,
    "user_id": 5049,
    "user": "Cynthia Caffey Schw",
    "Rating": 4,
    "Review": "This is easy and very good.  Our family loved it."
  },
  {
    "_id": 1928,
    "recipe_id": 3336,
    "user_id": 5049,
    "user": "Cynthia Caffey Schw",
    "Rating": 3,
    "Review": "This was easy to makebut when mashing the potatoes and garlicbe sure to get the garlic mashed.  It is hard to find it in the potatoesso you need to mash it all well.  The taste is subtlebut true.  You may want to add a little more butter and salt."
  },
  {
    "_id": 1929,
    "recipe_id": 3337,
    "user_id": 1773,
    "user": "Malarkey Test",
    "Rating": 3,
    "Review": "this was okay.  too greasy for my tastes."
  },
  {
    "_id": 1930,
    "recipe_id": 3341,
    "user_id": 4105,
    "user": "Bill de Bruler",
    "Rating": 4,
    "Review": "I would rate this one a five-star if the hot pepper flakes were omitted. I would omit the hot pepper flakes and use 3 cans of tomatoes and add 1 can of tomato and green chile's. Also for the next time I prepare the recipe I will devein and shell the shrimp then sprinkle cajun spice mix and let the shrimp marinate in it. If anyone attempts this recipe and uses 1/4 cup of the hot pepper flakes you will probably not be able to eat it if you cannot handle hot and spicy food. Believe me I am an amateur Cajun Chef and I could eat the dish but most people could not handle it. I will make this dish because it is rather quick and it is a one dish meal. I will however change it as stated in the beginning of this comment/rating."
  },
  {
    "_id": 1931,
    "recipe_id": 3345,
    "user_id": 5446,
    "user": "Fedelma Dixon",
    "Rating": 3,
    "Review": "No vanilla?  No butter?  Wasn't sure what to do about thatbut the pie is good."
  },
  {
    "_id": 1932,
    "recipe_id": 3347,
    "user_id": 3856,
    "user": "jonathan armytage",
    "Rating": 3,
    "Review": "average taste. Not particularly subtle"
  },
  {
    "_id": 1933,
    "recipe_id": 3351,
    "user_id": 5049,
    "user": "Cynthia Caffey Schw",
    "Rating": 5,
    "Review": "First of allI used a 4 pound pork tenderloininstead of 1 pound.  It took 1 hour to bakeso not much longer and was 170 degrees inside.  NextI didn't have the time to marinade overnightso I used garlic powder and marinaded for about 20 minutes.  It turned out wonderful.  Probably the best pork we have had.  It was tendermoist and flavorful.  I also substituted black pepper for white pepper."
  },
  {
    "_id": 1934,
    "recipe_id": 3352,
    "user_id": 5235,
    "user": "LJ S3213",
    "Rating": 4,
    "Review": "absolutely fabulousreceived high praise from family members."
  },
  {
    "_id": 1935,
    "recipe_id": 3353,
    "user_id": 5355,
    "user": "Rena Reeve",
    "Rating": 0,
    "Review": "I recommend this recipe because I've eaten these muffins many times.  These muffins taste great heated in the micro and then covered with natural applesauce.  A little cinnamon sugar on top makes it the perfect breakfast treat!"
  },
  {
    "_id": 1936,
    "recipe_id": 3354,
    "user_id": 5484,
    "user": "Deidre Gilbert",
    "Rating": 5,
    "Review": "After extensive research on turkey soup recipesyou were my first choice.  Now your turkey soup has become \"Deidre's famous turkey soup\".  I have a stomach condition that requires soup on a daily basis and having previously not liked soupthis was a difficult step for me.  But your recipe has converted me into a soup lover.  It works great for chicken too.  Thank you for adding spicesherbs and FLAVOUR to your recipe.  It really is different and great tasting.  Your efforts to get this out to people like me is very much appreciated."
  },
  {
    "_id": 1937,
    "recipe_id": 3358,
    "user_id": 5495,
    "user": "annaclaire crocco",
    "Rating": 4,
    "Review": "great when sprinkled with grated parmasaen cheese just before serving!"
  },
  {
    "_id": 1938,
    "recipe_id": 3360,
    "user_id": 1773,
    "user": "Malarkey Test",
    "Rating": 4,
    "Review": "interesting. i added celery and some cilantro.  i think i made it a bit too hot though."
  },
  {
    "_id": 1939,
    "recipe_id": 3361,
    "user_id": 5503,
    "user": "Jules Yoken",
    "Rating": 0,
    "Review": "Sounds a bit like Bigos"
  },
  {
    "_id": 1940,
    "recipe_id": 3362,
    "user_id": 5285,
    "user": "Michael Dahlquist",
    "Rating": 3,
    "Review": "Basicsimple - but it's goodand taught me a thing or two about making good thai (?) soup - never cooked with lemon grassbut it was yummy. Simple to make and wholesome and creamy without dairyI'd forgotten the charms of coconut milk."
  },
  {
    "_id": 1941,
    "recipe_id": 3369,
    "user_id": 5519,
    "user": "amity bradley",
    "Rating": 5,
    "Review": "My boyfriend and i were very pleased with this recipe. he is half chinese so he knows the good stuff. the only thing we changed was the amount of chili paste. we only put one tablespoon instead of 2. the soup is very very spicy with 2 tblsp's. other than that it was great. the flavor is awesome. my boyfriend said that it tasted just like his mom's. that is a great compliment."
  },
  {
    "_id": 1942,
    "recipe_id": 3371,
    "user_id": 5681,
    "user": "ravindra mandagere",
    "Rating": 3,
    "Review": "the baking time of 1 hour at 300 degrees plus"
  },
  {
    "_id": 1943,
    "recipe_id": 3372,
    "user_id": 5683,
    "user": "Patricia Fitzgerald",
    "Rating": 4,
    "Review": "Suggestion:  Subsitiution for bread crumbs. You can also use Cereal(corn-flakes)Crackers,and sometimes you can use Corn chips to."
  },
  {
    "_id": 1944,
    "recipe_id": 3373,
    "user_id": 5689,
    "user": "Berevaline Windsor",
    "Rating": 5,
    "Review": "Wow!!!  Egyptian food!!!  Cool!!!"
  },
  {
    "_id": 1945,
    "recipe_id": 3376,
    "user_id": 5686,
    "user": "Mariya Davis",
    "Rating": 5,
    "Review": "The dish is wonderful! It so easy to makeit takes 15-20 min :). Also I like to serve it with butter and sour cream. Everytime I cook Spaetzle my husband ask if there anything is left. ThoughI always cook more. Tryand you''ll see how easy and delicious it is!"
  },
  {
    "_id": 1946,
    "recipe_id": 3383,
    "user_id": 5704,
    "user": "Francesca Tabaranza",
    "Rating": 4,
    "Review": "Variationinstead of vinegar use freshly squeezed lemon juice."
  },
  {
    "_id": 1947,
    "recipe_id": 3392,
    "user_id": 5523,
    "user": "Dave C",
    "Rating": 4,
    "Review": "This looks good. My grandkids will love me. thanks.  :>))"
  },
  {
    "_id": 1948,
    "recipe_id": 3394,
    "user_id": 1872,
    "user": "Lisa Rittel",
    "Rating": 5,
    "Review": "I have had this before. It has really good flavor!Be sure to use salted pretzelsthey really make the dish good."
  },
  {
    "_id": 1949,
    "recipe_id": 3403,
    "user_id": 1873,
    "user": "Leslie Ashenfelter",
    "Rating": 5,
    "Review": "It was delicious. And very easy too. Even a little kid could make it."
  },
  {
    "_id": 1950,
    "recipe_id": 3409,
    "user_id": 1886,
    "user": "HELEN PEAGRAM",
    "Rating": 5,
    "Review": "It was DELICIOUS and so easy too. My six year old niece even made it herself. It is such a healthy snack."
  },
  {
    "_id": 1951,
    "recipe_id": 3410,
    "user_id": 1887,
    "user": "Vicky Sinclair",
    "Rating": 5,
    "Review": "Hello!  My family used to use chicken feet in our soup and it was wonderful.  I was raised on a grain and dairy farmwe raised everythingprocessed our own meatcanned all our own vegetables etc.  It's so nice to come across all these wonderful recipes.  June Bug"
  },
  {
    "_id": 1952,
    "recipe_id": 3411,
    "user_id": 1889,
    "user": "spam4409",
    "Rating": 0,
    "Review": "I had a Great Aunt that made the most wonderful dill pickles she told me that her secret was that she used rain water.  How interesting.  June Bug"
  },
  {
    "_id": 1953,
    "recipe_id": 3412,
    "user_id": 1893,
    "user": "Pam Whitmire",
    "Rating": 5,
    "Review": "As a helper of a girl scout troopone of a projects to earn a badge was to prepare an ethnic meal.  We chose and Italian meal and for dessert we chose these cookies.  The girls really enjoyed making and EATING them.  We got about 5 1/2 dozen cookies from a batch.  Thanks for a really wonderful and delicious recipe."
  },
  {
    "_id": 1954,
    "recipe_id": 3413,
    "user_id": 2178,
    "user": "troyh",
    "Rating": 5,
    "Review": "awesome....kids loved it!!!!!"
  },
  {
    "_id": 1955,
    "recipe_id": 3415,
    "user_id": 10033,
    "user": "spatchcock",
    "Rating": 0,
    "Review": "This is a great recipe that's too easy."
  },
  {
    "_id": 1956,
    "recipe_id": 3416,
    "user_id": 22015,
    "user": "Mysterygirl",
    "Rating": 4,
    "Review": "This recipe was very easy to makeand it turned out great! The cooking temperature was not specifiedso I used 350 degrees. AlsoI subbed low fat ricotta cheese for cottage cheese because I prefer the taste."
  },
  {
    "_id": 1957,
    "recipe_id": 3417,
    "user_id": 25843,
    "user": "Crab Place",
    "Rating": 5,
    "Review": "Easy to follow recipe.  Wonderful taste. Had no problems with cake or blueberrys sticking to pan."
  },
  {
    "_id": 1958,
    "recipe_id": 3418,
    "user_id": 28729,
    "user": "Auntie Jan",
    "Rating": 5,
    "Review": "I haven't made this as yettoday is Feb. 18,2001but I boiled the carcass of a turkey and the ingredients you have listed just fit us to a tee.  I just happened on this site looking for a quickeasytasty soup.  I am rating it even though I haven't tasted it yet.  I can just tell by the ingredients. I would serve it with crusty bread and a nice light white wine.  Preferably Gallo's white Zinfandel.  Nice going!!"
  },
  {
    "_id": 1959,
    "recipe_id": 3419,
    "user_id": 34879,
    "user": "Barefoot Beachcomber",
    "Rating": 4,
    "Review": "I have made these and they are deliciousI also have made them with the Cherry"
  },
  {
    "_id": 1960,
    "recipe_id": 3421,
    "user_id": 35526,
    "user": "riffraff",
    "Rating": 4,
    "Review": "We cut up some chorizo (instead of andouille) and put it into the sauceand used it on chicken. It was greatbut with a salty sausage like chorizousing the recommended amount of salt in the recipe was a little too much. I would definitely reccomend this for anyone who loves barbeque!"
  },
  {
    "_id": 1961,
    "recipe_id": 3423,
    "user_id": 35635,
    "user": "_Pixie_",
    "Rating": 2,
    "Review": "Wayway too lemony.  I ate about half of my meal and vowed never to eat anything with lemon in it again.  I marinated overnight...  Bad idea!  I imagine this recipe could be great with a little tweaking."
  },
  {
    "_id": 1962,
    "recipe_id": 3425,
    "user_id": 39194,
    "user": "OzMan",
    "Rating": 2,
    "Review": "I love Red Lobster caesar salad dressing.  I have looked the net over to find a recipe that tastes like it.  This recipe is alrightbut to me still tastes NOTHING like Red Lobster's caesar dressing.  Guess I'll keep looking."
  },
  {
    "_id": 1963,
    "recipe_id": 3426,
    "user_id": 39547,
    "user": "Julesong",
    "Rating": 4,
    "Review": "Add a drop or two of Tabasco sauce to each one to give them a little kick.  I put the Tabasco sauce on top of the cream cheese layer.  Try ityou'll like it."
  },
  {
    "_id": 1964,
    "recipe_id": 3427,
    "user_id": 39636,
    "user": "Chrissyo",
    "Rating": 4,
    "Review": "very good,easy to follow"
  },
  {
    "_id": 1965,
    "recipe_id": 3429,
    "user_id": 47510,
    "user": "Dreamgoddess",
    "Rating": 4,
    "Review": "This was easy to make and very YUMMY!"
  },
  {
    "_id": 1966,
    "recipe_id": 3444,
    "user_id": 51011,
    "user": "Loves2Teach",
    "Rating": 5,
    "Review": "This is a great recipe....It didn't take too much time to prepare and the final results were delicious!"
  },
  {
    "_id": 1967,
    "recipe_id": 3445,
    "user_id": 51109,
    "user": "Vina7737",
    "Rating": 2,
    "Review": "I thought the gingerstar anise and parsnips are some of the most important ingredients in the soup.  I have read the recipe many times to find out when to add those ingredients.  No luck.  Can't find it."
  },
  {
    "_id": 1968,
    "recipe_id": 3448,
    "user_id": 52448,
    "user": "PetsRus",
    "Rating": 5,
    "Review": "i thought that this was really really yummy."
  },
  {
    "_id": 1969,
    "recipe_id": 3449,
    "user_id": 55166,
    "user": "peppermintkitty",
    "Rating": 4,
    "Review": "This was really goodhoweverI left out the turnips due to a family memebers dislikebut added 2 tblsp of worshirer sauce. YUM!!!"
  },
  {
    "_id": 1970,
    "recipe_id": 3450,
    "user_id": 56112,
    "user": "Jellyqueen",
    "Rating": 0,
    "Review": "I would just like to say that this recipe comes from the cookbookThe Complete Soy Cookbookby Paulette Mitchell."
  },
  {
    "_id": 1971,
    "recipe_id": 3464,
    "user_id": 64203,
    "user": "Dine  Dish",
    "Rating": 0,
    "Review": "This is a great recipe! Try serving with hollandaise sauce."
  },
  {
    "_id": 1972,
    "recipe_id": 3465,
    "user_id": 1530,
    "user": "Carole Reu",
    "Rating": 5,
    "Review": "better than any you can get at a restaurant!"
  },
  {
    "_id": 1973,
    "recipe_id": 3466,
    "user_id": 1531,
    "user": "Mimi Hiller",
    "Rating": 4,
    "Review": "I cut back on the mayoand made up the difference with sour cream to adjust the stiffness of the dip."
  },
  {
    "_id": 1974,
    "recipe_id": 3467,
    "user_id": 1533,
    "user": "Dancer",
    "Rating": 5,
    "Review": "easily the best i have ever had.  juicy flavorfulnot dry.  the vegetables retain crispness as wellnot bland at all!"
  },
  {
    "_id": 1975,
    "recipe_id": 3471,
    "user_id": 1534,
    "user": "Tonkcats",
    "Rating": 0,
    "Review": "Would someone please check the Nutrition Facts of this recipe."
  },
  {
    "_id": 1976,
    "recipe_id": 3484,
    "user_id": 1535,
    "user": "Marg CaymanDesigns",
    "Rating": 4,
    "Review": "a little greasybut a huge hit with the guests."
  },
  {
    "_id": 1977,
    "recipe_id": 3486,
    "user_id": 1537,
    "user": "Barbara5",
    "Rating": 5,
    "Review": "leeks on a pizza?!  it was really delicious.  i used a boboli and added some chicken sausage slices and mushrooms too."
  },
  {
    "_id": 1978,
    "recipe_id": 3490,
    "user_id": 1538,
    "user": "Duckie067",
    "Rating": 5,
    "Review": "I deleted the bean sprouts and replaced them with salted cashew nuts...a nice complement to the sweet/sour dressing. Our guests loved itin my opinion,it deserves a \"5-pan\" rating."
  },
  {
    "_id": 1979,
    "recipe_id": 3491,
    "user_id": 1539,
    "user": "opal Fitzgerald",
    "Rating": 1,
    "Review": "Where does the bbq come in"
  },
  {
    "_id": 1980,
    "recipe_id": 3492,
    "user_id": 1542,
    "user": "ann joy",
    "Rating": 3,
    "Review": "It is a good recipe...but I believe that it would be better if it had raisins included  :)"
  },
  {
    "_id": 1981,
    "recipe_id": 3501,
    "user_id": 1543,
    "user": "Doreen Randal",
    "Rating": 2,
    "Review": "This recipe is called pumpkin squareswheres the squares? ITS A PIE !"
  },
  {
    "_id": 1982,
    "recipe_id": 3502,
    "user_id": 1544,
    "user": "tranch",
    "Rating": 3,
    "Review": "Careful not to cook it too long... you want the tuna to be closer to raw on the inside and crusty on the outside. Maybe use canola oil instead of butter to help sear the outside."
  },
  {
    "_id": 1983,
    "recipe_id": 3503,
    "user_id": 1545,
    "user": "Nancy Van Ess",
    "Rating": 4,
    "Review": "Took about 70 minutes to bake."
  },
  {
    "_id": 1984,
    "recipe_id": 3505,
    "user_id": 1546,
    "user": "Jane McCLure",
    "Rating": 5,
    "Review": "These have been an absolute hit with everyone every time I have made them.  They are incredibly easy to make and just heavenly!"
  },
  {
    "_id": 1985,
    "recipe_id": 3506,
    "user_id": 1547,
    "user": "Morton Design Graph",
    "Rating": 5,
    "Review": "Working 12 hour days 7 days a weekI was delighted to return home to a delious meal from my Crockpot.  Easy tastyand delious are understatements for this recipe!"
  },
  {
    "_id": 1986,
    "recipe_id": 3507,
    "user_id": 1548,
    "user": "Peggy Benisch",
    "Rating": 5,
    "Review": "I think this recipie is awesome. It tastes delicious and my whole family loved it."
  },
  {
    "_id": 1987,
    "recipe_id": 3509,
    "user_id": 1549,
    "user": "Dave5003",
    "Rating": 5,
    "Review": "if you like oystersthis is a great alternative to regularboring stuffing."
  },
  {
    "_id": 1988,
    "recipe_id": 3511,
    "user_id": 1550,
    "user": "Linda Sundbye",
    "Rating": 5,
    "Review": "quite easy to make make the taste is not bad either. i'd love to make it again and again with different toppings."
  },
  {
    "_id": 1989,
    "recipe_id": 3512,
    "user_id": 1551,
    "user": "Sean Coate",
    "Rating": 0,
    "Review": "I thought Chicken Cacciatore had peppers. If i were to make thisit would contain about 5-6 cut up peppers1 can tomato paste and a large can of crushed tomatoes and of course the chicken."
  },
  {
    "_id": 1990,
    "recipe_id": 3513,
    "user_id": 1552,
    "user": "Ron  Joyce Ripple S",
    "Rating": 5,
    "Review": "These make a wonderful healthy snack."
  },
  {
    "_id": 1991,
    "recipe_id": 3514,
    "user_id": 1554,
    "user": "Jacques Lorrain",
    "Rating": 5,
    "Review": "This is a wonderful recipebut last I knew it was from the famous Chef David Ruggerio actually from his grandmother....so I think he deserves the credit."
  },
  {
    "_id": 1992,
    "recipe_id": 3518,
    "user_id": 1555,
    "user": "Cindy Hartlin",
    "Rating": 3,
    "Review": "It's a tasty dish."
  },
  {
    "_id": 1993,
    "recipe_id": 3519,
    "user_id": 1556,
    "user": "Strawberry Girl",
    "Rating": 3,
    "Review": "tasty. you can substitute granulated sugar for the palm sugar."
  },
  {
    "_id": 1994,
    "recipe_id": 3520,
    "user_id": 1557,
    "user": "Angel Villanueva",
    "Rating": 4,
    "Review": "This is a lovely little repice. Quite delicious. However I recommend you cook the chicken breasts slowly and don't add the honey glaze until the last 4 to 5 minutes of cooking as it burns very quickly. Keping that in mindPlease try this quick and easy recipe. :)"
  },
  {
    "_id": 1995,
    "recipe_id": 3521,
    "user_id": 1558,
    "user": "S. Malcolm",
    "Rating": 0,
    "Review": "Terrible directions. Doesn't say how to make the dough or the filling."
  },
  {
    "_id": 1996,
    "recipe_id": 3527,
    "user_id": 1559,
    "user": "Will Parkinson",
    "Rating": 5,
    "Review": "It looks fabulousand will go great with my fresh cranberries from Eagle River WI."
  },
  {
    "_id": 1997,
    "recipe_id": 3528,
    "user_id": 1562,
    "user": "Libby1",
    "Rating": 4,
    "Review": "needs more spice."
  },
  {
    "_id": 1998,
    "recipe_id": 3532,
    "user_id": 1564,
    "user": "Ginny Holmy-Willcox",
    "Rating": 5,
    "Review": "I know that this recipe sounds strangebut I've tried it and it is the best fudge that I've ever had.  It's not too sweet like most areit stays soft (even after a few days). You must try ityou won't believe it!"
  },
  {
    "_id": 1999,
    "recipe_id": 3539,
    "user_id": 1567,
    "user": "elly9812",
    "Rating": 4,
    "Review": "My husband LOVES this stuff.  It was the only thing he requested I make for Thanksgiving. The recipe is easy and if it makes him happy I'll keep making it."
  },
  {
    "_id": 2000,
    "recipe_id": 3542,
    "user_id": 1569,
    "user": "Linda7",
    "Rating": 1,
    "Review": "Not much Effort."
  },
  {
    "_id": 2001,
    "recipe_id": 3544,
    "user_id": 1570,
    "user": "Dave Miner",
    "Rating": 5,
    "Review": "This is the best pie crust I have ever made.  It is simple and easy.  I have tried to make it fail but can not.  The taste and texture is wonderful."
  },
  {
    "_id": 2002,
    "recipe_id": 3556,
    "user_id": 1571,
    "user": "Linda Johansen",
    "Rating": 5,
    "Review": "Our family has enjoyed this recipetime and time again with great success. Favorite topping for this is to serve with chiligrated cheese and onions. The kids love it simply with catsup."
  },
  {
    "_id": 2003,
    "recipe_id": 3572,
    "user_id": 1572,
    "user": "Ed Paulhus",
    "Rating": 4,
    "Review": "This recipie would be 5 STARS if you top it before you bake it with1 C crushed corn flakes1/2 C brown sugar1/4 chopped pecans4 Tbsp butter and a Tbsp of flour and bake as directed. Topping is about accurateto the best of my memorydefinately try....This is a Thanksgiving MUSTand NO ONE will believe it is carrots!!!!!!"
  },
  {
    "_id": 2004,
    "recipe_id": 3573,
    "user_id": 1573,
    "user": "benluc",
    "Rating": 1,
    "Review": "This dish was good the first few bites then it got a vinager taste. I wont make it again"
  },
  {
    "_id": 2005,
    "recipe_id": 3574,
    "user_id": 1530,
    "user": "Carole Reu",
    "Rating": 5,
    "Review": "This is a great quick,easy,tasy cheescake."
  },
  {
    "_id": 2006,
    "recipe_id": 3575,
    "user_id": 1531,
    "user": "Mimi Hiller",
    "Rating": 4,
    "Review": "I found this meat loaf to be quite tastyI was a little nervous about the carrots,but it made it sweeter than I have tasted in a meat loaf. The measurements were a little over it made a rather large loaf and took a lot longer to cook. I had to raise the temp to 400 to get it to cook at a faster rate. It also gave off a lot of liquid and I used extra lean meat. It made about eight servings and all together was a good meat loaf. I would defintely make it again."
  },
  {
    "_id": 2007,
    "recipe_id": 3576,
    "user_id": 1533,
    "user": "Dancer",
    "Rating": 5,
    "Review": "A lot of people at our baby shower said how much they liked this punch.  Even one person said that they didn't like champagne but they loved this punch.  It had a nice fruity flavor and pretty color.  This one will go in my recipe file.  I couldn't find the frozen pineapple-orange-guava juice so I went with pineapple-orange.  Thanks for this wonderful recipe that was definitely a hit!"
  },
  {
    "_id": 2008,
    "recipe_id": 3580,
    "user_id": 1534,
    "user": "Tonkcats",
    "Rating": 5,
    "Review": "I made this casserole using light cream of celerylight sour creamlight Ritz crackers and light cheddar.  It still came out wonderful! Great alternative to the same old green bean casserole."
  },
  {
    "_id": 2009,
    "recipe_id": 3581,
    "user_id": 1535,
    "user": "Marg CaymanDesigns",
    "Rating": 4,
    "Review": "Will go great with Thangsgiving meal."
  },
  {
    "_id": 2010,
    "recipe_id": 3584,
    "user_id": 1537,
    "user": "Barbara5",
    "Rating": 3,
    "Review": "Simple and easy to prepare."
  },
  {
    "_id": 2011,
    "recipe_id": 3587,
    "user_id": 1538,
    "user": "Duckie067",
    "Rating": 5,
    "Review": "she loved it"
  },
  {
    "_id": 2012,
    "recipe_id": 3588,
    "user_id": 1539,
    "user": "opal Fitzgerald",
    "Rating": 3,
    "Review": "I just had to make this magic food of song (at least as sung by SharenLois and Bram).  I must say that I usually don't  like walnutsbut they were great in this.  This was very tastythough not as rich as I might have guessed.  It was somewhat  sweeter than I normally likebut I did not leave any in the bowl. The upside down presentation is showy.  I recommend some very rich ice cream as a topping or side dish (Blue Bell Homemade Vanilla  Ice Cream fills the bill in my neck of the woods).  Fun and tasty."
  },
  {
    "_id": 2013,
    "recipe_id": 3589,
    "user_id": 1542,
    "user": "ann joy",
    "Rating": 5,
    "Review": "I would reccomend this recipe to any one that doesn't like pumpkin pieit is a delicious substitute. The pumkin rolls are almost like cinnamon rolls except for the taste.  I reccomend this recipe to every one."
  },
  {
    "_id": 2014,
    "recipe_id": 3593,
    "user_id": 1543,
    "user": "Doreen Randal",
    "Rating": 0,
    "Review": "makes 2- 9inch pies  or 1 deep dish pie"
  },
  {
    "_id": 2015,
    "recipe_id": 3602,
    "user_id": 1544,
    "user": "tranch",
    "Rating": 5,
    "Review": "I recently tried this recipe and got rave reviews from family and friends!"
  },
  {
    "_id": 2016,
    "recipe_id": 3606,
    "user_id": 1545,
    "user": "Nancy Van Ess",
    "Rating": 3,
    "Review": "I came upon this recipe while searching for a sweet potato topping. I didn't like the recipe for the potato itself because it would have been much to sweet and \"heavy\" for my tastes. I did enjoy the topping very muchthough. I topped plainbuttered sweet potatoes with it and they were quite good."
  },
  {
    "_id": 2017,
    "recipe_id": 3616,
    "user_id": 1546,
    "user": "Jane McCLure",
    "Rating": 3,
    "Review": "Where's the Nutmeg And the Cinnamon?"
  },
  {
    "_id": 2018,
    "recipe_id": 3617,
    "user_id": 1547,
    "user": "Morton Design Graph",
    "Rating": 5,
    "Review": "My wife made this recipie for Thanksgiving today and the whole family agreed it was the best food on the whole table."
  },
  {
    "_id": 2019,
    "recipe_id": 3620,
    "user_id": 1548,
    "user": "Peggy Benisch",
    "Rating": 5,
    "Review": "The Turkey was wonderful!!! My Husband thought I was crazy when he read the note I left him in the morning when he got up to put it in the oven. when I pulled it out of the oven he said it was the prettiest Turkey he had ever seenBut said lets wait to see what it taste like. when he tried it at my parents he loved it and made sure every one know he was the one who cooked it since he was the one who put it in the oven"
  },
  {
    "_id": 2020,
    "recipe_id": 3621,
    "user_id": 1549,
    "user": "Dave5003",
    "Rating": 5,
    "Review": "Muffins were simply excellent!  Easy to preparemoist and so tasty!  We started out by reducing the recipe for only 4 servings...after the first muffin was gonewe started the second batch (increasing to 12 servings!).  ENJOY!"
  },
  {
    "_id": 2021,
    "recipe_id": 3622,
    "user_id": 1550,
    "user": "Linda Sundbye",
    "Rating": 2,
    "Review": "Recipe did not result in expected product.  Noodles were BLAHdid not hold form well.  By farthis is not one of the better recipes I have used for Spatzel.  A little tweaking is required.  Most likely I will stick with my Grandmother Stroud''s tried and true recipe."
  },
  {
    "_id": 2022,
    "recipe_id": 3623,
    "user_id": 1551,
    "user": "Sean Coate",
    "Rating": 5,
    "Review": "Excellent and great tasting.  Easy prep!!!!! My guest loved it!   :-)"
  },
  {
    "_id": 2023,
    "recipe_id": 3632,
    "user_id": 1552,
    "user": "Ron  Joyce Ripple S",
    "Rating": 1,
    "Review": "Onions and whiskey overpowered the sauce.  Not at all similar to TGI Friday's mariande."
  },
  {
    "_id": 2024,
    "recipe_id": 3635,
    "user_id": 1554,
    "user": "Jacques Lorrain",
    "Rating": 2,
    "Review": "Goodstraight forward side dish.  Howeverthe author of the recipe forgot to list the sour cream in the list of ingredients.  Thanksgiving morning I was preparing my casserole and got to the part where I was supposed to add it.  I substituted some extra broth to make up for itbut it still ended up dry and gooey.  My advicedon't try anything new on a holiday."
  },
  {
    "_id": 2025,
    "recipe_id": 3646,
    "user_id": 1555,
    "user": "Cindy Hartlin",
    "Rating": 4,
    "Review": "very good   made it with and without the vodka"
  },
  {
    "_id": 2026,
    "recipe_id": 3656,
    "user_id": 1556,
    "user": "Strawberry Girl",
    "Rating": 4,
    "Review": "I ended up adapting this to make a kind of taco instead of baking it as enchiladasbut we liked it quite a bit."
  },
  {
    "_id": 2027,
    "recipe_id": 3658,
    "user_id": 1557,
    "user": "Angel Villanueva",
    "Rating": 4,
    "Review": "It was a good recipebut I felt it needed a little garlic. My son said it was just like he had it in a restaurant. (which in our neighborhood is a great restuarant).  Bravo great stuff."
  },
  {
    "_id": 2028,
    "recipe_id": 3659,
    "user_id": 1558,
    "user": "S. Malcolm",
    "Rating": 5,
    "Review": "I served this recipeCherry Cheese Salad at our community dinner for 60 people. It was a hit. It is a wonderfulrefreshing salad. It seems to come alive in your mouth when all the flavors hit the taste buds. Great recipe!"
  },
  {
    "_id": 2029,
    "recipe_id": 3664,
    "user_id": 1559,
    "user": "Will Parkinson",
    "Rating": 4,
    "Review": "This is great.  Very similar to apple butterand cans in jars very well.  My family loved itas well as some friends I gave it to.  This is a neat way to use the pumpkins left over from halloween or thanksgiving time."
  },
  {
    "_id": 2030,
    "recipe_id": 3665,
    "user_id": 1562,
    "user": "Libby1",
    "Rating": 0,
    "Review": "This is in fact not a Greek dishbut Turkish.  \"Dolma\" means \"StuffingStuffed\" in Turkish and the origins of this dish go back to authentic Ottoman Imperial Cuisine. In fact there are very many other stuffed vegetable dishes in the Turkish Cuisinesuch as eggplantsarthichokesmarrow(zuccihini) and its blossomspotatoes etc.  This termstuffedis also used for dishes where chickenturkey and the like are stuffed with various ingredientsmainly ricebefore cooking usually in the oven."
  },
  {
    "_id": 2031,
    "recipe_id": 3666,
    "user_id": 1564,
    "user": "Ginny Holmy-Willcox",
    "Rating": 0,
    "Review": "Baklava is definitely not Greekbut Turkish.  It was the prime dessert in the Ottoman Cuisine and a feast never ended without a serving.  In fact the word itself is Turkishmeaning \"diamond-shaped\" which was the way in which the pastry was cut before serving. Generally walnutspistachios and other nuts are used for the filling."
  },
  {
    "_id": 2032,
    "recipe_id": 3667,
    "user_id": 1567,
    "user": "elly9812",
    "Rating": 0,
    "Review": "This dishwith slight variations (usually lemon juice is used) is very common in Middle Eastern Countries and should not be categorised as Greekbut \"collective\".  I suspect that it is in fact Lebanese."
  },
  {
    "_id": 2033,
    "recipe_id": 3669,
    "user_id": 1569,
    "user": "Linda7",
    "Rating": 5,
    "Review": "This is a great recipe I made it for my family soon it will be served in my restaurants."
  },
  {
    "_id": 2034,
    "recipe_id": 3670,
    "user_id": 1570,
    "user": "Dave Miner",
    "Rating": 2,
    "Review": "This recipe sounded a lot better than it turned out for me.  I ends up too runny and mushy for my tastes.  Still ediblejust not my best bread pudding.  Suggestions?"
  },
  {
    "_id": 2035,
    "recipe_id": 3672,
    "user_id": 1571,
    "user": "Linda Johansen",
    "Rating": 5,
    "Review": "I thought this recipe was very quick and easy and delicious. I made at Thanksgiving for my family and they really enjoyed it.  I'm making it again for some friends at work."
  },
  {
    "_id": 2036,
    "recipe_id": 3674,
    "user_id": 1572,
    "user": "Ed Paulhus",
    "Rating": 5,
    "Review": "It was A great recipe but I did not use the apples"
  },
  {
    "_id": 2037,
    "recipe_id": 3682,
    "user_id": 1573,
    "user": "benluc",
    "Rating": 5,
    "Review": "I have baked these biscotti before and they are excellent.  I'm so glad I could find the recipe again."
  },
  {
    "_id": 2038,
    "recipe_id": 3683,
    "user_id": 1596,
    "user": "Joan Edington",
    "Rating": 5,
    "Review": "This is a very tasty cake--my recipe calls for sprinkling the batter with 1/2 cup chopped nuts before baking--Delicious!!"
  },
  {
    "_id": 2039,
    "recipe_id": 3684,
    "user_id": 1598,
    "user": "Miss Daisy",
    "Rating": 5,
    "Review": "The French Onion soup recipe is one of the most popular dish served at the Famous Barr (also part of the May Dept store group) restaurants found in St.Louis.   Based on my travels to the various countries including EuropeAsia and USthis version of French Onion soup is one of the best I've had. My husband who is from London just loves this recipe."
  },
  {
    "_id": 2040,
    "recipe_id": 3685,
    "user_id": 1599,
    "user": "Mays Pearls of Wisd",
    "Rating": 5,
    "Review": "My grandma has been making this simple coffee cake for years.  It is a huge favorite for the whole family!  We add chopped pecans to ours.  Really easy for overnight company.  It rises overnight and you pop it in the oven before everyone gets up."
  },
  {
    "_id": 2041,
    "recipe_id": 3686,
    "user_id": 1600,
    "user": "Leon  Miriam Posvol",
    "Rating": 5,
    "Review": "This taste great!!!!!! Even my 3yr. old loved it"
  },
  {
    "_id": 2042,
    "recipe_id": 3687,
    "user_id": 1601,
    "user": "Gilcat2",
    "Rating": 5,
    "Review": "Everyone loved it. I have made it up twice in one week.  I put it up in the freezer in individual servings."
  },
  {
    "_id": 2043,
    "recipe_id": 3688,
    "user_id": 1603,
    "user": "Carol H",
    "Rating": 4,
    "Review": "Great recipeeveryone loved it,,young & old."
  },
  {
    "_id": 2044,
    "recipe_id": 3696,
    "user_id": 1604,
    "user": "itsjustme",
    "Rating": 4,
    "Review": "This recipe is greatespecially for chocolate lovers. It goes very well topped off with whipped cream. However the recipe never tells you what to do with the hazelnuts. So I just added them into the mixture along with the biscuits and turned the chocolate into it. It was delicious."
  },
  {
    "_id": 2045,
    "recipe_id": 3697,
    "user_id": 1605,
    "user": "William Fitzgerald",
    "Rating": 3,
    "Review": "Ok"
  },
  {
    "_id": 2046,
    "recipe_id": 3701,
    "user_id": 1609,
    "user": "Barbara Heller",
    "Rating": 5,
    "Review": "This is a wonderful holiday bread.  I make it every year and give some of the loaves to my close friends and neighbors who look forward to this special treat.  It is especially delicious served with a hot cup of Christmas tea."
  },
  {
    "_id": 2047,
    "recipe_id": 3704,
    "user_id": 1610,
    "user": "B  B Adams",
    "Rating": 0,
    "Review": "I''m really happy to read so many people are enjoying my Mothers recipe for cucumber salad. She would be absolutely thrilled. Thanks you so much. ENJOY."
  },
  {
    "_id": 2048,
    "recipe_id": 48,
    "user_id": 1612,
    "user": "JANIC412",
    "Rating": 4,
    "Review": "It was not the best that I ever ate but it was definately the best that I ever made. I didn't make it in the microwave but on the stove. I liked itand it was easy to make. One of the reasons it was probably not the best I ever ate is because I used chicken that was all ready cut up so there was no skin and less fat and less taste. I have to watch my fat intake."
  },
  {
    "_id": 2049,
    "recipe_id": 49,
    "user_id": 1613,
    "user": "george nuckols",
    "Rating": 0,
    "Review": "the finished product is excellent."
  },
  {
    "_id": 2050,
    "recipe_id": 50,
    "user_id": 1616,
    "user": "Melody",
    "Rating": 4,
    "Review": "Very unique & since garlic is my favorite ingredient...i love it!"
  },
  {
    "_id": 2051,
    "recipe_id": 51,
    "user_id": 1617,
    "user": "Irene Wilcox",
    "Rating": 5,
    "Review": "I made this soup pretty much as directed except I browned the meat in olive oiland added 2 bay leaves,and two cloves of garlic. I just had it for lunch and my sister and I thought it was excelent I will freeze the rest in individule serving sizes for my husband and I."
  },
  {
    "_id": 2052,
    "recipe_id": 53,
    "user_id": 1621,
    "user": "Quick n Easy Recipes",
    "Rating": 5,
    "Review": "Excellent chiliespecially liked it with the spaghetti.  I prefer more chili powder than the recipe called for.  Also makes for very good chili cheese fries."
  },
  {
    "_id": 2053,
    "recipe_id": 54,
    "user_id": 1629,
    "user": "Joy Boss",
    "Rating": 5,
    "Review": "I live on the Oregon coast and met and fell in love with a wonderful man from cinncinnati."
  },
  {
    "_id": 2054,
    "recipe_id": 55,
    "user_id": 1630,
    "user": "Tim  Tina Ireland",
    "Rating": 5,
    "Review": "I heard about this fudge this morning..looked up the recipe and made it..it is great..so easy and the best fudge I've ever eaten."
  },
  {
    "_id": 2055,
    "recipe_id": 56,
    "user_id": 1632,
    "user": "Peeter Raudvere",
    "Rating": 0,
    "Review": "Rum Flavoringmight have been her way of saying 100 proof Rum."
  },
  {
    "_id": 2056,
    "recipe_id": 57,
    "user_id": 1633,
    "user": "Julie chazelet",
    "Rating": 5,
    "Review": "I loved this recipevery tasty and makes a great appyi will be making it for my new years party."
  },
  {
    "_id": 2057,
    "recipe_id": 58,
    "user_id": 1634,
    "user": "Bill Hilbrich",
    "Rating": 5,
    "Review": "This was easy to make and handy to have in the freezer ready to just bake. I will have to learn to cut it down into four serving sizes though. It was to much just for my husband and I. I also added ground beef to mine. It tasted really good."
  },
  {
    "_id": 2058,
    "recipe_id": 59,
    "user_id": 1635,
    "user": "Jill McQuown",
    "Rating": 5,
    "Review": "BOY!  You sure can't eat just one of these muffins at a time. They were really great and easy to make. I even made a terrible mistakeI forgot to put the brown sugar in. The next two batches I make I will do right. I didn't think something with green chili in would taste good. Was I surprised."
  },
  {
    "_id": 2059,
    "recipe_id": 60,
    "user_id": 1636,
    "user": "carlanna livingstone",
    "Rating": 4,
    "Review": "Very good and really easy!!!"
  },
  {
    "_id": 2060,
    "recipe_id": 62,
    "user_id": 1639,
    "user": "elt8588",
    "Rating": 5,
    "Review": "I have made this recipe for the last 6-7yrs. at Christmas.  I usually don't like fudgebut this is GREAT.  I give it as gifts and everyone always asks for the recipe."
  },
  {
    "_id": 2061,
    "recipe_id": 63,
    "user_id": 1640,
    "user": "Seausoon39",
    "Rating": 5,
    "Review": "Best Chilli I have ever had.  Nice and spiceyfilling and againthe best chilli I have ever had."
  },
  {
    "_id": 2062,
    "recipe_id": 64,
    "user_id": 1641,
    "user": "June Neil",
    "Rating": 4,
    "Review": "These were incredibly easy and fast to make.  They stored well in the refrigerator...I brought them to my organization's holiday potluck on a nice paper plate.  They all went quicklyso there was no cleanup or any leftovers to take back home.  PS--my coworkers liked them!"
  },
  {
    "_id": 2063,
    "recipe_id": 66,
    "user_id": 1642,
    "user": "M Messer",
    "Rating": 5,
    "Review": "This is a great recipe... make ahead and broil before serving. My friends love this."
  },
  {
    "_id": 2064,
    "recipe_id": 67,
    "user_id": 1643,
    "user": "Mutende",
    "Rating": 5,
    "Review": "I made a double batch of this soup and added a medium onion and two cloves of garlic. It was easy and I thought it was really great. Of coarse potato soup is my favorite and this was the best that I have ever made. I am going to put in individual servings and freeze."
  },
  {
    "_id": 2065,
    "recipe_id": 70,
    "user_id": 1646,
    "user": "WildlifeDi",
    "Rating": 5,
    "Review": "I've often made these with different liquers. Orangeraspberry and peach are favorites.  Of coursewhen my husband makes themwith either rum or bourbonthey're a bit more \"liquidy\" than normal."
  },
  {
    "_id": 2066,
    "recipe_id": 71,
    "user_id": 1647,
    "user": "MJ  BARB HUNDAHL",
    "Rating": 5,
    "Review": "I love this soup it was great.  i would love to try to make it again some time to have.  I did tell all my friends about it and they loved it too.  ao to eveyone this is the best soup try it too."
  },
  {
    "_id": 2067,
    "recipe_id": 72,
    "user_id": 1648,
    "user": "a-j-b",
    "Rating": 0,
    "Review": "This recipe sounds interesting except what is the brine made of?"
  },
  {
    "_id": 2068,
    "recipe_id": 73,
    "user_id": 1649,
    "user": "Whtsebring",
    "Rating": 4,
    "Review": "It was my first time making sweet potatoesand this recipe was very simple and easy to follow. Everyone at Thanksgiving loved them."
  },
  {
    "_id": 2069,
    "recipe_id": 75,
    "user_id": 1652,
    "user": "Graham Scott",
    "Rating": 5,
    "Review": "This recipe is so versatile!  I've made it minty with flavoring. I've used nuts and marshmellows for a rocky road fudge."
  },
  {
    "_id": 2070,
    "recipe_id": 78,
    "user_id": 1654,
    "user": "Paula Maguire",
    "Rating": 5,
    "Review": "3 medium onions made a very tasty part of a meal for 3 persons. The recipe ingredients reads \"20 butter\" and \"onions\" but doesn't say  how many.  I used about a 1/2 C. butter and 3 medium onions & it worked out fine and the cooking time seemed to be the right time.  3 med. onions would serve 4 people. They would be really yummy atop a thick juicy filet mignon! In factI believe that this recipe could be included with a large number of meals of various types."
  },
  {
    "_id": 2071,
    "recipe_id": 79,
    "user_id": 1657,
    "user": "cwambeam",
    "Rating": 5,
    "Review": "This is the best eggnog I have ever had.  It's good with fat-free half & halftoo.  The writer suggested Jack Daniels might be good in itbut it is especially good with 1/2 cup of light rum (preferably Bacardi) and 1/2 cup of Crown Royal.  Delicious!"
  },
  {
    "_id": 2072,
    "recipe_id": 80,
    "user_id": 1659,
    "user": "WisTex",
    "Rating": 5,
    "Review": "This recipe was great! In order to make the recipe even easierI substituted the sweet potatoes with canned sweet potatoes -- and it STILL came out good. The entire family loved itincluding the kidsand my sister and mother-in-law asked for the \"secret\" recipe."
  },
  {
    "_id": 2073,
    "recipe_id": 82,
    "user_id": 1660,
    "user": "Mehitabel",
    "Rating": 4,
    "Review": "Delicious! And I was able to stretch the recipe to 4 cups of walnut halves with no problem. It takes about an hour from start to finishbut the coating needs to set a couple of hours in order for them not to stick together."
  },
  {
    "_id": 2074,
    "recipe_id": 83,
    "user_id": 1662,
    "user": "Anne Edgell",
    "Rating": 5,
    "Review": "Absolutely Delightful Recipe! Rich and Flavorful!"
  },
  {
    "_id": 2075,
    "recipe_id": 85,
    "user_id": 1664,
    "user": "Duane and Ginger Va",
    "Rating": 5,
    "Review": "this is a traditional dish my family has enjoyed on christmas eve for over 30 years. my mother passed away 2 years ago and it fell to me to keep the tradition going. i needed to recheck my memory and had a hard time finding this till i came across your site. many thanks and merry christmas"
  },
  {
    "_id": 2076,
    "recipe_id": 86,
    "user_id": 1667,
    "user": "Binkie45",
    "Rating": 5,
    "Review": "My daughter and I made this bread over Christmas and it was wonderful.  We left out the fruit--the bread lasted almost one day--the aroma was awesome!!! Everyone that came by the day we were baking our Christmas goodies wanted to stick around until THAT bread was done.  We have already made another loaf.  Thanks for a great recipe."
  },
  {
    "_id": 2077,
    "recipe_id": 87,
    "user_id": 1668,
    "user": "Medit",
    "Rating": 4,
    "Review": "There is no temperature given for baking these bars."
  },
  {
    "_id": 2078,
    "recipe_id": 89,
    "user_id": 1670,
    "user": "Evans",
    "Rating": 5,
    "Review": "While on my first visit to Ireland in July 1999the birthplace of parentsmy cousin and I stopped in Doolen near the Cliffs of Mohr and had this marvelous dark Irish Beef Stew cooked in Guinness Stout\"  at O'Connors Pub.  It was absolutely delicous and the first authentic Irish meal we had and while all the food was great there was nothing that could beat the Irish Stew.  When I found the recipe on this siteI immediately tried it and it is exactly like what we had in Ireland.  When my cousin came to dinner and I served ithe was sure I had gotten the recipe from O'Connors Pub while we were in Ireland.  It was a cinch to makedirections were very easy to follow and it practically cooks itself.  It is equally as good over mashed potatoes or rice.  Try ityou'll like it. The one ingredient I added was a \"wee bit of blarney"
  },
  {
    "_id": 2079,
    "recipe_id": 90,
    "user_id": 1671,
    "user": "Eduardo Maldonado",
    "Rating": 2,
    "Review": "The potatoes turned a very unappealing shade of gray.  Although they tasted ok once you got past the looksmy kids wouldn't eat them."
  },
  {
    "_id": 2080,
    "recipe_id": 91,
    "user_id": 1672,
    "user": "W1xyz",
    "Rating": 4,
    "Review": "This is a very good basic recipe and I just thought I would add the variation that I took.  It being the day after Christmas I had a ham bone I needed to use and my son wanted lentil soup.  I just wanted to make something a little different so I surfed the web until I found this one that was nice and basic but I added the ham bone and skipped the hot dogsadded two potatoes and a can of diced tomatoes to make a very delicious soup.  Thanks for the basics,"
  },
  {
    "_id": 2081,
    "recipe_id": 92,
    "user_id": 1673,
    "user": "Jay Grush",
    "Rating": 5,
    "Review": "very good!!!"
  },
  {
    "_id": 2082,
    "recipe_id": 93,
    "user_id": 1675,
    "user": "Jim Weller",
    "Rating": 5,
    "Review": "We had these for Christmas dinner and they are great. I added a 1/2 tsp. or cinnamon and placed a whole walnut on each Ball. Easy and fast and they were a hit"
  },
  {
    "_id": 2083,
    "recipe_id": 94,
    "user_id": 1676,
    "user": "Larry",
    "Rating": 2,
    "Review": "I'm sorrybut I tried this method for my Christmas turkey and the results just do not comapare with preparing a turkey the old-fashioned way . . . basting frequently in a roasting pan in a hot oven.  The turkey skin did not fully brown and the wings/legs had a distinct steamed texture.  This is an easier way of cooking a turkeybut sometimes easier is not better."
  },
  {
    "_id": 2084,
    "recipe_id": 100,
    "user_id": 1677,
    "user": "Klaus Alexander Sei",
    "Rating": 1,
    "Review": "Blueberries sink to bottom of bundt pan and stick.  I had planned on giving these cakes as Christmas presentshowevergave up after three attempts.   No amount of greasing or flouring the pan seemed to help."
  },
  {
    "_id": 2085,
    "recipe_id": 101,
    "user_id": 1678,
    "user": "Mary Lord",
    "Rating": 5,
    "Review": "Thank you for providing this recipe.  I'll let you know how the customer liked it."
  },
  {
    "_id": 2086,
    "recipe_id": 103,
    "user_id": 1679,
    "user": "news.mercuryin.es",
    "Rating": 2,
    "Review": "I was expecting a simplistic recipe but instead was provided a recipe with ingredients that I have never heard of (Gruyere Cheese) and measurement values that require research (150 ml of milk).  I think the consideration should be made for those of us who are new to this internet age and they should keep in mind that the cookers of the household are middle aged women who are use to regular methods of measurement."
  },
  {
    "_id": 2087,
    "recipe_id": 105,
    "user_id": 1680,
    "user": "Cathi Allen",
    "Rating": 1,
    "Review": "It is like rubber."
  },
  {
    "_id": 2088,
    "recipe_id": 110,
    "user_id": 1681,
    "user": "nancy5",
    "Rating": 5,
    "Review": "This is the recipe I have used for many years.  It is so yummy.  It is easy to make and a treat to eat.  It is good for every day type bread and wonderful to give as a gift.  It is a favorite of my family."
  },
  {
    "_id": 2089,
    "recipe_id": 113,
    "user_id": 1684,
    "user": "Katrina Streiff",
    "Rating": 0,
    "Review": "Goodbut I wished they were a bit more moist."
  },
  {
    "_id": 2090,
    "recipe_id": 115,
    "user_id": 1689,
    "user": "Kevin Kirkland",
    "Rating": 4,
    "Review": "This is really good for a little something different.  Alsoyou may want to vary the mayonnaise by adding cream cheesea few chivesgarlic powder and maybe a few other spices occasionally.  But it is really fine just \"as is.\"  I really enjoyed this.  Thanks!"
  },
  {
    "_id": 2091,
    "recipe_id": 119,
    "user_id": 1691,
    "user": "I Dunno",
    "Rating": 4,
    "Review": "This really is a great recipe. I substitute Chicken Broth for the water and at the end I add some cream (HeavyLight or Half & Half) just to add some creamy richness. Also for a special twist add some cooked baby shrimp (peeled & de-viened of course) 15-20 minutes before serving. And plenty of cracked Pepper and Soda Crackers :-) Enjoy."
  },
  {
    "_id": 2092,
    "recipe_id": 120,
    "user_id": 1692,
    "user": "MP562",
    "Rating": 0,
    "Review": "I just found this recipebut I am going to bake itwould be great with a salad...."
  },
  {
    "_id": 2093,
    "recipe_id": 121,
    "user_id": 3337,
    "user": "Erin Laddie",
    "Rating": 4,
    "Review": "It takes approximately 45 minutes to prepare meatballs & sauce. Serving size is approximately 38 meat balls. I used ground turkey instead of beef & came out much betterused fresh garlic & minced together with the onionsalso a dash of cajun & Itatilian seasonings made the meatballs a complete success."
  },
  {
    "_id": 2094,
    "recipe_id": 124,
    "user_id": 4244,
    "user": "Danny Bennett",
    "Rating": 5,
    "Review": "I doubled this recipe for Christmas dinner 2000 and everyone came back for 2nd's and some even for 3rd's.   Very easy to make.  I increased the cooking time to 60 min's and put a extra cheese on top for the last 15 min. uncovered for a nice crust of baked cheese."
  },
  {
    "_id": 2095,
    "recipe_id": 125,
    "user_id": 4242,
    "user": "marie m",
    "Rating": 5,
    "Review": "my family loved these.  fresher than any boughten poppers.  take some preparation timebut are well worth it."
  },
  {
    "_id": 2096,
    "recipe_id": 126,
    "user_id": 1566,
    "user": "Stephen Little",
    "Rating": 0,
    "Review": "Try dipping or coating one side with some good chocolate... even better!!!"
  },
  {
    "_id": 2097,
    "recipe_id": 127,
    "user_id": 3962,
    "user": "Erna House",
    "Rating": 1,
    "Review": "The recipe did not say to drain the juice from the pineapple and mandarin oranges and therefore it was very soupy!"
  },
  {
    "_id": 2098,
    "recipe_id": 128,
    "user_id": 4200,
    "user": "LC Liu",
    "Rating": 5,
    "Review": "I received this \"hoax\" email forward about 4 years agobut never attempted the recipe. A friend of the family made it for us just a few weeks ago and it tastes incredible! I can't believe I held on to this recipe for so long!!"
  },
  {
    "_id": 2099,
    "recipe_id": 129,
    "user_id": 4074,
    "user": "TJ Witt",
    "Rating": 5,
    "Review": "I made this recipe for Christmas and it was great!  The red and green coloring also made it festive-looking.  Itooleft out the bean sprouts and substituted cashews.  Even my picky Mother-in-law couldn't complain!!"
  },
  {
    "_id": 2100,
    "recipe_id": 130,
    "user_id": 4190,
    "user": "leeann walker",
    "Rating": 5,
    "Review": "Excellent Pumpkin Rollvery tasty. I add Pecans ontop of cream cheese filling"
  },
  {
    "_id": 2101,
    "recipe_id": 131,
    "user_id": 4312,
    "user": "Claude Santini",
    "Rating": 4,
    "Review": "Ravishing and delightfulvery easy to make."
  },
  {
    "_id": 2102,
    "recipe_id": 134,
    "user_id": 4309,
    "user": "Beverly Kaplan",
    "Rating": 4,
    "Review": "This recipe was easily adapted as a sugar free recipe--substituting Nutrisweet for sugar--My diabetic husband loved it--Thank-you"
  },
  {
    "_id": 2103,
    "recipe_id": 135,
    "user_id": 4329,
    "user": "melanie mcgackin",
    "Rating": 4,
    "Review": "AN extremely fast and easy to follow recipe! Though I did not add in the raisins or brandyI substituted drained crushed pineapple insteadturned out great. We served the dip with pineapple chunks and poundcake. Add in extra chocolate chips for sweetness!"
  },
  {
    "_id": 2104,
    "recipe_id": 138,
    "user_id": 4335,
    "user": "Tiina",
    "Rating": 0,
    "Review": "great recipe its delicious"
  },
  {
    "_id": 2105,
    "recipe_id": 143,
    "user_id": 4336,
    "user": "Marquise Patton",
    "Rating": 5,
    "Review": "This recipe is so easy I usually make two at a time. Not only does it taste greatbut I make them and put into the freezer to use at a church circleclub meetingor for friends who just happen to drop by.  I always try to keep at least one in the freezer."
  },
  {
    "_id": 2106,
    "recipe_id": 144,
    "user_id": 4340,
    "user": "Doug Thompson",
    "Rating": 0,
    "Review": "Concerning handling chili peppersit really is unnecessary to use gloves."
  },
  {
    "_id": 2107,
    "recipe_id": 145,
    "user_id": 4203,
    "user": "Amy12583",
    "Rating": 5,
    "Review": "I have had a hashbrown casserole similar to this as wellbut never got the recipe.  I am curious as how much sour cream should you put in then.  Thanks."
  },
  {
    "_id": 2108,
    "recipe_id": 147,
    "user_id": 4317,
    "user": "Kay Abbott",
    "Rating": 3,
    "Review": "This is a traditional way of making english bread pudding - but i live in Texas - does anyone know what they call suet in Texas? someone told me they only use it for birdseed???"
  },
  {
    "_id": 2109,
    "recipe_id": 148,
    "user_id": 4240,
    "user": "Christine Cipullo",
    "Rating": 0,
    "Review": "Have not tried this yetwas looking for crock-pot recipesbut Chicken Cacc. is one of my family's favorites and  it absolutely has to have red wine in itand green peppers."
  },
  {
    "_id": 2110,
    "recipe_id": 149,
    "user_id": 4353,
    "user": "Judith Boncaro",
    "Rating": 3,
    "Review": "This is only a low sodium recipe if you completely omit the salt - just use a little more pepperor some garlic powder."
  },
  {
    "_id": 2111,
    "recipe_id": 151,
    "user_id": 4353,
    "user": "Judith Boncaro",
    "Rating": 0,
    "Review": "Since 3 oz of anchovies contains 425 mg of sodiumI would guess that 2 anchovy fillets contain about 150 mg of sodium."
  },
  {
    "_id": 2112,
    "recipe_id": 152,
    "user_id": 1694,
    "user": "MaxinePeter",
    "Rating": 5,
    "Review": "It was totally tasty dudes"
  },
  {
    "_id": 2113,
    "recipe_id": 154,
    "user_id": 1697,
    "user": "Alan1",
    "Rating": 5,
    "Review": "Aren't there 6 or seven stars to choose from.  WOW!  I was so excited to see this recipe.  I absolutely loved this soup when my husband and I would go to Famous Barr 30 yearswhen he was in the seminary at Concordia St. Louis.  I have made it through the yearsbecause an aunt had sent me the recipe from her local SpringfieldIL newspaper about 20 years.  Once I lost itbut a friend retrieved it for me from the time she had asked me for it.  What I love about your site is the instant way to double or triple or whatever the recipe!  I make this recipe a number of times each yearbut I always make it for a big Christmas Party we have.  Everyone loves it and looks forward to it each year!  Thanks so much!  I always serve it with homemade bread and a Ceasar Salad.  I look forward to your newsletters."
  },
  {
    "_id": 2114,
    "recipe_id": 156,
    "user_id": 1698,
    "user": "CeeDee",
    "Rating": 5,
    "Review": "I haven't tried it yetbut when I do I will use cherry cola"
  },
  {
    "_id": 2115,
    "recipe_id": 157,
    "user_id": 1702,
    "user": "Alison Corfield",
    "Rating": 4,
    "Review": "I found this recipe to be very goodbut only gave it four stars as it called for (in my opinion) way too much celery and onions.  I cut the onions back to 1/2 cup and the celery to 1 cup.  I also added 1/3 cup grated carrots. My husband loved it!"
  },
  {
    "_id": 2116,
    "recipe_id": 158,
    "user_id": 1704,
    "user": "HELEN PEAGRAM_40951",
    "Rating": 5,
    "Review": "I substituted the green bell pepper with red and it was wonderful."
  },
  {
    "_id": 2117,
    "recipe_id": 160,
    "user_id": 1715,
    "user": "The Fradys",
    "Rating": 5,
    "Review": "Another great way to make this recipe is to put all the ingredients inside the flattened biscuit and then deep fry them this is a real pleaser any time in my house. This recipe is very easy and fun to make I hope to find some more fun recioes soon!"
  },
  {
    "_id": 2118,
    "recipe_id": 162,
    "user_id": 1717,
    "user": "JonquilJan",
    "Rating": 0,
    "Review": "This dish has been in homes across the south for as long as I can remember. Sometimes a little onion is added to the mixture. Goes great with any meal."
  },
  {
    "_id": 2119,
    "recipe_id": 163,
    "user_id": 1719,
    "user": "Dorothy1",
    "Rating": 4,
    "Review": "Very simple to make. there were no strange ingredents or a big mess. taste justlike my moms. very down home"
  },
  {
    "_id": 2120,
    "recipe_id": 164,
    "user_id": 1721,
    "user": "Denise3",
    "Rating": 5,
    "Review": "This is a great basic potato soup receipe!  I used two cups of half & half in place of two cups of milkand added 1/2 pound of cooked bacon plus two tbls. parsley. I took out the cheese to add the half & half!"
  },
  {
    "_id": 2121,
    "recipe_id": 165,
    "user_id": 1722,
    "user": "Jacqui Jones",
    "Rating": 1,
    "Review": "I believe there is a mistake in the amount of eggnog listed in this recipe...5 1/2 cups is too much and the batter overflows a 9x5"
  },
  {
    "_id": 2122,
    "recipe_id": 166,
    "user_id": 1723,
    "user": "Sergio  Dorothy G P",
    "Rating": 5,
    "Review": "Made it for daughter's weddinga GREAT hit!!"
  },
  {
    "_id": 2123,
    "recipe_id": 167,
    "user_id": 1724,
    "user": "goblait",
    "Rating": 4,
    "Review": "I made this dessert for a formal English Christmas dinner.  I did receive nothing but raves!  It was delicious and beautiful. As a matter of facta friend told me it was better than her friend'swho happens to be English.  I especially liked it because it did not call for a pudding mixbut rather a custard from scratchwhich was as easy to make as from a box. It was not difficult to make at all.  I also added frozen berries as well as the strawberrieswhich seemed to only enhance the flavors."
  },
  {
    "_id": 2124,
    "recipe_id": 169,
    "user_id": 1727,
    "user": "Laniakea",
    "Rating": 5,
    "Review": "Outstanding"
  },
  {
    "_id": 2125,
    "recipe_id": 170,
    "user_id": 1728,
    "user": "Philip and Karen Se",
    "Rating": 5,
    "Review": "Ilove this recipe ,it is so easy when you have kids. Just mix and serve."
  },
  {
    "_id": 2126,
    "recipe_id": 171,
    "user_id": 1730,
    "user": "Lintons Seafood",
    "Rating": 5,
    "Review": "I made these muffins to give in my Christmas gift packages. Everyone loved themand including myself. I followed the recipe exactlyand they were easy to make."
  },
  {
    "_id": 2127,
    "recipe_id": 173,
    "user_id": 1732,
    "user": "David Greene",
    "Rating": 4,
    "Review": "it can be made in 15 min.and i bake mine in 25 min."
  },
  {
    "_id": 2128,
    "recipe_id": 176,
    "user_id": 1735,
    "user": "Tracey Kehne",
    "Rating": 0,
    "Review": "I need to try this.....This is typical recipe from my Mother's side of the family. \"use this much\" i can not see this much on the phone."
  },
  {
    "_id": 2129,
    "recipe_id": 177,
    "user_id": 1736,
    "user": "jinx3218",
    "Rating": 4,
    "Review": "This was a very refreshing salad. It''s not time consuming and ingredients were simple. My husband and I are enjoying eating lighter and healthier meals and this one is excellent! Thank You..."
  },
  {
    "_id": 2130,
    "recipe_id": 179,
    "user_id": 1737,
    "user": "Teddi2",
    "Rating": 0,
    "Review": "Is it possible to rate a recipe MINUS five stars?  I'm in a pinchI log on to find some quick and easy app. recipesand this is what I get.  You people should call yourselves \"recipizarre.com\"  Thanks for being no help at all.  It wasn't even that funny."
  },
  {
    "_id": 2131,
    "recipe_id": 181,
    "user_id": 1739,
    "user": "Kathleen Wiseman",
    "Rating": 5,
    "Review": "Great recipe!  Several changes might help thicken the soup a bit.  I used half and half instead of plain milk.  Also1 tsp. corn starch mixed with hot water helped to thicken. I added some small cubes of potato and some celery. This makes the soup complete."
  },
  {
    "_id": 2132,
    "recipe_id": 183,
    "user_id": 1742,
    "user": "Joel Schwarz",
    "Rating": 2,
    "Review": "Thai soup without lemon grass??....don't think so"
  },
  {
    "_id": 2133,
    "recipe_id": 186,
    "user_id": 1743,
    "user": "Robin Cowdrey",
    "Rating": 4,
    "Review": "I used olive oil instead of lard {I didnt have any in the house} and I only used 1 onion. I think it tuned out great. Thanks for the recipeand I hope to hear from you soon."
  },
  {
    "_id": 2134,
    "recipe_id": 189,
    "user_id": 1746,
    "user": "Mr. Bill",
    "Rating": 4,
    "Review": "wasn't that bad ??????? why do the always make the chicken so big in the market place."
  },
  {
    "_id": 2135,
    "recipe_id": 191,
    "user_id": 1747,
    "user": "Gloria Reyes",
    "Rating": 5,
    "Review": "It was a great dish my family loved it I couldn't make as much as I wanted to but I got it finished"
  },
  {
    "_id": 2136,
    "recipe_id": 193,
    "user_id": 1749,
    "user": "Pam Wood",
    "Rating": 5,
    "Review": "delicious desserta little hard to make when you need something for the same day. Maybe you can find a faster and easier version of this same dessert."
  },
  {
    "_id": 2137,
    "recipe_id": 209,
    "user_id": 1751,
    "user": "Jjortikka",
    "Rating": 4,
    "Review": "I finally found the recipe for \"Chow Chow Pickles\"."
  },
  {
    "_id": 2138,
    "recipe_id": 210,
    "user_id": 1754,
    "user": "mark anderson",
    "Rating": 4,
    "Review": "I am a true chocolate pie lover.  I cooked the pie as directed using one deep dish 9\" pie pan and a ready made refrigerated pie crust (next time I will make it with my own crust).  The filling sliced very well and yet it was creamy and delicious.  I made the meringue using the 2 egg whites from the eggs used in the fillingadding 1/4 tsp of cream of tartar and 3 tbsp of sugarand then baking at 400 degrees until golden.  Over all very good."
  },
  {
    "_id": 2139,
    "recipe_id": 217,
    "user_id": 1756,
    "user": "Stacy L Volpe",
    "Rating": 5,
    "Review": "very healthy scone  great web site thank you ii  have 2 tennage girls so they are into recipes ok thanks once a gain"
  },
  {
    "_id": 2140,
    "recipe_id": 218,
    "user_id": 1760,
    "user": "Cheryl Thebeau-Blev",
    "Rating": 4,
    "Review": "Very good but not a 5 star"
  },
  {
    "_id": 2141,
    "recipe_id": 221,
    "user_id": 1761,
    "user": "Moe Martin",
    "Rating": 4,
    "Review": "Very good receipe. The taste is great!"
  },
  {
    "_id": 2142,
    "recipe_id": 223,
    "user_id": 1762,
    "user": "lkadlec",
    "Rating": 5,
    "Review": "When I was a boy in the 1930s my brother and I would catch bull frogs and father would dispatch and prepare themwe also picked wild button and shaggy main mushroomscleaned all and fried in butterserved on toast and devoured."
  },
  {
    "_id": 2143,
    "recipe_id": 225,
    "user_id": 1763,
    "user": "Gregg",
    "Rating": 3,
    "Review": "Apparently I got the wrong pork chops for this receipe!!!  I only cooked for 1 1/2 hrs and they were way to dry...if I had cooked for 2 they would have been hockey pukes!!!  The taste was goodbut I would diffently watch the time and cooking of the chops. Maybe just an hourcovered."
  },
  {
    "_id": 2144,
    "recipe_id": 226,
    "user_id": 1765,
    "user": "STEVE BEDELL",
    "Rating": 5,
    "Review": "I skipped the bread bowls and used fresh italian parsleya little rosemary and thymeand it was great.  Left it chunky too."
  },
  {
    "_id": 2145,
    "recipe_id": 227,
    "user_id": 1771,
    "user": "Joanne Wallace",
    "Rating": 5,
    "Review": "Great recipe for anyone who like it as close as it come to the real thing! Very simple to make and you can find all the ingredents in your local supermarket! I myself would cut back on the white pepper and add a little bit of hot oil (not to much)! I would also add about 1 1/2 tbls more of vineger. (or to taste) add a little more meat and you can serve with a bowl of white rice with steamed veggies for a meal of its own."
  },
  {
    "_id": 2146,
    "recipe_id": 234,
    "user_id": 3794,
    "user": "Sally Wolfe",
    "Rating": 5,
    "Review": "My husband and I simply loved this soup. I added half a medium onion to mineand put in four cloves of garlic instead of two. We sprinkled shredded mozzarella cheese on ours before enjoying."
  },
  {
    "_id": 2147,
    "recipe_id": 238,
    "user_id": 3253,
    "user": "l.lahn",
    "Rating": 2,
    "Review": "This cake didn't rise much.  Also the temperature of 350F. is too high.  The cake burnedpossibly because I used a teflon coated cake pan.  I did turn heat down to 325 but the damaged was already done."
  },
  {
    "_id": 2148,
    "recipe_id": 245,
    "user_id": 5014,
    "user": "Shelly Head",
    "Rating": 5,
    "Review": "This recipe was simple to make and easy to convert to serve more people.  I like the fact that the ingredients are those usually found in someones pantry and that preparation time was 10 minutes or less to combine and could be left alone in the oven to cook.  Wish all recipes were this easy and delicious.  I will definetly add this to my keeper list."
  },
  {
    "_id": 2149,
    "recipe_id": 248,
    "user_id": 5148,
    "user": "R Schlei",
    "Rating": 4,
    "Review": "A fantastic version - very fragrant and complex taste.  Highly recommended for those who like spicy eggplant."
  },
  {
    "_id": 2150,
    "recipe_id": 252,
    "user_id": 2695,
    "user": "Hungarian Gypsy",
    "Rating": 1,
    "Review": "This recipe needs a little help !"
  },
  {
    "_id": 2151,
    "recipe_id": 257,
    "user_id": 2695,
    "user": "Hungarian Gypsy",
    "Rating": 5,
    "Review": "This dish was excellent.  The sauce turned out wonderful and was an excellent choice for the pork chops !"
  },
  {
    "_id": 2152,
    "recipe_id": 258,
    "user_id": 4564,
    "user": "mary sharp",
    "Rating": 5,
    "Review": "this is wonderful very easy but i used cooked pudding. has more lemon pie taste"
  },
  {
    "_id": 2153,
    "recipe_id": 259,
    "user_id": 5199,
    "user": "Karen Fink",
    "Rating": 1,
    "Review": "I think this was the most awfulest punch I have ever tasted hope someone else has better luck!!!!!"
  },
  {
    "_id": 2154,
    "recipe_id": 260,
    "user_id": 5203,
    "user": "Beverly Balkwell",
    "Rating": 4,
    "Review": "This recipe makes a 2 pound loaf. I used the white bread setting (3 hrs). The loaf was beautifultexture was good. The only thing was my machine destroyed the cherries ( I added them as stated in recipe)."
  },
  {
    "_id": 2155,
    "recipe_id": 261,
    "user_id": 5264,
    "user": "danny sayre",
    "Rating": 4,
    "Review": "very easy to make,about 5 minutes. the recipe made 9 pancakes 6 inchs round fluffy very light. I was pleased that butter and syrup didn't \"water log\" the cakes. You could add any fruit in this recipe. Overall these were the best I've ever made.  thank you dansa111"
  },
  {
    "_id": 2156,
    "recipe_id": 265,
    "user_id": 5280,
    "user": "Anita Novotny",
    "Rating": 4,
    "Review": "This casserole was very tasty but a little time consuming to prepare. Next time I know we are going to have this dish (and we definitally will be having it again) I will do the prep work ahead of time."
  },
  {
    "_id": 2157,
    "recipe_id": 271,
    "user_id": 5285,
    "user": "Michael Dahlquist",
    "Rating": 3,
    "Review": "It's between three and four starsreally. Easy to make and good tastin'. It's stick-to-your-ribs stuffit's like chicken paellaand that's pretty good. I am glad I made itI will make it againit will be my lunch for the next three weeks."
  },
  {
    "_id": 2158,
    "recipe_id": 279,
    "user_id": 5142,
    "user": "Catcooks123",
    "Rating": 4,
    "Review": "I wanted a new way to prepare thick pork chops for my family ,and this was really good. I used Lawerys season salt instead of accentand salt. The gravy smelled a little like a marsala sauce. The meat was so tender this wayso much better than dried out broiled thick pork chops."
  },
  {
    "_id": 2159,
    "recipe_id": 281,
    "user_id": 5328,
    "user": "Janie Woodall",
    "Rating": 5,
    "Review": "I used Cream of chicken instead of mushroom and it was wonderful !!! My whole family loved it !!"
  },
  {
    "_id": 2160,
    "recipe_id": 282,
    "user_id": 4884,
    "user": "Carmen",
    "Rating": 5,
    "Review": "Baklava is in fact Greek..I moved from Greece a little over 3 years ago and therefore your feeble-minded Turkish opinion means nothing."
  },
  {
    "_id": 2161,
    "recipe_id": 288,
    "user_id": 5227,
    "user": "rhonda lambert",
    "Rating": 4,
    "Review": "my family like the bamboo shoots whole. but we love your recipe"
  },
  {
    "_id": 2162,
    "recipe_id": 290,
    "user_id": 5227,
    "user": "rhonda lambert",
    "Rating": 4,
    "Review": "the lemon rind made it tastier. great recipe"
  },
  {
    "_id": 2163,
    "recipe_id": 291,
    "user_id": 3858,
    "user": "Vicki Summers",
    "Rating": 4,
    "Review": "No kidding - stir almost constantly. We really liked it. Warmed well in the microwave."
  },
  {
    "_id": 2164,
    "recipe_id": 293,
    "user_id": 5357,
    "user": "Jeanne H",
    "Rating": 5,
    "Review": "This is the best way to serve shoepeg corn there is...we make the same recipe but use two cans of the shoepeg cornand no beans.  It's yummy for Thanksgiving."
  },
  {
    "_id": 2165,
    "recipe_id": 296,
    "user_id": 5355,
    "user": "Rena Reeve",
    "Rating": 5,
    "Review": "I made this bread with a little milk (instead of dry milk) and a little coffee (instead of instant).  AlsoI made it using my mixer with dough hook instead of a bread machine.  It worked very well.  Best pumpernickel I have tasted!"
  },
  {
    "_id": 2166,
    "recipe_id": 298,
    "user_id": 5420,
    "user": "Andrew Murray",
    "Rating": 2,
    "Review": "Why do you have to bake pork chops,this is a B.B.Q recipe. Depending on the size and the amount of time to marinate,they shouldn't be more than 15-20 minutes on the B.B.Q"
  },
  {
    "_id": 2167,
    "recipe_id": 302,
    "user_id": 5090,
    "user": "Marcia Detrick",
    "Rating": 5,
    "Review": "Just the type recipe I came to this site for. I am going to take this to a Super Bowl party on Sunday"
  },
  {
    "_id": 2168,
    "recipe_id": 306,
    "user_id": 4925,
    "user": "christine story",
    "Rating": 5,
    "Review": "We really like this dipit''s creamy & tasty.  I added a little more green onions (including the tops)& some garlic powder (I put that in just about everything that I think it would add a little more zingplus it''s good for you)."
  },
  {
    "_id": 2169,
    "recipe_id": 309,
    "user_id": 5398,
    "user": "gary gierloff",
    "Rating": 5,
    "Review": "if you love clams and garlic you will love this recipe. I plan to make large quanties for the upcoming superbowl party at the hitchin post in salem oregon.go ravens."
  },
  {
    "_id": 2170,
    "recipe_id": 311,
    "user_id": 5385,
    "user": "Cristina Stanfill",
    "Rating": 3,
    "Review": "Be aware that this is the EXACT recipe that is printed in the booklet that comes with a new crockpot."
  },
  {
    "_id": 2171,
    "recipe_id": 312,
    "user_id": 5471,
    "user": "Olivia Cato",
    "Rating": 3,
    "Review": "It was pretty goodbut then again I was really hungry.  Needs more chicken and more cheese."
  },
  {
    "_id": 2172,
    "recipe_id": 313,
    "user_id": 5461,
    "user": "Sarah Stluka",
    "Rating": 5,
    "Review": "This casserole is the best I have ever had.  My grandmother makes it for Christmas every year and I just had to have the recipe."
  },
  {
    "_id": 2173,
    "recipe_id": 315,
    "user_id": 5049,
    "user": "Cynthia Caffey Schw",
    "Rating": 4,
    "Review": "This is easy and very good.  Our family loved it."
  },
  {
    "_id": 2174,
    "recipe_id": 320,
    "user_id": 5049,
    "user": "Cynthia Caffey Schw",
    "Rating": 3,
    "Review": "This was easy to makebut when mashing the potatoes and garlicbe sure to get the garlic mashed.  It is hard to find it in the potatoesso you need to mash it all well.  The taste is subtlebut true.  You may want to add a little more butter and salt."
  },
  {
    "_id": 2175,
    "recipe_id": 321,
    "user_id": 1773,
    "user": "Malarkey Test",
    "Rating": 3,
    "Review": "this was okay.  too greasy for my tastes."
  },
  {
    "_id": 2176,
    "recipe_id": 322,
    "user_id": 4105,
    "user": "Bill de Bruler",
    "Rating": 4,
    "Review": "I would rate this one a five-star if the hot pepper flakes were omitted. I would omit the hot pepper flakes and use 3 cans of tomatoes and add 1 can of tomato and green chile's. Also for the next time I prepare the recipe I will devein and shell the shrimp then sprinkle cajun spice mix and let the shrimp marinate in it. If anyone attempts this recipe and uses 1/4 cup of the hot pepper flakes you will probably not be able to eat it if you cannot handle hot and spicy food. Believe me I am an amateur Cajun Chef and I could eat the dish but most people could not handle it. I will make this dish because it is rather quick and it is a one dish meal. I will however change it as stated in the beginning of this comment/rating."
  },
  {
    "_id": 2177,
    "recipe_id": 324,
    "user_id": 5446,
    "user": "Fedelma Dixon",
    "Rating": 3,
    "Review": "No vanilla?  No butter?  Wasn't sure what to do about thatbut the pie is good."
  },
  {
    "_id": 2178,
    "recipe_id": 327,
    "user_id": 3856,
    "user": "jonathan armytage",
    "Rating": 3,
    "Review": "average taste. Not particularly subtle"
  },
  {
    "_id": 2179,
    "recipe_id": 330,
    "user_id": 5049,
    "user": "Cynthia Caffey Schw",
    "Rating": 5,
    "Review": "First of allI used a 4 pound pork tenderloininstead of 1 pound.  It took 1 hour to bakeso not much longer and was 170 degrees inside.  NextI didn't have the time to marinade overnightso I used garlic powder and marinaded for about 20 minutes.  It turned out wonderful.  Probably the best pork we have had.  It was tendermoist and flavorful.  I also substituted black pepper for white pepper."
  },
  {
    "_id": 2180,
    "recipe_id": 332,
    "user_id": 5235,
    "user": "LJ S3213",
    "Rating": 4,
    "Review": "absolutely fabulousreceived high praise from family members."
  },
  {
    "_id": 2181,
    "recipe_id": 334,
    "user_id": 5355,
    "user": "Rena Reeve",
    "Rating": 0,
    "Review": "I recommend this recipe because I've eaten these muffins many times.  These muffins taste great heated in the micro and then covered with natural applesauce.  A little cinnamon sugar on top makes it the perfect breakfast treat!"
  },
  {
    "_id": 2182,
    "recipe_id": 339,
    "user_id": 5484,
    "user": "Deidre Gilbert",
    "Rating": 5,
    "Review": "After extensive research on turkey soup recipesyou were my first choice.  Now your turkey soup has become \"Deidre's famous turkey soup\".  I have a stomach condition that requires soup on a daily basis and having previously not liked soupthis was a difficult step for me.  But your recipe has converted me into a soup lover.  It works great for chicken too.  Thank you for adding spicesherbs and FLAVOUR to your recipe.  It really is different and great tasting.  Your efforts to get this out to people like me is very much appreciated."
  },
  {
    "_id": 2183,
    "recipe_id": 340,
    "user_id": 5495,
    "user": "annaclaire crocco",
    "Rating": 4,
    "Review": "great when sprinkled with grated parmasaen cheese just before serving!"
  },
  {
    "_id": 2184,
    "recipe_id": 341,
    "user_id": 1773,
    "user": "Malarkey Test",
    "Rating": 4,
    "Review": "interesting. i added celery and some cilantro.  i think i made it a bit too hot though."
  },
  {
    "_id": 2185,
    "recipe_id": 343,
    "user_id": 5503,
    "user": "Jules Yoken",
    "Rating": 0,
    "Review": "Sounds a bit like Bigos"
  },
  {
    "_id": 2186,
    "recipe_id": 347,
    "user_id": 5285,
    "user": "Michael Dahlquist",
    "Rating": 3,
    "Review": "Basicsimple - but it's goodand taught me a thing or two about making good thai (?) soup - never cooked with lemon grassbut it was yummy. Simple to make and wholesome and creamy without dairyI'd forgotten the charms of coconut milk."
  },
  {
    "_id": 2187,
    "recipe_id": 349,
    "user_id": 5519,
    "user": "amity bradley",
    "Rating": 5,
    "Review": "My boyfriend and i were very pleased with this recipe. he is half chinese so he knows the good stuff. the only thing we changed was the amount of chili paste. we only put one tablespoon instead of 2. the soup is very very spicy with 2 tblsp's. other than that it was great. the flavor is awesome. my boyfriend said that it tasted just like his mom's. that is a great compliment."
  },
  {
    "_id": 2188,
    "recipe_id": 350,
    "user_id": 5681,
    "user": "ravindra mandagere",
    "Rating": 3,
    "Review": "the baking time of 1 hour at 300 degrees plus"
  },
  {
    "_id": 2189,
    "recipe_id": 352,
    "user_id": 5683,
    "user": "Patricia Fitzgerald",
    "Rating": 4,
    "Review": "Suggestion:  Subsitiution for bread crumbs. You can also use Cereal(corn-flakes)Crackers,and sometimes you can use Corn chips to."
  },
  {
    "_id": 2190,
    "recipe_id": 356,
    "user_id": 5689,
    "user": "Berevaline Windsor",
    "Rating": 5,
    "Review": "Wow!!!  Egyptian food!!!  Cool!!!"
  },
  {
    "_id": 2191,
    "recipe_id": 358,
    "user_id": 5686,
    "user": "Mariya Davis",
    "Rating": 5,
    "Review": "The dish is wonderful! It so easy to makeit takes 15-20 min :). Also I like to serve it with butter and sour cream. Everytime I cook Spaetzle my husband ask if there anything is left. ThoughI always cook more. Tryand you''ll see how easy and delicious it is!"
  },
  {
    "_id": 2192,
    "recipe_id": 361,
    "user_id": 5704,
    "user": "Francesca Tabaranza",
    "Rating": 4,
    "Review": "Variationinstead of vinegar use freshly squeezed lemon juice."
  },
  {
    "_id": 2193,
    "recipe_id": 362,
    "user_id": 5523,
    "user": "Dave C",
    "Rating": 4,
    "Review": "This looks good. My grandkids will love me. thanks.  :>))"
  },
  {
    "_id": 2194,
    "recipe_id": 364,
    "user_id": 1872,
    "user": "Lisa Rittel",
    "Rating": 5,
    "Review": "I have had this before. It has really good flavor!Be sure to use salted pretzelsthey really make the dish good."
  },
  {
    "_id": 2195,
    "recipe_id": 366,
    "user_id": 1873,
    "user": "Leslie Ashenfelter",
    "Rating": 5,
    "Review": "It was delicious. And very easy too. Even a little kid could make it."
  },
  {
    "_id": 2196,
    "recipe_id": 368,
    "user_id": 1886,
    "user": "HELEN PEAGRAM",
    "Rating": 5,
    "Review": "It was DELICIOUS and so easy too. My six year old niece even made it herself. It is such a healthy snack."
  },
  {
    "_id": 2197,
    "recipe_id": 370,
    "user_id": 1887,
    "user": "Vicky Sinclair",
    "Rating": 5,
    "Review": "Hello!  My family used to use chicken feet in our soup and it was wonderful.  I was raised on a grain and dairy farmwe raised everythingprocessed our own meatcanned all our own vegetables etc.  It's so nice to come across all these wonderful recipes.  June Bug"
  },
  {
    "_id": 2198,
    "recipe_id": 371,
    "user_id": 1889,
    "user": "spam4409",
    "Rating": 0,
    "Review": "I had a Great Aunt that made the most wonderful dill pickles she told me that her secret was that she used rain water.  How interesting.  June Bug"
  },
  {
    "_id": 2199,
    "recipe_id": 372,
    "user_id": 1893,
    "user": "Pam Whitmire",
    "Rating": 5,
    "Review": "As a helper of a girl scout troopone of a projects to earn a badge was to prepare an ethnic meal.  We chose and Italian meal and for dessert we chose these cookies.  The girls really enjoyed making and EATING them.  We got about 5 1/2 dozen cookies from a batch.  Thanks for a really wonderful and delicious recipe."
  },
  {
    "_id": 2200,
    "recipe_id": 373,
    "user_id": 2178,
    "user": "troyh",
    "Rating": 5,
    "Review": "awesome....kids loved it!!!!!"
  },
  {
    "_id": 2201,
    "recipe_id": 375,
    "user_id": 10033,
    "user": "spatchcock",
    "Rating": 0,
    "Review": "This is a great recipe that's too easy."
  },
  {
    "_id": 2202,
    "recipe_id": 377,
    "user_id": 22015,
    "user": "Mysterygirl",
    "Rating": 4,
    "Review": "This recipe was very easy to makeand it turned out great! The cooking temperature was not specifiedso I used 350 degrees. AlsoI subbed low fat ricotta cheese for cottage cheese because I prefer the taste."
  },
  {
    "_id": 2203,
    "recipe_id": 379,
    "user_id": 25843,
    "user": "Crab Place",
    "Rating": 5,
    "Review": "Easy to follow recipe.  Wonderful taste. Had no problems with cake or blueberrys sticking to pan."
  },
  {
    "_id": 2204,
    "recipe_id": 380,
    "user_id": 28729,
    "user": "Auntie Jan",
    "Rating": 5,
    "Review": "I haven't made this as yettoday is Feb. 18,2001but I boiled the carcass of a turkey and the ingredients you have listed just fit us to a tee.  I just happened on this site looking for a quickeasytasty soup.  I am rating it even though I haven't tasted it yet.  I can just tell by the ingredients. I would serve it with crusty bread and a nice light white wine.  Preferably Gallo's white Zinfandel.  Nice going!!"
  },
  {
    "_id": 2205,
    "recipe_id": 383,
    "user_id": 34879,
    "user": "Barefoot Beachcomber",
    "Rating": 4,
    "Review": "I have made these and they are deliciousI also have made them with the Cherry"
  },
  {
    "_id": 2206,
    "recipe_id": 384,
    "user_id": 35526,
    "user": "riffraff",
    "Rating": 4,
    "Review": "We cut up some chorizo (instead of andouille) and put it into the sauceand used it on chicken. It was greatbut with a salty sausage like chorizousing the recommended amount of salt in the recipe was a little too much. I would definitely reccomend this for anyone who loves barbeque!"
  },
  {
    "_id": 2207,
    "recipe_id": 385,
    "user_id": 35635,
    "user": "_Pixie_",
    "Rating": 2,
    "Review": "Wayway too lemony.  I ate about half of my meal and vowed never to eat anything with lemon in it again.  I marinated overnight...  Bad idea!  I imagine this recipe could be great with a little tweaking."
  },
  {
    "_id": 2208,
    "recipe_id": 396,
    "user_id": 39194,
    "user": "OzMan",
    "Rating": 2,
    "Review": "I love Red Lobster caesar salad dressing.  I have looked the net over to find a recipe that tastes like it.  This recipe is alrightbut to me still tastes NOTHING like Red Lobster's caesar dressing.  Guess I'll keep looking."
  },
  {
    "_id": 2209,
    "recipe_id": 399,
    "user_id": 39547,
    "user": "Julesong",
    "Rating": 4,
    "Review": "Add a drop or two of Tabasco sauce to each one to give them a little kick.  I put the Tabasco sauce on top of the cream cheese layer.  Try ityou'll like it."
  },
  {
    "_id": 2210,
    "recipe_id": 401,
    "user_id": 39636,
    "user": "Chrissyo",
    "Rating": 4,
    "Review": "very good,easy to follow"
  },
  {
    "_id": 2211,
    "recipe_id": 402,
    "user_id": 47510,
    "user": "Dreamgoddess",
    "Rating": 4,
    "Review": "This was easy to make and very YUMMY!"
  },
  {
    "_id": 2212,
    "recipe_id": 403,
    "user_id": 51011,
    "user": "Loves2Teach",
    "Rating": 5,
    "Review": "This is a great recipe....It didn't take too much time to prepare and the final results were delicious!"
  },
  {
    "_id": 2213,
    "recipe_id": 406,
    "user_id": 51109,
    "user": "Vina7737",
    "Rating": 2,
    "Review": "I thought the gingerstar anise and parsnips are some of the most important ingredients in the soup.  I have read the recipe many times to find out when to add those ingredients.  No luck.  Can't find it."
  },
  {
    "_id": 2214,
    "recipe_id": 407,
    "user_id": 52448,
    "user": "PetsRus",
    "Rating": 5,
    "Review": "i thought that this was really really yummy."
  },
  {
    "_id": 2215,
    "recipe_id": 409,
    "user_id": 55166,
    "user": "peppermintkitty",
    "Rating": 4,
    "Review": "This was really goodhoweverI left out the turnips due to a family memebers dislikebut added 2 tblsp of worshirer sauce. YUM!!!"
  },
  {
    "_id": 2216,
    "recipe_id": 410,
    "user_id": 56112,
    "user": "Jellyqueen",
    "Rating": 0,
    "Review": "I would just like to say that this recipe comes from the cookbookThe Complete Soy Cookbookby Paulette Mitchell."
  },
  {
    "_id": 2217,
    "recipe_id": 412,
    "user_id": 64203,
    "user": "Dine  Dish",
    "Rating": 0,
    "Review": "This is a great recipe! Try serving with hollandaise sauce."
  }
]